// sza131111-1505  
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПараметрыФормы = Новый Структура("ДокументСсылка", Объект.Ссылка);
	формаОтчетаДвижения = ПолучитьФорму("Отчет.ДвиженияДокумента.Форма", ПараметрыФормы);
	формаОтчетаДвижения.Открыть();
	
	Отказ = ИСТИНА;
	ПоказатьЗначение(Неопределено, Объект.ПартияПриобретения);	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.ПартияПриобретения) Тогда
		Отказ = ИСТИНА;	
	КонецЕсли;
	   
КонецПроцедуры



