//sza131111-1505 Хозяин: 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.ПартияПриобретения) Тогда
		Отказ = Истина;	
	КонецЕсли;
	   
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПараметрыФормы = Новый Структура("ДокументСсылка", Объект.Ссылка);
	формаОтчетаДвижения = получитьФорму("Отчет.ДвиженияДокумента.Форма.ФормаОтчета", ПараметрыФормы);
	формаОтчетаДвижения.Открыть();
	
	ОткрытьЗначение(Объект.ПартияПриобретения);
	Отказ = Истина;
	
КонецПроцедуры
