//sza131111-1505  
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПараметрыФормы = Новый Структура("ДокументСсылка", Объект.Ссылка);
	формаОтчетаДвижения = получитьФорму("Отчет.ДвиженияДокумента.Форма.ФормаОтчета", ПараметрыФормы);
	формаОтчетаДвижения.Открыть();
	
	ОткрытьЗначение(Объект.ПартияПриобретения);
	Отказ = ИСТИНА;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.ПартияПриобретения) Тогда
		Отказ = ИСТИНА;	
	КонецЕсли;
	   
КонецПроцедуры



