// sza131111-1505

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ПараметрыФормы = Новый Структура("ДокументСсылка", Объект.Ссылка);
	ОткрытьФорму("Отчет.ДвиженияДокумента.Форма", ПараметрыФормы);
	Отказ = ИСТИНА;
	ПоказатьЗначение(Неопределено, Объект.ПартияПриобретения);

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если НЕ ЗначениеЗаполнено(Объект.ПартияПриобретения) Тогда
		Отказ = ИСТИНА;
	КонецЕсли;

	ОбщийМодульСервисСервер.ОбработатьНовуюФорму(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура РеакцияНаПрочиеСобытияФормы(КомандаСобытияФормы) Экспорт // Для реакции на события для запрограммированных элементов
	ОбщийМодульКлиент.РеакцияНаПрочиеСобытияФормы(КомандаСобытияФормы, ЭтаФорма);
КонецПроцедуры
