//sza140723-2208

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьРегионыДляУчетаСтранАЛокацииГородов") Тогда
		Элементы.СправочникРегионыОткрытьСписок.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Справочник Стран");
		Элементы.СправочникЛокацииОткрытьСписок.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Справочник Городов");
	Иначе
		Элементы.СправочникРегионыОткрытьСписок.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Справочник Регионов");
		Элементы.СправочникЛокацииОткрытьСписок.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Справочник Локаций");
	КонецЕсли;
	
КонецПроцедуры
