//sza131111-1824 

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если не ОбщийМодульСервер.ПроверитьДокументПроведен(ПараметрКоманды) Тогда
		Если ОбщийМодульСервер.ПроверитьПользовательИмеетПравоМенятьЦены() тогда
			
			Коэффициент = 1;
			ВвестиЧисло(Коэффициент, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Коэффициент для Цен:"), 12, 6);
			Состояние(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Пересчет цен для таблицы товаров по коэффициенту..") + Коэффициент);
			ОбщийМодульКлиент.ДобавитьСобытиеЖурнала(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Пересчитал Цены товаров по коэффициенту") + Коэффициент, 2, ПараметрКоманды);
			ОбщийМодульКлиент.ПересчитатьТоВары(ПараметрКоманды, Коэффициент);	
			
		Иначе
			Сообщить(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("У Вас нет права менять цены!"), СтатусСообщения.Внимание);
		КонецЕсли;
		
	Иначе
		Сообщить(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Документ уже проведен. Изменения не произведены."), СтатусСообщения.Информация);
	КонецЕсли;
	
КонецПроцедуры