//sza140420-1356  
//sza131111-1824 
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("000200", , , );
	
	Если НЕ Отказ Тогда	
		Если НЕ ОбщийМодульСервер.ПроверитьДокументПроведен(ПараметрКоманды) Тогда
			Если ОбщийМодульСервер.ПроверитьПользовательИмеетПравоМенятьЦены() Тогда
				
				Коэффициент = 1;
				Если ВвестиЧисло(Коэффициент, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Коэффициент для Цен") + ": ", 12, 6) Тогда
					Состояние(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Пересчет цен для таблицы товаров по коэффициенту..") + Коэффициент);
					ОбщийМодульКлиент.ДобавитьСобытиеЖурнала(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Пересчитал Цены товаров по коэффициенту") + Коэффициент, 2, ПараметрКоманды);
					ОбщийМодульКлиент.ПересчитатьТоВары(ПараметрКоманды, Коэффициент);		
				КонецЕсли;
				
			Иначе
				Сообщить(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("У Вас нет права менять цены!"), СтатусСообщения.Внимание);
			КонецЕсли;
			
		Иначе
			Сообщить(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Документ уже проведен. Изменения не произведены."), СтатусСообщения.Информация);
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры
