//sza140420-1355  
//sza140404-0037 : 
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("000200", , , );
	
	Если НЕ Отказ Тогда	
		Если НЕ ОбщийМодульСервер.ПроверитьДокументПроведен(ПараметрКоманды) Тогда
			Если ОбщийМодульСервер.ПроверитьПользовательИмеетПравоМенятьЦены() Тогда
				
				Коэффициент = 0;
				Если ВвестиЧисло(Коэффициент, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Число знаков после запятой") + ": ", 1, 0) Тогда
					
					ОкруглятьВверх = Вопрос(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Следует ли округлять исключительно в большую сторону?"), РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да;
					
					Состояние(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Округление цен для таблицы товаров") + " " + Коэффициент);
					ОбщийМодульКлиент.ДобавитьСобытиеЖурнала(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Округлил Цены товаров") + " " + Коэффициент, 2, ПараметрКоманды);
					ОбщийМодульКлиент.ОкруглитьТоВары(ПараметрКоманды, Коэффициент, ОкруглятьВверх);		
				КонецЕсли;
				
			Иначе
				Сообщить(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("У Вас нет права менять цены!"), СтатусСообщения.Внимание);
			КонецЕсли;
			
		Иначе
			Сообщить(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Документ уже проведен. Изменения не произведены."), СтатусСообщения.Информация);
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры



