// sza150503-0132
// sza140305-0303

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура НаПечать(ДокументДляПечати, Ссылка) Экспорт

	ДокументДляПечати.ИмяПараметровПечати  = "ОбъектКиентов" + СокрЛП(ИмяКомпьютера());
	ДокументДляПечати.КлючПараметровПечати = ДокументДляПечати.ИмяПараметровПечати;
	ДокументДляПечати.Очистить();

	СсылкаНаОбъектПечати = Ссылка[0];
	РазрядМетаданных = ""; ИмяМетаданных = "";
	ПроизвольнаяПечатнаяФорма = ОбщийМодульТекстСервер.ОпределитьПроизвольнуюПечатнуюФорму(, , СсылкаНаОбъектПечати, РазрядМетаданных, ИмяМетаданных);
	Если ЗначениеЗаполнено(ПроизвольнаяПечатнаяФорма) Тогда
		ДокументДляПечати = ОбщийМодульТекстСервер.СформироватьДокументПоПроизвольнойФорме(ПроизвольнаяПечатнаяФорма, , ДокументДляПечати, СсылкаНаОбъектПечати, РазрядМетаданных, ИмяМетаданных);
	Иначе
		Макет = Справочники.ОбъектыКлиентов.ПолучитьМакет("НаПечать");
		Макет.КодЯзыкаМакета = ОбщийМодульПовтор.ПолучитьТекущийЯзыкДокументов(Ссылка[0].СвязанныйКлиент);

		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ОбъектыКлиентов.ДатаРедакции,
		|	ОбъектыКлиентов.ДатаСоздания,
		|	ОбъектыКлиентов.КатегорияОбъекта,
		|	ОбъектыКлиентов.Код,
		|	ВЫРАЗИТЬ(ОбъектыКлиентов.Комментарий КАК СТРОКА(1000)) КАК Комментарий,
		|	ОбъектыКлиентов.Наименование,
		|	ОбъектыКлиентов.НоменклатурнаяГруппа,
		|	ОбъектыКлиентов.Ответственный,
		|	ОбъектыКлиентов.Регион,
		|	ОбъектыКлиентов.СвязаннаяНоменклатура,
		|	ОбъектыКлиентов.СвязанныйКлиент,
		|	ОбъектыКлиентов.Стоимость,
		|	ОбъектыКлиентов.СвязанныеКлиенты.(
		|		НомерСтроки,
		|		Клиент,
		|		РольКлиента,
		|		ОСтроке ),
		|	ОбъектыКлиентов.ЗакрепленныеСотрудники.(
		|		НомерСтроки,
		|		Сотрудник,
		|		РольСотрудника,
		|		ОСтроке )
		|ИЗ Справочник.ОбъектыКлиентов КАК ОбъектыКлиентов
		|ГДЕ ОбъектыКлиентов.Ссылка В (&Ссылка)";
		Запрос.Параметры.Вставить("Ссылка", Ссылка);

		Выборка = Запрос.Выполнить().Выбрать();
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		Шапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьСвязанныеКлиентыШапка 	= Макет.ПолучитьОбласть("СвязанныеКлиентыШапка");
		ОбластьСвязанныеКлиенты 		= Макет.ПолучитьОбласть("СвязанныеКлиенты");
		ОбластьЗакрепленныеСотрудникиШапка = Макет.ПолучитьОбласть("ЗакрепленныеСотрудникиШапка");
		ОбластьЗакрепленныеСотрудники 		= Макет.ПолучитьОбласть("ЗакрепленныеСотрудники");
		Подвал = Макет.ПолучитьОбласть("Подвал");
		ВставлятьРазделительСтраниц = ЛОЖЬ;

		Пока Выборка.Следующий() Цикл
			Если ВставлятьРазделительСтраниц Тогда
				ДокументДляПечати.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;

			ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьЗаголовок);
			ДокументДляПечати.Вывести(ОбластьЗаголовок);
			Шапка.Параметры.Заполнить(Выборка);
			ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(Шапка);
			ДокументДляПечати.Вывести(Шапка, Выборка.Уровень());
			ВыборкаСвязанныеКлиенты = Выборка.СвязанныеКлиенты.Выбрать();

			Если НЕ ВыборкаСвязанныеКлиенты.Количество() = 0 Тогда
				ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьСвязанныеКлиентыШапка);
				ДокументДляПечати.Вывести(ОбластьСвязанныеКлиентыШапка);
				Пока ВыборкаСвязанныеКлиенты.Следующий() Цикл
					ОбластьСвязанныеКлиенты.Параметры.Заполнить(ВыборкаСвязанныеКлиенты);
					ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьСвязанныеКлиенты);
					ДокументДляПечати.Вывести(ОбластьСвязанныеКлиенты, ВыборкаСвязанныеКлиенты.Уровень());

				КонецЦикла;
			КонецЕсли;

			ВыборкаЗакрепленныеСотрудники = Выборка.ЗакрепленныеСотрудники.Выбрать();

			Если НЕ ВыборкаЗакрепленныеСотрудники.Количество() = 0 Тогда
				ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьЗакрепленныеСотрудникиШапка);
				ДокументДляПечати.Вывести(ОбластьЗакрепленныеСотрудникиШапка);
				Пока ВыборкаЗакрепленныеСотрудники.Следующий() Цикл
					ОбластьЗакрепленныеСотрудники.Параметры.Заполнить(ВыборкаЗакрепленныеСотрудники);
					ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьЗакрепленныеСотрудники);
					ДокументДляПечати.Вывести(ОбластьЗакрепленныеСотрудники, ВыборкаЗакрепленныеСотрудники.Уровень());

				КонецЦикла;
			КонецЕсли;

			Подвал.Параметры.Заполнить(Выборка);
			ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(Подвал);
			ДокументДляПечати.Вывести(Подвал);
			ВставлятьРазделительСтраниц = ИСТИНА;

		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

#КонецЕсли
