//sza140305-0303 SZA: 

Процедура НаПечать(ТабДок, Ссылка) Экспорт
	
	Макет = Справочники.ОбъектыКлиентов.ПолучитьМакет("НаПечать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОбъектыКлиентов.ДатаРедакции,
	|	ОбъектыКлиентов.ДатаСоздания,
	|	ОбъектыКлиентов.Категория,
	|	ОбъектыКлиентов.Код,
	|	ОбъектыКлиентов.Комментарий,
	|	ОбъектыКлиентов.Наименование,
	|	ОбъектыКлиентов.НоменклатурнаяГруппа,
	|	ОбъектыКлиентов.Ответственный,
	|	ОбъектыКлиентов.Регион,
	|	ОбъектыКлиентов.СвязаннаяНоменклатура,
	|	ОбъектыКлиентов.СвязанныйКлиент,
	|	ОбъектыКлиентов.Стоимость,
	|	ОбъектыКлиентов.СвязанныеКлиенты.(
	|		НомерСтроки,
	|		Клиент,
	|		РольКлиента,
	|		ОСтроке
	|	),
	|	ОбъектыКлиентов.СвязанныеСотрудники.(
	|		НомерСтроки,
	|		Сотрудник,
	|		РольСотрудника,
	|		ОСтроке
	|	)
	|ИЗ
	|	Справочник.ОбъектыКлиентов КАК ОбъектыКлиентов
	|ГДЕ
	|	ОбъектыКлиентов.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСвязанныеКлиентыШапка = Макет.ПолучитьОбласть("СвязанныеКлиентыШапка");
	ОбластьСвязанныеКлиенты = Макет.ПолучитьОбласть("СвязанныеКлиенты");
	ОбластьСвязанныеСотрудникиШапка = Макет.ПолучитьОбласть("СвязанныеСотрудникиШапка");
	ОбластьСвязанныеСотрудники = Макет.ПолучитьОбласть("СвязанныеСотрудники");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьСвязанныеКлиентыШапка);
		ВыборкаСвязанныеКлиенты = Выборка.СвязанныеКлиенты.Выбрать();
		Пока ВыборкаСвязанныеКлиенты.Следующий() Цикл
			ОбластьСвязанныеКлиенты.Параметры.Заполнить(ВыборкаСвязанныеКлиенты);
			ТабДок.Вывести(ОбластьСвязанныеКлиенты, ВыборкаСвязанныеКлиенты.Уровень());
		КонецЦикла;

		ТабДок.Вывести(ОбластьСвязанныеСотрудникиШапка);
		ВыборкаСвязанныеСотрудники = Выборка.СвязанныеСотрудники.Выбрать();
		Пока ВыборкаСвязанныеСотрудники.Следующий() Цикл
			ОбластьСвязанныеСотрудники.Параметры.Заполнить(ВыборкаСвязанныеСотрудники);
			ТабДок.Вывести(ОбластьСвязанныеСотрудники, ВыборкаСвязанныеСотрудники.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	
КонецПроцедуры
