//sza140104-0216 : 
//sza131129-2141 SZA: 

Процедура Печать(ТабДок, Ссылка) Экспорт
	
	Макет = Справочники.ХранилищаДенег.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ХранилищаДенег.Комментарий,
	|	ХранилищаДенег.МФО,
	|	ХранилищаДенег.Наименование,
	|	ХранилищаДенег.НаименованиеБанка,
	|	ХранилищаДенег.НомерСчета,
	|	ХранилищаДенег.Организация,
	|	ХранилищаДенег.ОтветственныйСотрудник,
	|	ХранилищаДенег.ФормаОплаты,
	|	ХранилищаДенег.ХранилищеПополнения
	|ИЗ
	|	Справочник.ХранилищаДенег КАК ХранилищаДенег
	|ГДЕ
	|	ХранилищаДенег.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если НЕ ОбщийМодульПовтор.ТекущийЯзыкРусский()
		и ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ПоддерживатьНаименованияНаДругихЯзыкахКромеРусского", Истина) Тогда
		
		ВозможноеПредставление = ОбщийМодульПовтор.получитьПредставлениеНаЯзыке(Данные.ссылка, , Истина);
		Если НЕ ВозможноеПредставление = Неопределено Тогда
			Представление = ВозможноеПредставление;
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
