// sza151210-2241 про
// sza140411-1657 : 
// sza131203-0157  
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Организации") Тогда
		Комментарий = ДанныеЗаполнения.Комментарий;
		МФО = ДанныеЗаполнения.МФО;
		НаименованиеБанка = ДанныеЗаполнения.НаименованиеБанка;
		НомерСчета = ДанныеЗаполнения.НомерСчета;
		ОтветственныйСотрудник = ДанныеЗаполнения.Сотрудник;
		Организация = ДанныеЗаполнения.Ссылка;
		ФормаОплаты = Перечисления.ФормыОплаты.Безналичные;
		Валюта = справочники.Валюты.ОсновнаяВалюта;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Сотрудники") Тогда
		Комментарий = ДанныеЗаполнения.Комментарий;
		Наименование = ДанныеЗаполнения.Наименование;
		ОтветственныйСотрудник = ДанныеЗаполнения.Ссылка;
		ФормаОплаты = Перечисления.ФормыОплаты.Наличные;
		Валюта = справочники.Валюты.ОсновнаяВалюта;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Склады") Тогда
		Комментарий = ДанныеЗаполнения.Комментарий;
		Наименование = ДанныеЗаполнения.Наименование;
		ОтветственныйСотрудник = ДанныеЗаполнения.ОтветственныйСотрудник;
		ФормаОплаты = Перечисления.ФормыОплаты.Наличные;
		Валюта = справочники.Валюты.ОсновнаяВалюта;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если НЕ Отказ 
		И НЕ ПометкаУдаления Тогда
		
		Отказ = ОбщийМодульСервер.ПроверитьУникальностьЗначенияРеквизита(Отказ, "ХранилищаДенег", Наименование, Ссылка);
		ОбщийМодульСервер.ПроверитьСменуНаименованияНаТекущемЯзыке(Наименование, Ссылка, , Отказ);	
		
		Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ФормироватьОписаниеТаблицОбъектовДляИхСписков") Тогда
			ОбщийМодульСервер.ОформитьОписаниеТаблицы(ЭтотОбъект, "ЗакрепленныеСотрудники", "Сотрудник", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("закрепленных сотрудников"));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
