//sza140411-1657 : 
//sza131203-0157 SZA: 

Процедура ПередЗаписью(Отказ)
	
	Если НЕ Отказ 
		И Не ПометкаУдаления Тогда
		
		Отказ = ОбщийМодульСервер.ПроверитьУникальностьНаименование(Отказ, "ХранилищаДенег", ЭтотОбъект.Наименование, ЭтотОбъект.Ссылка);
		ОбщийМодульСервер.ПроверитьСменуНаименованияНаТекущемЯзыке(Наименование, Ссылка, , Отказ);	
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Организации") Тогда
		// Заполнение шапки
		Комментарий = ДанныеЗаполнения.Комментарий;
		МФО = ДанныеЗаполнения.МФО;
		НаименованиеБанка = ДанныеЗаполнения.НаименованиеБанка;
		НомерСчета = ДанныеЗаполнения.НомерСчета;
		ОтветственныйСотрудник = ДанныеЗаполнения.Сотрудник;
		Организация = ДанныеЗаполнения.Ссылка;
		ФормаОплаты = Перечисления.ФормыОплаты.Безналичные;
		Валюта = справочники.Валюты.ОсновнаяВалюта;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Сотрудники") Тогда
		// Заполнение шапки
		Комментарий = ДанныеЗаполнения.Комментарий;
		Наименование = ДанныеЗаполнения.Наименование;
		ОтветственныйСотрудник = ДанныеЗаполнения.Ссылка;
		ФормаОплаты = Перечисления.ФормыОплаты.Наличные;
		Валюта = справочники.Валюты.ОсновнаяВалюта;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Склады") Тогда
		// Заполнение шапки
		Комментарий = ДанныеЗаполнения.Комментарий;
		Наименование = ДанныеЗаполнения.Наименование;
		ОтветственныйСотрудник = ДанныеЗаполнения.ОтветственныйСотрудник;
		ФормаОплаты = Перечисления.ФормыОплаты.Наличные;
		Валюта = справочники.Валюты.ОсновнаяВалюта;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
