//sza131120-1135  
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	КодБлокирования = "";
	
	Если ВвестиСтроку(КодБлокирования, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Введите Код Блокирования") + ": ", 20, ЛОЖЬ) Тогда		
		
		ПараметрыФормы 	= Новый Структура("КодБлокирования", КодБлокирования);
		ОткрытьФормуМодально("Обработка.БлокироватьПрограмму.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность);
		
	КонецЕсли;

КонецПроцедуры



