// sza151122-0337 83
// sza131120-1135  

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	КодБлокирования = "";
	
	ПоказатьВводСтроки(Новый ОписаниеОповещения("ОбработкаКомандыЗавершение", ЭтотОбъект, Новый Структура("ПараметрыВыполненияКоманды, КодБлокирования", ПараметрыВыполненияКоманды, КодБлокирования)), КодБлокирования, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Введите Код Блокирования") + ": ", 20, ЛОЖЬ);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКомандыЗавершение(Строка, ДополнительныеПараметры) Экспорт
	
	ПараметрыВыполненияКоманды = ДополнительныеПараметры.ПараметрыВыполненияКоманды;
	КодБлокирования = ?(Строка = Неопределено, ДополнительныеПараметры.КодБлокирования, Строка);	
	
	Если (Строка <> Неопределено) Тогда		
		
		ПараметрыФормы 	= Новый Структура("КодБлокирования", КодБлокирования);
		ОткрытьФорму("Обработка.БлокироватьПрограмму.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник,,,, Неопределено, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	КонецЕсли;
	
КонецПроцедуры
