//sza131120-1135 SZA: 

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	КодБлокирования = "";
	
	Если ВвестиСтроку(КодБлокирования, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Введите Код Блокирования: "), 20, Ложь) Тогда		
		
		ПараметрыФормы 	= Новый Структура("КодБлокирования", КодБлокирования);
		ОткрытьФормуМодально("Обработка.БлокироватьПрограмму.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность);
		
	КонецЕсли;

КонецПроцедуры
