// sza131213-2141 :

&НаКлиенте
Процедура ВыбратьПоле(Команда)
	
	Если Поле = Наименование Тогда
		ТекущееПоле = СписокПолей[0];
	ИначеЕсли Поле = НаименованиеДляПечати Тогда
		ТекущееПоле = СписокПолей[1];
	КонецЕсли;
	
	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ВыбратьПолеЗавершение", ЭтаФорма), СписокПолей, Элементы.Поле, ТекущееПоле);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПолеЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Поле = ВыбранныйЭлемент;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
		Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьСобственныйПереводЭлементовИнтерфейса") Тогда
			ОбщийМодульСервер.ПеревестиРеквизитыФормы(ЭтаФорма);	
		КонецЕсли;
		
	Наименование = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Наименование");
	НаименованиеДляПечати = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("НаименованиеДляПечати");
	Поле = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке(Запись.Поле);
	
	СписокПолей.Добавить(Наименование, Наименование);
	СписокПолей.Добавить(НаименованиеДляПечати, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Наименование для печати"));
	
КонецПроцедуры
