//sza140206-2322 

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = новый Структура;
	ПараметрыФормы.Вставить("ОбъектПечати", ПараметрКоманды[0]);
	ПараметрыФормы.Вставить("Документ", ПараметрКоманды[0]);
	ФормаПечати = получитьформу("ОбщаяФорма.ФормаПечати", ПараметрыФормы);
	
	Печать(ФормаПечати.Результат, ПараметрКоманды);

	ФормаПечати.Результат.ОтображатьСетку 	= Ложь;
	ФормаПечати.Результат.Защита 			= Истина;
	ФормаПечати.Результат.ТолькоПросмотр 	= Истина;
	ФормаПечати.Результат.ОтображатьЗаголовки = Ложь;
	ФормаПечати.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("печать: Выполнения работ");
	ФормаПечати.открыть();	
	
КонецПроцедуры

&НаСервере
Процедура Печать(ТабДок, Знач ПараметрКоманды)
	
	ОбщийМодульСервер.ДобавитьСобытиеЖурналаНаСервере(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Напечатал Выполнение работ "), 2);
	Документы.ВыполненияРабот.Печать(ТабДок, ПараметрКоманды);
	
КонецПроцедуры
