//sza140521-0019 SZA: 
//sza131023-0021 : 

&НаКлиенте
Процедура ПриЗакрытии()                                              // ПРИ ЗАКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)                                         // ПРИ ОТКРЫТИИ
	
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
	ПроверитьНеобходимостьДобавитьДату();
	
	Если параметры.СразуНаПечать
		или ОбщийМодульКлиент.получитьЗначениеНастройкиИлиКонстанты("ОтправлятьПечатьДокументовИСправочниковСразуНаПринтер") Тогда
		
		результат.Напечатать(РежимИспользованияДиалогаПечати.НеИспользовать);
	КонецЕсли;
	
	Если ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ЛистА5Повернутый") Тогда
		Результат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		Результат.РазмерСтраницы = "A5";
	КонецЕсли;
	
	Если параметры.СразуЗакрыть Тогда
		отказ = истина;
	КонецЕсли;
	
	Если ОбщийМодульПовтор.ПолучитьТекущуюСредуВыполнения() = 5 Тогда
		Элементы.ФормаГруппаНеДляВебКлиента.Видимость = Ложь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОбъектПечати) Тогда
		ДобавитьДополнительныеДанныеПечатиОбъекта();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
процедура ПроверитьНеобходимостьДобавитьДату()
	
	Если не НеПечататьНичегоДополнительно
		И ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ДобавлятьТекущуюДатуИВремяВоВсеПечатныеФормы") Тогда
		
		МакетДатыВремени = ПолучитьОбщийМакет("МакетДатыВремени");
		ТаблицаТекущейДатыВремени = МакетДатыВремени.ПолучитьОбласть("Ш");
		ТаблицаТекущейДатыВремени.Параметры.ТекущаяДатаИВремя = ТекущаяДата();
		результат.Вывести(ТаблицаТекущейДатыВремени);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("002100", ЭтаФорма, Отказ, );
	
	Если НЕ Отказ Тогда	
		Элементы.ФормаОправитьПоEMAILКонтрагенту.Видимость 	 = Ложь;
		Элементы.ФормаОтправитьПоEMAILРуководителю.Видимость = Ложь;
		НеПечататьНичегоДополнительно = параметры.НеПечататьНичегоДополнительно;
		ОбъектПечати = Параметры.ОбъектПечати;
		
		ТабДок = параметры.ТабДок;
		Если не ТабДок = Неопределено Тогда
			Результат.Вывести(ТабДок);
		КонецЕсли;
		
		Контрагент 	= Неопределено;
		Документ 	= параметры.Документ;
		
		Если ЗначениеЗаполнено(Документ) Тогда
			попытка
				Контрагент = Документ.КлиентПоставщик;		
			исключение
				Попытка 
					Контрагент = Документ.Клиент;
				Исключение 	
				КонецПопытки;
			конецпопытки;
			
		Иначе
			Контрагент = Параметры.Контрагент;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Контрагент)
			и ЗначениеЗаполнено(Контрагент.ЭлектроннаяПочта)
			и не ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ЭлектроннаяПочтаОтправитель") = "" Тогда
			
			Элементы.ФормаОправитьПоEMAILКонтрагенту.Видимость 	 = истина;
			Элементы.ФормаОтправитьПоEMAILРуководителю.Видимость = истина; 			
		КонецЕсли;
		
		НаименованиеДокумента = параметры.НаименованиеДокумента;	
		Элементы.ГруппаСуммВыделеныхЯчеек.Видимость = Ложь;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОправитьПоEMAILКонтрагенту(Команда)
	
	Если Вопрос(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Вы уверены, что следует отправить Контрагенту:") + " " + Контрагент + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке(" этот документ?"), РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		
		ТекстСопровождения = "";
		ВвестиСтроку(ТекстСопровождения, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Введите текст сопровождающий сообщение:"), 1020, Истина);
		
		ОправитьПоEMAILКонтрагентуНаСервере(ТекстСопровождения);	  	
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОправитьПоEMAILКонтрагентуНаСервере(Знач ТекстСопровождения)
	
	ОбщийМодульСервисСервер.ПисьмоКонтрагенту(Контрагент, Результат, ТекстСопровождения, НаименованиеДокумента);
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатПриАктивизацииОбласти(Элемент)
	
	РасчетСуммыПоЯчейкам(Результат);
	Элементы.ГруппаСуммВыделеныхЯчеек.Видимость = не КоличествоЧисел = 0;
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетСуммыПоЯчейкам(ТабДок)
	
	СуммаЯчеек 		= 0;
	ВыделеноЯчеек 	= 0;
	КоличествоЧисел = 0;              
	
	СоответствиеЯчеек = Новый Соответствие;
	ОписаниеТипов = Новый ОписаниеТипов("Число");
	
	Для Каждого ВыделеннаяОбласть Из ТабДок.ВыделенныеОбласти Цикл 
		Для Индекс1 = ВыделеннаяОбласть.Лево По ВыделеннаяОбласть.Право Цикл 
			Для Индекс2 = ВыделеннаяОбласть.Верх По ВыделеннаяОбласть.Низ Цикл 
				
				Область = Результат.Область(Индекс2, Индекс1, Индекс2, Индекс1); 
				Значение = ОписаниеТипов.ПривестиЗначение(Область.Текст); 
				СоответствиеЯчеек.Вставить(Область.Имя, Значение); 
				ВыделеноЯчеек = ВыделеноЯчеек + 1;
				
			КонецЦикла; 
		КонецЦикла; 
	КонецЦикла;
	
	Для каждого Ячейка Из СоответствиеЯчеек Цикл 
		Значение = Ячейка.Значение; 
		Если Значение <> 0 Тогда 
			СуммаЯчеек = СуммаЯчеек + Значение; 
			КоличествоЧисел = КоличествоЧисел + 1; 
		КонецЕсли; 
	КонецЦикла;
	
	Если КоличествоЧисел > 1 Тогда
		СреднееЗначение = СуммаЯчеек / КоличествоЧисел;
	Иначе
		СреднееЗначение = 0;
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ОтправитьПоEMAILРуководителю(Команда)
	
	Если Вопрос(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Вы уверены, что следует отправить Руководителю?"), РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		
		ТекстСопровождения = "";
		ВвестиСтроку(ТекстСопровождения, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Введите текст сопровождающий сообщение:"), 1020, Истина);
		
		ОтправитьПоEMAILРуководителюНаСервере(ТекстСопровождения);	  	
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьПоEMAILРуководителюНаСервере(Знач ТекстСопровождения)	
	ОбщийМодульСервисСервер.ПисьмоКонтрагенту(Неопределено, Результат, ТекстСопровождения, НаименованиеДокумента);	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВФайлФорматаExcel(Команда)
	
	АдресФайла = ПолучитьОтносительныйАдресНаСервере();
	
	ДиалогФильтр	 = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Файл Excel") + " (*.xls)|*.xls";
	ДиалогРасширение = "xls";
	ДиалогВыбФайла 	 = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогВыбФайла.Заголовок				=	ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите имя файла Excel");
	ДиалогВыбФайла.ПолноеИмяФайла			=	АдресФайла;
	ДиалогВыбФайла.Фильтр					=	ДиалогФильтр;
	ДиалогВыбФайла.Расширение				=	ДиалогРасширение;
	ДиалогВыбФайла.МножественныйВыбор		=	Ложь;
	ДиалогВыбФайла.ПредварительныйПросмотр	=	Ложь;
	ДиалогВыбФайла.ИндексФильтра			=	0;
	
	Если ДиалогВыбФайла.Выбрать() Тогда
		АдресФайла = ДиалогВыбФайла.ПолноеИмяФайла;
		Состояние(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Идет Выгрузка данных.. ..Ждите!"));
		
		ВыгрузитьНаСервере(АдресФайла);
		
		ОбщийМодульСервер.ДобавитьСобытиеЖурналаНаСервере(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Выгрузил данные в файл:") + " " + АдресФайла, 2);
	КонецЕсли; 
	
КонецПроцедуры

&насервереБезКонтекста
функция   ПолучитьОтносительныйАдресНаСервере();	
	Возврат ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ПодсистемаИЭИмпортЭкспортОтносительныйАдресФайлов");	
КонецФункции

&НаСервере
процедура ВыгрузитьНаСервере(Знач АдресФайла)		
	Результат.Записать(АдресФайла, ТипФайлаТабличногоДокумента.XLS97);	
КонецПроцедуры

&НаСервере
процедура ДобавитьДополнительныеДанныеПечатиОбъекта()
	
	Если ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ИспользоватьДополнительнуюИнформациюДляОбъектовБазыДанных", Истина) Тогда
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ЗначенияДополнительныхРеквизитовСрезПоследних.ДополнительныйРеквизит КАК ВидИнформации,
		|	ЗначенияДополнительныхРеквизитовСрезПоследних.ЗначениеРеквизита КАК Информация
		|ИЗ РегистрСведений.ЗначенияДополнительныхРеквизитов.СрезПоследних(, ОбъектВладелец = &ОбъектВладелец) КАК ЗначенияДополнительныхРеквизитовСрезПоследних";
	
	Запрос.УстановитьПараметр("ОбъектВладелец", ОбъектПечати);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() ТОгда
			
			МакетДляПечати 			= ПолучитьОбщийМакет("ПрочиеОбластиПечати");
			ОбластьДопИнформации 	= МакетДляПечати.ПолучитьОбласть("СтрокаДопИнформации");
			ВыборкаДетальныеЗаписи 	= РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ОбластьДопИнформации.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
				Результат.Вывести(ОбластьДопИнформации);
			КонецЦикла;                                             	
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
