// sza150602-1744 
// sza150525-1632 
&НаКлиенте
Процедура ОприходоватьВаучеры(Команда)
	
	ПараметрыФормыОбработкиВаучеров = Новый Структура("ОперацияСВаучерами", 1);
	ОткрытьФорму("Обработка.ОперацииСВаучерами.Форма.ФормаТаблицыВаучеров", ПараметрыФормыОбработкиВаучеров);
	
КонецПроцедуры

Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("000610", ЭтаФорма, Отказ, Объект);
	
	Если НЕ Отказ Тогда
		Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьСобственныйПереводЭлементовИнтерфейса") Тогда
			ОбщийМодульСервер.ПеревестиРеквизитыФормы(ЭтаФорма);	
		КонецЕсли;
		
		НеОтслеживатьВаучерыВКачествеНоменклатуры = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("НеОтслеживатьВаучерыВКачествеНоменклатуры");	
		
		Элементы.ФормаСписатьВаучеры.Видимость 	   = НЕ НеОтслеживатьВаучерыВКачествеНоменклатуры;
		Элементы.ФормаПереместитьВаучеры.Видимость = НЕ НеОтслеживатьВаучерыВКачествеНоменклатуры;
		Объект.ДатаОперации = ОбщийМодульСервисСервер.ПользователяТекущаяДата();	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
	ПодключитьОбработчикОжидания("ПослеИзображенияОкнаФормы", 0.3, ИСТИНА);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеИзображенияОкнаФормы() // Когда окно уже нарисовано пользователю
	ЭтаФорма.Элементы.ФормаЗакрыть.Видимость = НЕ ЭтаФорма.Окно = Неопределено;	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеВФорме(Команда)
	ОбновитьОтображениеДанных();
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВаучеры(Команда)
	
	ПараметрыФормыОбработкиВаучеров = Новый Структура("ОперацияСВаучерами", ИСТИНА);
	ОткрытьФорму("Документ.ПеремещенияТовара.ФормаОбъекта", ПараметрыФормыОбработкиВаучеров);
	
КонецПроцедуры

&НаКлиенте
Процедура СписатьВаучеры(Команда)
	ОткрытьФорму("Обработка.ОперацииСВаучерами.Форма.ФормаСписанияВаучеров");
КонецПроцедуры

&НаКлиенте
Процедура ПродатьКартуКлиенту(Команда)
	
	ПараметрыФормыВаучера = Новый Структура("Реализация", ИСТИНА);
	ОткрытьФорму("Обработка.ОперацииСВаучерами.Форма.ФормаДляВаучера", ПараметрыФормыВаучера);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыдатьКартуКлиенту(Команда)
	
	ПараметрыФормыВаучера = Новый Структура;
	ОткрытьФорму("Обработка.ОперацииСВаучерами.Форма.ФормаДляВаучера", ПараметрыФормыВаучера);
	
КонецПроцедуры

&НаКлиенте
Процедура ПринятьКартуОтКлиента(Команда)
	
	ПараметрыФормыВаучера = Новый Структура("ВозвратВаучера", ИСТИНА);
	ОткрытьФорму("Обработка.ОперацииСВаучерами.Форма.ФормаДляВаучера", ПараметрыФормыВаучера);
	
КонецПроцедуры
