#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// sza151014-0032
Процедура Печать(ДокументДляПечати, Ссылка) Экспорт

	Макет = Справочники.ПодпискиНаСобытия.ПолучитьМакет("Печать");

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПодпискиНаСобытия.ДатаНачала,
	|	ПодпискиНаСобытия.ДатаОкончания,
	|	ПодпискиНаСобытия.ДатаРедакции,
	|	ПодпискиНаСобытия.ДатаСоздания,
	|	ВЫРАЗИТЬ(ПодпискиНаСобытия.Комментарий КАК СТРОКА(1000)) КАК Комментарий,
	|	ПодпискиНаСобытия.Наименование,
	|	ПодпискиНаСобытия.Ответственный,
	|	ПодпискиНаСобытия.УсловияСобытия.(
	|		НомерСтроки,
	|		ОбъектСобытия,
	|		НаименованиеОбъектаСобытия,
	|		ВидСобытия,
	|		ДатаНачала,
	|		ДатаОкончания,
	|		УсловиеПрограмма,
	|		ОСтроке
	|	),
	|	ПодпискиНаСобытия.ОбъектыСобытия.(
	|		НомерСтроки,
	|		ОбъектСобытия,
	|		ОСтроке
	|	),
	|	ПодпискиНаСобытия.РеакцииНаСобытие.(
	|		НомерСтроки,
	|		СпособРеакции,
	|		АдресРеакции,
	|		ДополнительноеСообщение,
	|		РеакцияПрограмма,
	|		ОСтроке,
	|		РеакцияПрограммаИзСправочника
	|	),
	|	ПодпискиНаСобытия.ПолучателиСообщения.(
	|		НомерСтроки,
	|		Получатель,
	|		ДополнительноеСообщение,
	|		ОСтроке
	|	)
	|ИЗ Справочник.ПодпискиНаСобытия КАК ПодпискиНаСобытия
	|ГДЕ ПодпискиНаСобытия.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);

	Выборка = Запрос.Выполнить().Выбрать();
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьУсловияСобытияШапка = Макет.ПолучитьОбласть("УсловияСобытияШапка");
	ОбластьУсловияСобытия = Макет.ПолучитьОбласть("УсловияСобытия");
	ОбластьОбъектыСобытияШапка = Макет.ПолучитьОбласть("ОбъектыСобытияШапка");
	ОбластьОбъектыСобытия = Макет.ПолучитьОбласть("ОбъектыСобытия");
	ОбластьРеакцииНаСобытиеШапка = Макет.ПолучитьОбласть("РеакцииНаСобытиеШапка");
	ОбластьРеакцииНаСобытие = Макет.ПолучитьОбласть("РеакцииНаСобытие");
	ОбластьПолучателиСообщенияШапка = Макет.ПолучитьОбласть("ПолучателиСообщенияШапка");
	ОбластьПолучателиСообщения = Макет.ПолучитьОбласть("ПолучателиСообщения");
	Подвал = Макет.ПолучитьОбласть("Подвал");
	ДокументДляПечати.ИмяПараметровПечати  = "ПодпискаНаСобытие" + СокрЛП(ИмяКомпьютера());
	ДокументДляПечати.КлючПараметровПечати = ДокументДляПечати.ИмяПараметровПечати;
	ДокументДляПечати.Очистить();
	ВставлятьРазделительСтраниц = Ложь;

	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ДокументДляПечати.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьЗаголовок);
		ДокументДляПечати.Вывести(ОбластьЗаголовок);
		Шапка.Параметры.Заполнить(Выборка);
		ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(Шапка);
		ДокументДляПечати.Вывести(Шапка, Выборка.Уровень());
		ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьУсловияСобытияШапка);
		ДокументДляПечати.Вывести(ОбластьУсловияСобытияШапка);
		ВыборкаУсловияСобытия = Выборка.УсловияСобытия.Выбрать();

		Пока ВыборкаУсловияСобытия.Следующий() Цикл
			ОбластьУсловияСобытия.Параметры.Заполнить(ВыборкаУсловияСобытия);
			ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьУсловияСобытия);
			ДокументДляПечати.Вывести(ОбластьУсловияСобытия, ВыборкаУсловияСобытия.Уровень());

		КонецЦикла;

		ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьОбъектыСобытияШапка);
		ДокументДляПечати.Вывести(ОбластьОбъектыСобытияШапка);
		ВыборкаОбъектыСобытия = Выборка.ОбъектыСобытия.Выбрать();
		Пока ВыборкаОбъектыСобытия.Следующий() Цикл
			ОбластьОбъектыСобытия.Параметры.Заполнить(ВыборкаОбъектыСобытия);
			ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьОбъектыСобытия);
			ДокументДляПечати.Вывести(ОбластьОбъектыСобытия, ВыборкаОбъектыСобытия.Уровень());

		КонецЦикла;

		ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьРеакцииНаСобытиеШапка);
		ДокументДляПечати.Вывести(ОбластьРеакцииНаСобытиеШапка);
		ВыборкаРеакцииНаСобытие = Выборка.РеакцииНаСобытие.Выбрать();
		Пока ВыборкаРеакцииНаСобытие.Следующий() Цикл
			ОбластьРеакцииНаСобытие.Параметры.Заполнить(ВыборкаРеакцииНаСобытие);
			ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьРеакцииНаСобытие);
			ДокументДляПечати.Вывести(ОбластьРеакцииНаСобытие, ВыборкаРеакцииНаСобытие.Уровень());

		КонецЦикла;

		ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьПолучателиСообщенияШапка);
		ДокументДляПечати.Вывести(ОбластьПолучателиСообщенияШапка);
		ВыборкаПолучателиСообщения = Выборка.ПолучателиСообщения.Выбрать();
		Пока ВыборкаПолучателиСообщения.Следующий() Цикл
			ОбластьПолучателиСообщения.Параметры.Заполнить(ВыборкаПолучателиСообщения);
			ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьПолучателиСообщения);
			ДокументДляПечати.Вывести(ОбластьПолучателиСообщения, ВыборкаПолучателиСообщения.Уровень());

		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(Подвал);
		ДокументДляПечати.Вывести(Подвал);
		ВставлятьРазделительСтраниц = ИСТИНА;

	КонецЦикла;

КонецПроцедуры

#КонецЕсли
