#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// sza150626-0258
// sza150403-0321
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если НЕ ДанныеЗаполнения = Неопределено Тогда
		Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ЗаметкиИНапоминания") Тогда
			Комментарий = ДанныеЗаполнения.Комментарий;
			Наименование = ДанныеЗаполнения.Наименование;
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Клиенты") Тогда
			Комментарий = ДанныеЗаполнения.Комментарий;
			Наименование = ДанныеЗаполнения.Наименование;
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Номенклатура") Тогда
			Комментарий = ДанныеЗаполнения.Комментарий;
			Наименование = ДанныеЗаполнения.Наименование;
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ОбъектыКлиентов") Тогда
			Комментарий = ДанныеЗаполнения.Комментарий;
			Наименование = ДанныеЗаполнения.Наименование;
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Поставщики") Тогда
			Комментарий = ДанныеЗаполнения.Комментарий;
			Наименование = ДанныеЗаполнения.Наименование;
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Склады") Тогда
			Комментарий = ДанныеЗаполнения.Комментарий;
			Наименование = ДанныеЗаполнения.Наименование;
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.АссортиментДляРабочегоМестаКассира") Тогда
			Комментарий = ДанныеЗаполнения.Комментарий;
			Наименование = ДанныеЗаполнения.Наименование;
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Ваучеры") Тогда
			ДатаНачала = ДанныеЗаполнения.ДатаНачала;
			ДатаОкончания = ДанныеЗаполнения.ДатаОкончания;
			Комментарий = ДанныеЗаполнения.Комментарий;
			Наименование = ДанныеЗаполнения.Наименование;
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Договора") Тогда
			ДатаНачала = ДанныеЗаполнения.ДатаНачала;
			ДатаОкончания = ДанныеЗаполнения.ДатаОкончания;
			Комментарий = ДанныеЗаполнения.Комментарий;
			Наименование = ДанныеЗаполнения.Наименование;
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Изображения") Тогда
			Комментарий = ДанныеЗаполнения.Комментарий;
			Наименование = ДанныеЗаполнения.Наименование;
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Организации") Тогда
			Комментарий = ДанныеЗаполнения.Комментарий;
			Наименование = ДанныеЗаполнения.Наименование;
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ПартииПриобретения") Тогда
			Комментарий = ДанныеЗаполнения.Комментарий;
			Наименование = ДанныеЗаполнения.Наименование;
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Сотрудники") Тогда
			Комментарий = ДанныеЗаполнения.Комментарий;
			Наименование = ДанныеЗаполнения.Наименование;
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Спецификации") Тогда
			Комментарий = ДанныеЗаполнения.Комментарий;
			Наименование = ДанныеЗаполнения.Наименование;
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВыполненияРабот") Тогда
			ДатаНачала = ДанныеЗаполнения.ДатаСоздания;
			Комментарий = ДанныеЗаполнения.Комментарий;
			Наименование = СокрЛП(ДанныеЗаполнения.Ссылка);
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ДвиженияДенег") Тогда
			Комментарий = ДанныеЗаполнения.Комментарий;
			Наименование = СокрЛП(ДанныеЗаполнения.Ссылка);
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОказанияУслугЗаВремя") Тогда
			Комментарий = ДанныеЗаполнения.Комментарий;
			Наименование = СокрЛП(ДанныеЗаполнения.Ссылка);
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Инвентаризации") Тогда
			Комментарий = ДанныеЗаполнения.Комментарий;
			Наименование = СокрЛП(ДанныеЗаполнения.Ссылка);
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КорректировкиИРегистрацияОстатков") Тогда
			Комментарий = ДанныеЗаполнения.Комментарий;
			Наименование = СокрЛП(ДанныеЗаполнения.Ссылка);
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПеремещенияТовара") Тогда
			Комментарий = ДанныеЗаполнения.Комментарий;
			Наименование = СокрЛП(ДанныеЗаполнения.Ссылка);
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступленияТовара") Тогда
			Комментарий = ДанныеЗаполнения.Комментарий;
			Наименование = СокрЛП(ДанныеЗаполнения.Ссылка);
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РасходыТовара") Тогда
			Комментарий = ДанныеЗаполнения.Комментарий;
			Наименование = СокрЛП(ДанныеЗаполнения.Ссылка);
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.УстановкиЦен") Тогда
			Комментарий = ДанныеЗаполнения.Комментарий;
			Наименование = СокрЛП(ДанныеЗаполнения.Ссылка);
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Комплектация") Тогда
			Комментарий = ДанныеЗаполнения.Комментарий;
			Наименование = СокрЛП(ДанныеЗаполнения.Ссылка);
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОтчетыКомиссионеров") Тогда
			Комментарий = ДанныеЗаполнения.Комментарий;
			Наименование = СокрЛП(ДанныеЗаполнения.Ссылка);
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПланыДоходовИРасходовДенег") Тогда
			Комментарий = ДанныеЗаполнения.Комментарий;
			Наименование = СокрЛП(ДанныеЗаполнения.Ссылка);
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПланыПродаж") Тогда
			ДатаНачала = ДанныеЗаполнения.ДатаНачала;
			ДатаОкончания = ДанныеЗаполнения.ДатаОкончания;
			Комментарий = ДанныеЗаполнения.Комментарий;
			Наименование = СокрЛП(ДанныеЗаполнения.Ссылка);
		КонецЕсли;

		СтрокаОбъекта = ОбъектыСобытия.Добавить();
		СтрокаОбъекта.ОбъектСобытия = ДанныеЗаполнения.Ссылка;
		СтрокаУсловия = УсловияСобытия.Добавить();
		СтрокаУсловия.ОбъектСобытия = СокрЛП(ДанныеЗаполнения.Ссылка.Метаданные().Имя);
		СтрокаУсловия.НаименованиеОбъектаСобытия = ОбщийМодульСервисСервер.ПолучитьКрасивоеНаименованиеОбъекта(ТипЗнч(ДанныеЗаполнения.Ссылка));
	КонецЕсли;

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Комментарий = "";
КонецПроцедуры

#КонецЕсли
