//sza131007-1636  

&НаКлиенте
Процедура ПриОткрытии(Отказ)                                                                    // ПРИ ОТКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()                                                  // ПРИ ЗАКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаКлиенте
Процедура СписокПослеУдаления(Элемент)
	СписокПослеУдаленияНаСервере();
КонецПроцедуры

&НаСервере
Процедура СписокПослеУдаленияНаСервере()
	ОбновитьПовторноИспользуемыеЗначения();
КонецПроцедуры
