//sza140722-0113 склад
//sza140420-1459  
//sza140226-1740  
&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	ПараметрыФормы = Новый Структура("ВидЦен", ВидЦен);
	ПараметрыФормы.Вставить("МинимальнаяСуммаОказанияУслуг", МинимальнаяСуммаОказанияУслуг);
	ПараметрыФормы.Вставить("МинимальныйОбъемОказанияУслуг", МинимальныйОбъемОказанияУслуг);
	ПараметрыФормы.Вставить("ОказываемаяУслуга", ОказываемаяУслуга);
	ПараметрыФормы.Вставить("Склад", Склад);
	ПараметрыФормы.Вставить("Организация", Организация);
	ПараметрыФормы.Вставить("ОткрыватьНовыйДокументОказанияУслугПриЗавершении", ОткрыватьНовыйДокументОказанияУслугПриЗавершении);
	ПараметрыФормы.Вставить("Сотрудник", Сотрудник);
	
	Закрыть(ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
	ПроверитьЗаполнениеПараметров();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Сотрудник 	= параметры.Сотрудник;
	ВидЦен 		= параметры.ВидЦен;
	МинимальнаяСуммаОказанияУслуг = Параметры.МинимальнаяСуммаОказанияУслуг;
	МинимальныйОбъемОказанияУслуг = Параметры.МинимальныйОбъемОказанияУслуг;
	Организация = параметры.Организация;
	ОказываемаяУслуга = Параметры.ОказываемаяУслуга;
	ОткрыватьНовыйДокументОказанияУслугПриЗавершении = параметры.ОткрыватьНовыйДокументОказанияУслугПриЗавершении;
	
	ОбщийМодульСервисСервер.ОформитьФорматКоличества(Элементы.МинимальнаяСуммаОказанияУслуг, ИСТИНА);
	
	Если ОбщийМодульПовтор.ПолучитьПараметрСеанса("НеМожетМенятьЦены") Тогда
		Элементы.ВидЦен.Доступность = ЛОЖЬ;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьЗаполнениеПараметров() 	
	
	Если НЕ ЗначениеЗаполнено(ВидЦен) Тогда
		ВидЦен = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВидЦенРасходованияПоУмолчанию");
		Если НЕ ЗначениеЗаполнено(ВидЦен) Тогда
			ВидЦен = ПредопределенноеЗначение("Справочник.ВидыЦен.ГлавныйВидЦен");
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ОказываемаяУслуга) Тогда
		ОказываемаяУслуга = ПредопределенноеЗначение("Справочник.Номенклатура.УслугиНаСумму");
		Если НЕ ЗначениеЗаполнено(ОказываемаяУслуга.ПериодОказанияУслугиЗаВремя) Тогда
			ОказываемаяУслуга = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
		КонецЕсли;
	КонецЕсли;
	
	Если МинимальнаяСуммаОказанияУслуг = 0 Тогда
		МинимальнаяСуммаОказанияУслуг = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("МинимальнаяСуммаОказанияУслуг");
	КонецЕсли;	
	
	Если МинимальныйОбъемОказанияУслуг = 0 Тогда
		МинимальныйОбъемОказанияУслуг = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("МинимальныйОбъемОказанияУслуг");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Организация = ПредопределенноеЗначение("Справочник.Организации.ОсновноеПредприятие");
	КонецЕсли;
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетПродажПоСотрудникам")
		И НЕ ЗначениеЗаполнено(Сотрудник) Тогда
		
		Сотрудник = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("СотрудникРеализацииПоУмолчанию");
	КонецЕсли;
	
КонецПроцедуры
