//sza140420-1459 SZA: 
//sza140226-1740 SZA: 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
	ПроверитьЗаполнениеПараметров();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаСервере
Процедура ПроверитьЗаполнениеПараметров() 	
	
	Если НЕ ЗначениеЗаполнено(ВидЦен) Тогда
		ВидЦен = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВидЦенРасходованияПоУмолчанию");
		Если не ЗначениеЗаполнено(ВидЦен) Тогда
			ВидЦен = ПредопределенноеЗначение("Справочник.ВидыЦен.ОсновнойВидЦен");
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ОказываемаяУслуга) Тогда
		ОказываемаяУслуга = ПредопределенноеЗначение("Справочник.Номенклатура.УслугиНаСумму");
		Если не ЗначениеЗаполнено(ОказываемаяУслуга.ПериодОказанияУслугиЗаВремя) Тогда
			ОказываемаяУслуга = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
		КонецЕсли;
	КонецЕсли;
	
	Если МинимальнаяСуммаОказанияУслуг = 0 Тогда
		МинимальнаяСуммаОказанияУслуг = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("МинимальнаяСуммаОказанияУслуг") ;
	КонецЕсли;	
	
	Если МинимальныйОбъемОказанияУслуг = 0 Тогда
		МинимальныйОбъемОказанияУслуг = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("МинимальныйОбъемОказанияУслуг") ;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Организация = ПредопределенноеЗначение("Справочник.Организации.ОсновноеПредприятие");
	КонецЕсли;
	
	Если ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетПродажПоСотрудникам")
		и не ЗначениеЗаполнено(Сотрудник) Тогда
		
		Сотрудник = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("СотрудникРеализацииПоУмолчанию") ;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Сотрудник 	= параметры.Сотрудник;
	ВидЦен 		= параметры.ВидЦен;
	МинимальнаяСуммаОказанияУслуг = Параметры.МинимальнаяСуммаОказанияУслуг;
	МинимальныйОбъемОказанияУслуг = Параметры.МинимальныйОбъемОказанияУслуг;
	Организация = параметры.Организация;
	ОказываемаяУслуга = Параметры.ОказываемаяУслуга;
	ОткрыватьНовыйДокументОказанияУслугПриЗавершении = параметры.ОткрыватьНовыйДокументОказанияУслугПриЗавершении;
	
	ОбщийМодульСервисСервер.ОформитьФорматКоличества(Элементы.МинимальнаяСуммаОказанияУслуг, Истина);
	
	Если ОбщийМодульПовтор.ПолучитьПараметрСеанса("НеМожетМенятьЦены") тогда
		элементы.ВидЦен.Доступность = Ложь;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	ПараметрыФормы = Новый Структура("ВидЦен", ВидЦен);
	ПараметрыФормы.Вставить("МинимальнаяСуммаОказанияУслуг", МинимальнаяСуммаОказанияУслуг);
	ПараметрыФормы.Вставить("МинимальныйОбъемОказанияУслуг", МинимальныйОбъемОказанияУслуг);
	ПараметрыФормы.Вставить("ОказываемаяУслуга", ОказываемаяУслуга);
	ПараметрыФормы.Вставить("Организация", Организация);
	ПараметрыФормы.Вставить("ОткрыватьНовыйДокументОказанияУслугПриЗавершении", ОткрыватьНовыйДокументОказанияУслугПриЗавершении);
	ПараметрыФормы.Вставить("Сотрудник", Сотрудник);
	
	Закрыть(ПараметрыФормы);
	
КонецПроцедуры
