//sza130918-0142 : 

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если не ОбщийМодульСервер.ПроверитьДокументПроведен(ПараметрКоманды) тогда
		
		Состояние(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Обработка и заполнение таблицы товаров.."));
		ОбщийМодульКлиент.ДобавитьСобытиеЖурнала(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Пересчитал таблицу Товары"), 2, ПараметрКоманды);
		ОбщийМодульКлиент.ПересчитатьТоВары(ПараметрКоманды);	
		
	Иначе
		Сообщить(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Документ уже проведен. Изменения не произведены."), СтатусСообщения.Информация);
	КонецЕсли;
	
КонецПроцедуры
