//sza140509-0120 SZA: 
//sza131005-0247 : 

&НаКлиенте
Процедура ПриОткрытии(Отказ)                                           // ПРИ ОТКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()                                                  // ПРИ ЗАКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("000100", ЭтаФорма, Отказ, );	
	Если НЕ Отказ Тогда
		ОбщийМодульСервер.ОбеспечитьСписокОтборов(Список);	
	КонецЕсли;
	
КонецПроцедуры
