//sza131227-0210 : 
Процедура Печать(ТабДок, Ссылка) Экспорт
	
	Макет = Справочники.ПодсистемаИЭИмпортЭкспортФСПоля.ПолучитьМакет("Печать");
	Макет.КодЯзыкаМакета = ОбщийМодульПовтор.ПолучитьТекущийЯзыкДокументов();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПодсистемаИЭИмпортЭкспортФСПоля.ДатаРедакции,
	|	ПодсистемаИЭИмпортЭкспортФСПоля.ДатаСоздания,
	|	ПодсистемаИЭИмпортЭкспортФСПоля.ДлинаТут,
	|	ПодсистемаИЭИмпортЭкспортФСПоля.ЗаголовокПоляПоУмолчанию,
	|	ПодсистемаИЭИмпортЭкспортФСПоля.Код,
	|	ПодсистемаИЭИмпортЭкспортФСПоля.Комментарий,
	|	ПодсистемаИЭИмпортЭкспортФСПоля.Коэффициент,
	|	ПодсистемаИЭИмпортЭкспортФСПоля.Наименование,
	|	ПодсистемаИЭИмпортЭкспортФСПоля.ОпределенноеЗначение,
	|	ПодсистемаИЭИмпортЭкспортФСПоля.Ответственный,
	|	ПодсистемаИЭИмпортЭкспортФСПоля.ПолеПринадлежитОбъектуТаблицы,
	|	ПодсистемаИЭИмпортЭкспортФСПоля.ТипТут,
	|	ПодсистемаИЭИмпортЭкспортФСПоля.ТочностьТут
	|ИЗ Справочник.ПодсистемаИЭИмпортЭкспортФСПоля КАК ПодсистемаИЭИмпортЭкспортФСПоля
	|ГДЕ ПодсистемаИЭИмпортЭкспортФСПоля.Ссылка В (&Ссылка)";
	
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = ЛОЖЬ;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ВставлятьРазделительСтраниц = ИСТИНА;
	КонецЦикла;
	
КонецПроцедуры
