// sza150518-0424
// sza150410-0147 

&НаКлиенте
Процедура ВыгрузитьПользователей(Команда)
	
	Состояние(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Выполняется выгрузка списка пользователей.."));
	
	Результат = ВыгрузитьПользователейНаСервере();
	Если НЕ Результат.Статус Тогда
		ТекстПредупреждения = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("При выполнении выгрузки пользователей произошла ошибка.");
		Если глВерсияПлатформы < 803040000  Тогда
			Выполнить(" Предупреждение(ТекстПредупреждения); ");
		Иначе
			Выполнить(" ПоказатьПредупреждение( , ТекстПредупреждения); ");
		КонецЕсли;
		
		Возврат;
	КонецЕсли;
	
	Если ПодключитьРасширениеРаботыСФайлами() Тогда
		Получаемые = Новый Массив;
		ПолучаемыйФайл = Новый ОписаниеПередаваемогоФайла;
		ПолучаемыйФайл.Имя = ФайлВыгрузки;
		ПолучаемыйФайл.Хранение = Результат.Адрес;
		Получаемые.Добавить(ПолучаемыйФайл);
		Полученные = Новый Массив;
		Если ПолучитьФайлы(Получаемые, Полученные, "", ЛОЖЬ) Тогда
			ТекстПредупреждения = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Выгрузка завершена успешно. Выгружено пользователей") + ": ";
			Если глВерсияПлатформы < 803040000  Тогда
				Выполнить(" Предупреждение(ТекстПредупреждения); ");
			Иначе
				Выполнить(" ПоказатьПредупреждение( , ТекстПредупреждения); ");
			КонецЕсли;
		КонецЕсли;
	Иначе
		ПолучитьФайл(Результат.Адрес, ФайлВыгрузки, ИСТИНА);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция   ВыгрузитьПользователейНаСервере()
	
	Обработка = РеквизитФормыВЗначение("Объект");
	Возврат Обработка.ВыгрузитьПользователей();
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьПользователей(Команда)
	
	ИмяПротокола = "IBUsers_log.txt";
	Адрес = "";
	Если НЕ ОбщийМодульСервисСервер.ПолучитьВерсиюПлатформы() < 803040000 Тогда		
		#Если ВебКлиент Тогда
			Выполнить(" ОбратныйВызов = Новый ОписаниеОповещения(""ЗагрузитьПользователейЗавершение"", Объект, ИмяПротокола); 
			| НачатьПомещениеФайла(ОбратныйВызов, Адрес, """", ИСТИНА); ");
		#Иначе
			Выполнить(" ОбратныйВызов = Новый ОписаниеОповещения(""ЗагрузитьПользователейЗавершение"", Объект, ИмяПротокола); 
			| НачатьПомещениеФайла(ОбратныйВызов, Адрес, ФайлЗагрузки, ЛОЖЬ); ");
		#КонецЕсли	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПользователейЗавершение(Результат, Адрес, ВыбранноеИмяФайла, ИмяПротокола) Экспорт
	
	Если Результат Тогда
		Состояние(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Выполняется загрузка пользователей информационной базы.."));
		Результат = ЗагрузитьПользователейНаСервере(Адрес);
		Если Результат.Статус = ЛОЖЬ Тогда
			
			ТекстПредупреждения = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("При выполнении загрузки пользователей произошла ошибка.");
			Если глВерсияПлатформы < 803040000  Тогда
				Выполнить(" Предупреждение(ТекстПредупреждения); ");
			Иначе
				Выполнить(" ПоказатьПредупреждение( , ТекстПредупреждения); ");
			КонецЕсли;
			
			Возврат;
		КонецЕсли;
		
		Если ФормироватьПротокол Тогда
			ПолучитьФайл(Результат.ФайлПротокола, ИмяПротокола, ИСТИНА);
		Иначе
			Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Загрузка пользователей завершена. Всего прочитано") + ": %1. " + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Загружено") + ": %2. " + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Совпадений") + ": %3.";
			Текст = СтрЗаменить(Текст, "%1", Результат.ИзФайла);
			Текст = СтрЗаменить(Текст, "%2", Результат.Загружено);
			Текст = СтрЗаменить(Текст, "%3", Результат.Совпадений);
			ТекстПредупреждения = Текст;
			Если глВерсияПлатформы < 803040000  Тогда
				Выполнить(" Предупреждение(ТекстПредупреждения); ");
			Иначе
				Выполнить(" ПоказатьПредупреждение( , ТекстПредупреждения); ");
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция   ЗагрузитьПользователейНаСервере(Адрес)
	
	Обработка = РеквизитФормыВЗначение("Объект");
	Возврат Обработка.ЗагрузитьПользователей(Адрес, ПриоритетФайла, ФормироватьПротокол);
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	#Если ВебКлиент Тогда
		// В веб-клиенте оставим только имена файлов
		ФайлВыгрузки = "IBUsers.xml";
		ФайлЗагрузки = "IBUsers.xml";
		// и уберем поля для предварительного выбора файлов, т.к. будут использоваться интерактивные методы
		Элементы.ФайлВыгрузки.Видимость = ЛОЖЬ;
		Элементы.ФайлЗагрузки.Видимость = ЛОЖЬ;
	#КонецЕсли
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьСобственныйПереводЭлементовИнтерфейса") Тогда
		ОбщийМодульСервер.ПеревестиРеквизитыФормы(ЭтаФорма);	
	КонецЕсли;
	
	ФайлВыгрузки = "IBUsers.xml";
	ФайлЗагрузки = "IBUsers.xml";
	ПриоритетФайла = ЛОЖЬ;
	ФормироватьПротокол = ИСТИНА;
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлВыгрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ЛОЖЬ;
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогВыбора.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите файл для сохранения списка пользователей");
	ДиалогВыбора.ПроверятьСуществованиеФайла = ЛОЖЬ;
	ДиалогВыбора.ПолноеИмяФайла = ФайлВыгрузки;
	ДиалогВыбора.Фильтр = "XML-" + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("файлы") + "|*.xml|" + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Все файлы") + "|*.*";
	Результат = ДиалогВыбора.Выбрать();
	Если Результат Тогда
		ФайлВыгрузки = ДиалогВыбора.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлЗагрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ЛОЖЬ;
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбора.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите файл для загрузки списка пользователей");
	ДиалогВыбора.ПолноеИмяФайла = ФайлЗагрузки;
	ДиалогВыбора.Фильтр = "XML-" + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("файлы") + "|*.xml|" + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Все файлы") + "|*.*";
	Результат = ДиалогВыбора.Выбрать();
	Если Результат Тогда
		ФайлЗагрузки = ДиалогВыбора.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры
