// sza151102-0207 шаблон
// sza150924-0302

&НаКлиенте
Процедура ЗаданаТемаПриИзменении(Элемент)
	ИзменитьВидимостьСоставаШаблона();
КонецПроцедуры

&НаКлиенте
Процедура ЗадействованыСредстваПредприятияПриИзменении(Элемент)
	ИзменитьВидимостьСоставаШаблона();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполняютсяТиповыеЗначенияПриИзменении(Элемент)
	ИзменитьВидимостьСоставаШаблона();
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВидимостьСоставаШаблона()

	Элементы.ПараметрыНовогоСобытия.Видимость = Объект.ЗаполняютсяТиповыеЗначения;
	Элементы.ТаблицыНовогоСобытия.Видимость = Объект.ЗаполняютсяТиповыеЗначения;
	Если Объект.ЗаполняютсяТиповыеЗначения Тогда
		Элементы.Длительность.Видимость	= Объект.УказываетсяДатаПроведения И НЕ Объект.УказываетсяПериодПроведения;
		Элементы.Результат.Видимость	= Объект.ПодводитсяРезультат;
		Элементы.СкладСписанияРекламнойПродукции.Видимость = Объект.ИспользуетсяРекламнаяПродукция;
		Элементы.Сотрудник.Видимость	= Объект.УчаствуетСотрудник;
		Элементы.Сотрудники.Видимость	= Объект.УчаствуютНесколькоСотрудников;
		Элементы.Тема.Видимость			= Объект.ЗаданаТема;
		Элементы.АдресаПочты.Видимость	= Объект.ИспользуетсяЭлектроннаяПочта;
		Элементы.ВидЦен.Видимость 		= Объект.УчебноПрактическоеЗанятие;
		Элементы.АдресПомещения.Видимость 	= Объект.ИспользуетсяПомещение;
		Элементы.Помещения.Видимость 		= Объект.ИспользуетсяНесколькоПомещений И НЕ Объект.ИспользуетсяПомещение;
		Элементы.Клиент.Видимость			= Объект.УчаствуетКлиент И НЕ Объект.УчаствуетНесколькоКлиентов;
		Элементы.Клиенты.Видимость			= Объект.УчаствуетНесколькоКлиентов И НЕ Объект.УчаствуетКлиент;
		Элементы.Поставщик.Видимость		= Объект.УчаствуетПоставщик И НЕ Объект.УчаствуетНесколькоПоставщиков;
		Элементы.Поставщики.Видимость		= НЕ Объект.УчаствуетПоставщик И Объект.УчаствуетНесколькоПоставщиков;
		Элементы.Договора.Видимость			= Объект.УпоминаютсяДоговораСКонтрагентами;
		Элементы.Организации.Видимость		= НЕ Объект.ОтИмениОрганизации И Объект.ОтИмениНесколькихОрганизаций;
		Элементы.Организация.Видимость		= Объект.ОтИмениОрганизации И НЕ Объект.ОтИмениНесколькихОрганизаций;
		Элементы.Направление.Видимость		= Объект.ПринадлежитНаправлениюДеятельности И НЕ Объект.ПринадлежитНесколькимНаправлениямДеятельности;
		Элементы.Направления.Видимость		= НЕ Объект.ПринадлежитНаправлениюДеятельности И Объект.ПринадлежитНесколькимНаправлениямДеятельности;
		Элементы.Телефоны.Видимость			= Объект.ИспользуетсяТелефон;
		Элементы.АдресаПочты.Видимость		= Объект.ИспользуетсяЭлектроннаяПочта;
		Элементы.РегионыИЛокации.Видимость	= Объект.ОхваченыРегионыИЛокации;
		Элементы.ОбъектыКлиентов.Видимость	= Объект.УпоминаютсяОбъектыКлиентов;
		Элементы.ДокументыСобытия.Видимость	= Объект.УпоминаютсяДокументыБазыДанных;
		Элементы.Производители.Видимость	= Объект.УпоминаютсяПроизводители;
		Элементы.Товары.Видимость			= Объект.УпоминаютсяТоварыИУслуги;
		Элементы.Склады.Видимость			= Объект.УпоминаютсяСкладыПредприятия;
		Элементы.ЭлементыДанных.Видимость	= Объект.УпоминаютсяСсылкиНаЭлементыБазыДанных;
		Элементы.Подразделения.Видимость	= Объект.УчаствуютПодразделения;
		Элементы.Контакт.Видимость 			= (Объект.УчаствуетКлиент И НЕ Объект.УчаствуетНесколькоКлиентов) ИЛИ (Объект.УчаствуетПоставщик И НЕ Объект.УчаствуетНесколькоПоставщиков);
		Элементы.РекламнаяПродукция.Видимость		= Объект.ИспользуетсяРекламнаяПродукция;
		Элементы.ЗадействованныеСредства.Видимость  = Объект.ЗадействованыСредстваПредприятия;
		Элементы.СобственныеРасходы.Видимость 		= Объект.ПредполагаютсяСобственныеРасходыДенег;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИспользуетсяНесколькоПомещенийПриИзменении(Элемент)

	Если Объект.ИспользуетсяНесколькоПомещений Тогда
		Объект.ИспользуетсяПомещение = ЛОЖЬ;
	КонецЕсли;

	ИзменитьВидимостьСоставаШаблона();

КонецПроцедуры

&НаКлиенте
Процедура ИспользуетсяПомещениеПриИзменении(Элемент)

	Если Объект.ИспользуетсяПомещение Тогда
		Объект.ИспользуетсяНесколькоПомещений = ЛОЖЬ;
	КонецЕсли;

	ИзменитьВидимостьСоставаШаблона();

КонецПроцедуры

&НаКлиенте
Процедура ИспользуетсяРекламнаяПродукцияПриИзменении(Элемент)

	ИзменитьВидимостьСоставаШаблона();

КонецПроцедуры

&НаКлиенте
Процедура ИспользуетсяТелефонПриИзменении(Элемент)

	ИзменитьВидимостьСоставаШаблона();

КонецПроцедуры

&НаКлиенте
Процедура ИспользуетсяЭлектроннаяПочтаПриИзменении(Элемент)

	ИзменитьВидимостьСоставаШаблона();

КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)

	Объект.Наименование = Наименование;
	НаименованиеИзменяли = ИСТИНА;
	Если ПереводитьНаименованияАвтоматически Тогда
		ОбщийМодульКлиент.ПеревестиНаименованияАвтоматически(Наименование, НаименованияНаДругихЯзыках);
		БылиИзмененияЗначенияПолейНаЯзыках = ИСТИНА;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НаименованияНаДругихЯзыкахНаЯзыкеПриИзменении(Элемент)
	БылиИзмененияЗначенияПолейНаЯзыках = ИСТИНА;
КонецПроцедуры

&НаКлиенте
Процедура НаименованияНаДругихЯзыкахПриИзменении(Элемент)
	БылиИзмененияЗначенияПолейНаЯзыках = ИСТИНА;
КонецПроцедуры

&НаКлиенте
Процедура ОтИмениНесколькихОрганизацийПриИзменении(Элемент)

	Если Объект.ОтИмениНесколькихОрганизаций Тогда
		Объект.ОтИмениОрганизации = ЛОЖЬ;
	КонецЕсли;

	ИзменитьВидимостьСоставаШаблона();

КонецПроцедуры

&НаКлиенте
Процедура ОтИмениОрганизацииПриИзменении(Элемент)

	Если Объект.ОтИмениОрганизации Тогда
		Объект.ОтИмениНесколькихОрганизаций = ЛОЖЬ;
	КонецЕсли;

	ИзменитьВидимостьСоставаШаблона();

КонецПроцедуры

&НаКлиенте
Процедура ОхваченыРегионыИЛокацииПриИзменении(Элемент)
	ИзменитьВидимостьСоставаШаблона();
КонецПроцедуры

&НаКлиенте
Процедура ПодводитсяРезультатПриИзменении(Элемент)
	ИзменитьВидимостьСоставаШаблона();
КонецПроцедуры

&НаКлиенте
Процедура ПредполагаютсяСобственныеРасходыДенегПриИзменении(Элемент)
	ИзменитьВидимостьСоставаШаблона();
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеНаДругихЯзыках(Команда)
	Элементы.НаименованияНаДругихЯзыках.Видимость  = НЕ Элементы.НаименованияНаДругихЯзыках.Видимость;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1, Объект.Ссылка, ИСТИНА);
КонецПроцедуры

&НаКлиенте
Процедура ПринадлежитНаправлениюДеятельностиПриИзменении(Элемент)

	Если Объект.ПринадлежитНаправлениюДеятельности Тогда
		Объект.ПринадлежитНесколькимНаправлениямДеятельности = ЛОЖЬ;
	КонецЕсли;

	ИзменитьВидимостьСоставаШаблона();

КонецПроцедуры

&НаКлиенте
Процедура ПринадлежитНесколькимНаправлениямДеятельностиПриИзменении(Элемент)

	Если Объект.ПринадлежитНесколькимНаправлениямДеятельности Тогда
		Объект.ПринадлежитНаправлениюДеятельности = ЛОЖЬ;
	КонецЕсли;

	ИзменитьВидимостьСоставаШаблона();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0, Объект.Ссылка, ИСТИНА);
	ИзменитьВидимостьСоставаШаблона();

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("000971", ЭтаФорма, Отказ, );

	Если НЕ Отказ Тогда
		ЗначениеЗаполненоОбъектСсылка = ЗначениеЗаполнено(Объект.Ссылка);
		Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьСобственныйПереводЭлементовИнтерфейса") Тогда
			ОбщийМодульСервер.ПеревестиРеквизитыФормы(ЭтаФорма);
		КонецЕсли;

		ПоддержкаДругихЯзыков = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ПоддерживатьИныеЯзыкиКромеРусского") И ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ПоддерживатьНаименованияНаДругихЯзыкахКромеРусского", ИСТИНА);

		Если ЗначениеЗаполненоОбъектСсылка Тогда

			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 События.Ссылка
			|ИЗ Документ.События КАК События
			|ГДЕ События.ВидСобытия = &ВидСобытия";
			Запрос.УстановитьПараметр("ВидСобытия", Объект.Ссылка);

			РезультатЗапроса = Запрос.Выполнить();
			Элементы.ПредупреждениеОбИзменении.Видимость = НЕ РезультатЗапроса.Пустой();
		КонецЕсли;

		Если ПоддержкаДругихЯзыков
			И ЗначениеЗаполненоОбъектСсылка Тогда

			Наименование = ОбщийМодульПовтор.получитьПредставлениеНаЯзыке(Объект.Ссылка);

			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ ЗначенияНаДругихЯзыках.Язык,
			|	ЗначенияНаДругихЯзыках.НаЯзыке,
			|	ЗначенияНаДругихЯзыках.Поле
			|ИЗ РегистрСведений.ЗначенияНаДругихЯзыках КАК ЗначенияНаДругихЯзыках
			|ГДЕ ЗначенияНаДругихЯзыках.ОбъектБазыДанных = &ОбъектБазыДанных";
			Запрос.УстановитьПараметр("ОбъектБазыДанных", Объект.Ссылка);

			РезультатЗапроса = Запрос.Выполнить();

			Если НЕ РезультатЗапроса.Пустой() Тогда
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					Если ВыборкаДетальныеЗаписи.Поле = "Наименование" Тогда
						СтрокаЯзыка = НаименованияНаДругихЯзыках.Добавить();
						СтрокаЯзыка.Язык 	= ВыборкаДетальныеЗаписи.Язык;
						СтрокаЯзыка.НаЯзыке = ВыборкаДетальныеЗаписи.НаЯзыке;
					КонецЕсли;

				КонецЦикла;
			КонецЕсли;
		Иначе
			Наименование = Объект.Наименование;
		КонецЕсли;

		Если ПоддержкаДругихЯзыков Тогда
			ПереводитьНаименованияАвтоматически = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьРегистрТекстовНаДругихЯзыкахДляАвтоматическогоПереводаНаименований");
			Элементы.НаименованияНаДругихЯзыкахЯзык.РежимВыбораИзСписка = ИСТИНА;
			ОбщийМодульПовтор.УстановитьСписокДоступныхЯзыков(Элементы.НаименованияНаДругихЯзыкахЯзык.СписокВыбора, ИСТИНА);
		КонецЕсли;
	КонецЕсли;

	ОбщийМодульСервисСервер.ОбработатьНовуюФорму(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура РеакцияНаПрочиеСобытияФормы(КомандаСобытияФормы) Экспорт // Для реакции на события для запрограммированных элементов
	ОбщийМодульКлиент.РеакцияНаПрочиеСобытияФормы(КомандаСобытияФормы, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура УказываетсяДатаПроведенияПриИзменении(Элемент)

	ИзменитьВидимостьСоставаШаблона();

КонецПроцедуры

&НаКлиенте
Процедура УказываетсяПериодПроведенияПриИзменении(Элемент)

	ИзменитьВидимостьСоставаШаблона();

КонецПроцедуры

&НаКлиенте
Процедура УпоминаютсяДоговораСКонтрагентамиПриИзменении(Элемент)

	ИзменитьВидимостьСоставаШаблона();

КонецПроцедуры

&НаКлиенте
Процедура УпоминаютсяДокументыБазыДанныхПриИзменении(Элемент)

	ИзменитьВидимостьСоставаШаблона();

КонецПроцедуры

&НаКлиенте
Процедура УпоминаютсяОбъектыКлиентовПриИзменении(Элемент)

	ИзменитьВидимостьСоставаШаблона();

КонецПроцедуры

&НаКлиенте
Процедура УпоминаютсяПроизводителиПриИзменении(Элемент)

	ИзменитьВидимостьСоставаШаблона();

КонецПроцедуры

&НаКлиенте
Процедура УпоминаютсяСкладыПредприятияПриИзменении(Элемент)

	ИзменитьВидимостьСоставаШаблона();

КонецПроцедуры

&НаКлиенте
Процедура УпоминаютсяСсылкиНаЭлементыБазыДанныхПриИзменении(Элемент)
	ИзменитьВидимостьСоставаШаблона();
КонецПроцедуры

&НаКлиенте
Процедура УпоминаютсяТоварыИуслугиПриИзменении(Элемент)
	ИзменитьВидимостьСоставаШаблона();
КонецПроцедуры

&НаКлиенте
Процедура УчаствуетКлиентПриИзменении(Элемент)

	Если Объект.УчаствуетКлиент Тогда
		Объект.УчаствуетНесколькоКлиентов = ЛОЖЬ;
	КонецЕсли;

	ИзменитьВидимостьСоставаШаблона();

КонецПроцедуры

&НаКлиенте
Процедура УчаствуетНесколькоКлиентовПриИзменении(Элемент)

	Если Объект.УчаствуетНесколькоКлиентов Тогда
		Объект.УчаствуетКлиент = ЛОЖЬ;
	КонецЕсли;

	ИзменитьВидимостьСоставаШаблона();

КонецПроцедуры

&НаКлиенте
Процедура УчаствуетНесколькоПоставщиковПриИзменении(Элемент)

	Если Объект.УчаствуетНесколькоПоставщиков Тогда
		Объект.УчаствуетПоставщик = ЛОЖЬ;
	КонецЕсли;

	ИзменитьВидимостьСоставаШаблона();

КонецПроцедуры

&НаКлиенте
Процедура УчаствуетПоставщикПриИзменении(Элемент)

	Если Объект.УчаствуетПоставщик Тогда
		Объект.УчаствуетНесколькоПоставщиков = ЛОЖЬ;
	КонецЕсли;

	ИзменитьВидимостьСоставаШаблона();

КонецПроцедуры

&НаКлиенте
Процедура УчаствуетСотрудникПриИзменении(Элемент)

	Если Объект.УчаствуетСотрудник Тогда
		Объект.УчаствуютНесколькоСотрудников = ЛОЖЬ;
	КонецЕсли;

	ИзменитьВидимостьСоставаШаблона();

КонецПроцедуры

&НаКлиенте
Процедура УчаствуютНесколькоСотрудниковПриИзменении(Элемент)

	Если Объект.УчаствуютНесколькоСотрудников Тогда
		Объект.УчаствуетСотрудник = ЛОЖЬ;
	КонецЕсли;

	ИзменитьВидимостьСоставаШаблона();

КонецПроцедуры

&НаКлиенте
Процедура УчаствуютПодразделенияПриИзменении(Элемент)
	ИзменитьВидимостьСоставаШаблона();
КонецПроцедуры

&НаКлиенте
Процедура УчебноПрактическоеЗанятиеПриИзменении(Элемент)
	ИзменитьВидимостьСоставаШаблона();
КонецПроцедуры
