#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// sza131227-0210 :
Процедура Печать(ДокументДляПечати, Ссылка) Экспорт

	Макет = Справочники.ПодсистемаИЭПоля.ПолучитьМакет("Печать");
	Макет.КодЯзыкаМакета = ОбщийМодульПовтор.ПолучитьТекущийЯзыкДокументов();

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПодсистемаИЭПоля.ДатаРедакции,
	|	ПодсистемаИЭПоля.ДатаСоздания,
	|	ПодсистемаИЭПоля.ДлинаТут,
	|	ПодсистемаИЭПоля.ЗаголовокПоляПоУмолчанию,
	|	ПодсистемаИЭПоля.Код,
	|	ВЫРАЗИТЬ(ПодсистемаИЭПоля.Комментарий КАК СТРОКА(1000)) КАК Комментарий,
	|	ПодсистемаИЭПоля.Коэффициент,
	|	ПодсистемаИЭПоля.Наименование,
	|	ПодсистемаИЭПоля.ОпределенноеЗначение,
	|	ПодсистемаИЭПоля.Ответственный,
	|	ПодсистемаИЭПоля.ПолеПринадлежитОбъектуТаблицы,
	|	ПодсистемаИЭПоля.ТипТут,
	|	ПодсистемаИЭПоля.ТочностьТут
	|ИЗ Справочник.ПодсистемаИЭПоля КАК ПодсистемаИЭПоля
	|ГДЕ ПодсистемаИЭПоля.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);

	Выборка = Запрос.Выполнить().Выбрать();
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");

	ДокументДляПечати.ИмяПараметровПечати  = "ИЭПоле" + СокрЛП(ИмяКомпьютера());
	ДокументДляПечати.КлючПараметровПечати = ДокументДляПечати.ИмяПараметровПечати;
	ДокументДляПечати.Очистить();
	ВставлятьРазделительСтраниц = ЛОЖЬ;

	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ДокументДляПечати.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьЗаголовок);
		ДокументДляПечати.Вывести(ОбластьЗаголовок);
		Шапка.Параметры.Заполнить(Выборка);
		ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(Шапка);
		ДокументДляПечати.Вывести(Шапка, Выборка.Уровень());
		ВставлятьРазделительСтраниц = ИСТИНА;

	КонецЦикла;

КонецПроцедуры

#КонецЕсли
