// sza131227-0210 : 
Процедура Печать(ТабДок, Ссылка) Экспорт
	
	Макет = Справочники.ПодсистемаИЭПоля.ПолучитьМакет("Печать");
	Макет.КодЯзыкаМакета = ОбщийМодульПовтор.ПолучитьТекущийЯзыкДокументов();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПодсистемаИЭПоля.ДатаРедакции,
	|	ПодсистемаИЭПоля.ДатаСоздания,
	|	ПодсистемаИЭПоля.ДлинаТут,
	|	ПодсистемаИЭПоля.ЗаголовокПоляПоУмолчанию,
	|	ПодсистемаИЭПоля.Код,
	|	ПодсистемаИЭПоля.Комментарий,
	|	ПодсистемаИЭПоля.Коэффициент,
	|	ПодсистемаИЭПоля.Наименование,
	|	ПодсистемаИЭПоля.ОпределенноеЗначение,
	|	ПодсистемаИЭПоля.Ответственный,
	|	ПодсистемаИЭПоля.ПолеПринадлежитОбъектуТаблицы,
	|	ПодсистемаИЭПоля.ТипТут,
	|	ПодсистемаИЭПоля.ТочностьТут
	|ИЗ Справочник.ПодсистемаИЭПоля КАК ПодсистемаИЭПоля
	|ГДЕ ПодсистемаИЭПоля.Ссылка В (&Ссылка)";
	
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	
	ТабДок.ИмяПараметровПечати  = "ИЭПоле" + СокрЛП(ИмяКомпьютера());
	ТабДок.КлючПараметровПечати = ТабДок.ИмяПараметровПечати;
	
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = ЛОЖЬ;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьЗаголовок);
		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(Шапка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ВставлятьРазделительСтраниц = ИСТИНА;
	КонецЦикла;
	
КонецПроцедуры
