// sza150514-0007 
// sza101118-1725       
// sza101025
Процедура ПередЗаписью(Отказ)
	
	Если СокрЛП(Комментарий) = "" Тогда
		Комментарий = ОбщийМодульСервисСервер.ПолучитьКрасивоеНаименованиеОбъекта(Наименование);
	КонецЕсли;
	
	Наименование = СокрЛП(Наименование);
	
	Если НЕ Предопределенный Тогда
		Наименование = СтрЗаменить(Наименование, " ", "");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если НЕ Отказ
		И Модифицированность() Тогда
		
		ОбновитьПовторноИспользуемыеЗначения();
	КонецЕсли;
	
КонецПроцедуры
