#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// sza150514-0007
// sza101118-1725       
// sza101025
Процедура ПередЗаписью(Отказ)
	
	Если НЕ ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("МассоваяЗагрузка", ИСТИНА) Тогда
		Если СокрЛП(Комментарий) = "" Тогда
			Комментарий = ОбщийМодульСервисСервер.ПолучитьКрасивоеНаименованиеОбъекта(Наименование);
		КонецЕсли;
		
		Наименование = СокрЛП(Наименование);
		
		Если НЕ Предопределенный Тогда
			Наименование = СтрЗаменить(Наименование, " ", "");
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры
Процедура ПриЗаписи(Отказ)
	
	Если НЕ Отказ
		И НЕ ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("МассоваяЗагрузка", ИСТИНА)
		И Модифицированность() Тогда
		
		ОбновитьПовторноИспользуемыеЗначения();
	КонецЕсли;
	
КонецПроцедуры
Процедура ПриКопировании(ОбъектКопирования)
	Комментарий = "";
КонецПроцедуры

#КонецЕсли