//sza140104-0212 : 
//sza131214-0341 : 
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если ОбщийМодульПовтор.ВывестиНаименованияНаДругомЯзыке() Тогда
		
		ВозможноеПредставление = ОбщийМодульПовтор.получитьПредставлениеНаЯзыке(Данные.ссылка, , ИСТИНА);
		Если НЕ ВозможноеПредставление = Неопределено Тогда
			Представление = ВозможноеПредставление;
			СтандартнаяОбработка = ЛОЖЬ;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура Печать(ТабДок, Ссылка) Экспорт
	
	Макет = Справочники.ЗаметкиИНапоминания.ПолучитьМакет("Печать");
	Макет.КодЯзыкаМакета = ОбщийМодульПовтор.ПолучитьТекущийЯзыкДокументов();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ЗаметкиИНапоминания.Дата,
	|	ЗаметкиИНапоминания.ДатаРедакции,
	|	ЗаметкиИНапоминания.ДатаСоздания,
	|	ЗаметкиИНапоминания.Комментарий,
	|	ЗаметкиИНапоминания.Наименование,
	|	ЗаметкиИНапоминания.Ответственный,
	|	ЗаметкиИНапоминания.ПовторятьКаждыеЧислоЧасов,
	|	ЗаметкиИНапоминания.Причина,
	|	ЗаметкиИНапоминания.СвязаноС,
	|	ЗаметкиИНапоминания.ТекстЗаметки,
	|	ЗаметкиИНапоминания.ТипЗаметки,
	|	ЗаметкиИНапоминания.ВыполняемыеЗадачи.(
	|		ТипЗадачи,
	|		КодИмяОтчета,
	|		Адрес,
	|		Коментарий	)
	|ИЗ Справочник.ЗаметкиИНапоминания КАК ЗаметкиИНапоминания
	|ГДЕ ЗаметкиИНапоминания.Ссылка В (&Ссылка)";
	
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьВыполняемыеЗадачиШапка = Макет.ПолучитьОбласть("ВыполняемыеЗадачиШапка");
	ОбластьВыполняемыеЗадачи = Макет.ПолучитьОбласть("ВыполняемыеЗадачи");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = ЛОЖЬ;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьВыполняемыеЗадачиШапка);
		ВыборкаВыполняемыеЗадачи = Выборка.ВыполняемыеЗадачи.Выбрать();
		Пока ВыборкаВыполняемыеЗадачи.Следующий() Цикл
			ОбластьВыполняемыеЗадачи.Параметры.Заполнить(ВыборкаВыполняемыеЗадачи);
			ТабДок.Вывести(ОбластьВыполняемыеЗадачи, ВыборкаВыполняемыеЗадачи.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = ИСТИНА;
	КонецЦикла;
	
КонецПроцедуры
