#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// sza151210-0245 про
// sza150528-0205 
// sza140411-1653 : 
// sza131121-1524  
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Организации") Тогда
		Комментарий  = ДанныеЗаполнения.Комментарий;
		Наименование = ДанныеЗаполнения.Наименование;
		ТекстЗаметки = ДанныеЗаполнения.НаименованиеДляПечати;
		Причина = ДанныеЗаполнения.Ссылка;
		Актуально = ИСТИНА;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Клиенты") Тогда
		Комментарий = ДанныеЗаполнения.Комментарий;
		Наименование = ДанныеЗаполнения.Наименование;
		ТекстЗаметки = ДанныеЗаполнения.НаименованиеДляПечати;
		Причина = ДанныеЗаполнения.Ссылка;
		Актуально = ИСТИНА;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Поставщики") Тогда
		Комментарий  = ДанныеЗаполнения.Комментарий;
		Наименование = ДанныеЗаполнения.Наименование;
		ТекстЗаметки = ДанныеЗаполнения.НаименованиеДляПечати;
		Причина = ДанныеЗаполнения.Ссылка;
		Актуально = ИСТИНА;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Производители") Тогда
		Комментарий  = ДанныеЗаполнения.Комментарий;
		Наименование = ДанныеЗаполнения.Наименование;
		Причина = ДанныеЗаполнения.Ссылка;
		Актуально = ИСТИНА;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Склады") Тогда
		Комментарий  = ДанныеЗаполнения.Комментарий;
		Наименование = ДанныеЗаполнения.Наименование;
		Причина = ДанныеЗаполнения.Ссылка;
		Актуально = ИСТИНА;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Сотрудники") Тогда
		Комментарий  = ДанныеЗаполнения.Комментарий;
		Наименование = ДанныеЗаполнения.Наименование;
		Причина = ДанныеЗаполнения.Ссылка;
		Актуально = ИСТИНА;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ХранилищаДенег") Тогда
		Комментарий  = ДанныеЗаполнения.Комментарий;
		Наименование = ДанныеЗаполнения.Наименование;
		Причина = ДанныеЗаполнения.Ссылка;
		Актуально = ИСТИНА;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Номенклатура") Тогда
		Комментарий  = ДанныеЗаполнения.Комментарий;
		Наименование = ДанныеЗаполнения.Наименование;
		Причина = ДанныеЗаполнения.Ссылка;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Изображения") Тогда
		Комментарий  = ДанныеЗаполнения.Комментарий;
		Наименование = ДанныеЗаполнения.Наименование;
		Причина = ДанныеЗаполнения.Ссылка;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Договора") Тогда
		Причина = ДанныеЗаполнения.Ссылка;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ПодпискиНаСобытия") Тогда
		Причина = ДанныеЗаполнения.Ссылка;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВыполненияРабот") Тогда
		Комментарий  = ДанныеЗаполнения.Комментарий;
		Наименование = СокрЛП(ДанныеЗаполнения.Ссылка);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ДвиженияДенег") Тогда
		Комментарий  = ДанныеЗаполнения.Комментарий;
		Наименование = СокрЛП(ДанныеЗаполнения.Ссылка);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОказанияУслугЗаВремя") Тогда
		Комментарий  = ДанныеЗаполнения.Комментарий;
		Наименование = СокрЛП(ДанныеЗаполнения.Ссылка);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Инвентаризации") Тогда
		Наименование = СокрЛП(ДанныеЗаполнения.Ссылка);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.КорректировкиИРегистрацияОстатков") Тогда
		Наименование = СокрЛП(ДанныеЗаполнения.Ссылка);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПеремещенияТовара") Тогда
		Наименование = СокрЛП(ДанныеЗаполнения.Ссылка);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступленияТовара") Тогда
		Наименование = СокрЛП(ДанныеЗаполнения.Ссылка);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РасходыТовара") Тогда
		Наименование = СокрЛП(ДанныеЗаполнения.Ссылка);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.УстановкиЦен") Тогда
		Наименование = СокрЛП(ДанныеЗаполнения.Ссылка);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Комплектация") Тогда
		Наименование = СокрЛП(ДанныеЗаполнения.Ссылка);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОтчетыКомиссионеров") Тогда
		Наименование = СокрЛП(ДанныеЗаполнения.Ссылка);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПланыДоходовИРасходовДенег") Тогда
		Наименование = СокрЛП(ДанныеЗаполнения.Ссылка);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПланыПродаж") Тогда
		Наименование = СокрЛП(ДанныеЗаполнения.Ссылка);
	КонецЕсли;
	
КонецПроцедуры
Процедура ПередЗаписью(Отказ)
	
	Если НЕ Отказ 
		И НЕ ПометкаУдаления
		И НЕ ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("МассоваяЗагрузка", ИСТИНА) Тогда
		
		ОбщийМодульСервер.ПроверитьСменуНаименованияНаТекущемЯзыке(Наименование, Ссылка, , Отказ);	
		
		Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ФормироватьОписаниеТаблицОбъектовДляИхСписков") Тогда
			ОбщийМодульСервер.ОформитьОписаниеТаблицы(ЭтотОбъект, "ВыполняемыеЗадачи", "ТипЗадачи", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("задач"));
			ОбщийМодульСервер.ОформитьОписаниеТаблицы(ЭтотОбъект, "Получатели", "Получатель", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("получателей"));	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
Процедура ПриКопировании(ОбъектКопирования)
	Комментарий = "";
КонецПроцедуры

#КонецЕсли