// // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // //
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ
// // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // 
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ОК(Команда)
	
	РезультатВыбора = Новый Структура("ОтносительныйРазмер, МинимальныйЭффект");
	ЗаполнитьЗначенияСвойств(РезультатВыбора, ЭтаФорма);
	
	ОповеститьОВыборе(РезультатВыбора);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
		Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьСобственныйПереводЭлементовИнтерфейса") Тогда
			ОбщийМодульСервер.ПеревестиРеквизитыФормы(ЭтаФорма);	
		КонецЕсли;
		
	ОтносительныйРазмер = Параметры.ОтносительныйРазмер;
	МинимальныйЭффект = Параметры.МинимальныйЭффект;
	Элементы.МинимальныйЭффект.Видимость = Параметры.РежимПерестроения;
	Заголовок = ?(Параметры.РежимПерестроения,
	              ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Параметры перестроения"),
	              ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Параметр расчета оптимальных агрегатов"));
	
КонецПроцедуры
