//sza131125-0245 SZA: 

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	
	ФормаПечати = получитьформу("ОбщаяФорма.ФормаПечати");
	ПечатьСерийНоменклатуры(ФормаПечати.Результат, ПараметрКоманды);

	ФормаПечати.Результат.ОтображатьСетку 	= Ложь;
	ФормаПечати.Результат.Защита 			= Истина;
	ФормаПечати.Результат.ТолькоПросмотр 	= Истина;
	ФормаПечати.Результат.ОтображатьЗаголовки = Ложь;
	ФормаПечати.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("печать: Серийная Номенклатура");
	ФормаПечати.открыть();	
	
КонецПроцедуры

&НаСервере
Процедура ПечатьСерийНоменклатуры(ТабДок, ПараметрКоманды)
	
	ОбщийМодульСервер.ДобавитьСобытиеЖурналаНаСервере(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Напечатал карточку серийной номенклатуры. "), 2);
	Справочники.Номенклатура.ПечатьСерийНоменклатуры(ТабДок, ПараметрКоманды);
	
КонецПроцедуры
