//sza140612-1545 : 
//ыяф131205

&НаСервере
Функция   ПроверитьСерийностьЭлементовНабора(Знач Номенклатура, Знач НоменклатураСерийная = Ложь) Экспорт
	
	Для Каждого СтрокаСостава Из Номенклатура.Состав Цикл
		
		НоменклатураСостава = СтрокаСостава.Номенклатура;
		
		Если НоменклатураСостава.СерийныйУчет Тогда
			НоменклатураСерийная = Истина;
			Прервать;
		КонецЕсли;
		
		если ОбщийМодульПовтор.ЭтоНабор(НоменклатураСостава) Тогда
			
			НоменклатураСерийная = ПроверитьСерийностьЭлементовНабора(НоменклатураСостава, НоменклатураСерийная) ;
			
			если НоменклатураСерийная тогда
				прервать;
			конецесли;
			
		КонецЕсли;		
	КонецЦикла;
	
	Возврат НоменклатураСерийная;
	
КонецФункции

&НаСервере
Функция   ПолучитьНоменклатуруПоШтрихКоду(Знач ДанныеШтрикода, Знач ВСтруктуре = Ложь, Знач ИспользоватьДополнительныеУстаревшиеШтрихКодыНоменклатуры = Неопределено, Знач ДатаДокумента = Неопределено) Экспорт
	
	Номенклатура = Неопределено;
	НоменклатураСтруктура = Ложь;
	
	Если ТипЗнч(ДанныеШтрикода) = Тип("Строка") Тогда
		ШтрихКод = ДанныеШтрикода;	
	иначе	
		ШтрихКод = ДанныеШтрикода.ШтрихКод;
	КонецЕсли;
	
	Если ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ИспользоватьВШтрихКодеТолькоЛатинскиеСимволы") Тогда
		ШтрихКод = ПодсистемаИЭИмпортЭкспортФС.ПеревестиСтрокуВЛатинскиеСимволы(ШтрихКод, Ложь, Истина);
	КонецЕсли;	
	
	Если ИспользоватьДополнительныеУстаревшиеШтрихКодыНоменклатуры = Неопределено 
		ИЛИ ИспользоватьДополнительныеУстаревшиеШтрихКодыНоменклатуры Тогда
		
		ИспользоватьДополнительныеУстаревшиеШтрихКодыНоменклатуры = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ИспользоватьДополнительныеУстаревшиеШтрихКодыНоменклатуры") ;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Если ИспользоватьДополнительныеУстаревшиеШтрихКодыНоменклатуры Тогда
		
		Если НЕ ДатаДокумента = Неопределено Тогда
			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	ЕСТЬNULL(ШтрихКоды.Номенклатура, &неопред) КАК Номенклатура,
			|	ЕСТЬNULL(ШтрихКоды.СерияНоменклатуры, &неопред) КАК СерияНоменклатуры,
			|	ЕСТЬNULL(ШтрихКоды.ЕдиницаИзмерения, &неопред) КАК ЕдиницаИзмерения,
			|	ЕСТЬNULL(ШтрихКоды.Номенклатура.ПометкаУдаления, &неопред) КАК НоменклатураПометкаУдаления
			|ИЗ
			|	РегистрСведений.ШтрихКоды КАК ШтрихКоды
			|ГДЕ
			|	(ШтрихКоды.ШтрихКод = &ШтрихКод
			|			ИЛИ ШтрихКоды.ШтрихКод = &ШтрихКодВРЕГ)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	ЕСТЬNULL(ДополнительныеШтрихКоды.Номенклатура, &неопред),
			|	ЕСТЬNULL(ДополнительныеШтрихКоды.СерияНоменклатуры, &неопред),
			|	ЕСТЬNULL(ДополнительныеШтрихКоды.ЕдиницаИзмерения, &неопред),
			|	ЕСТЬNULL(ДополнительныеШтрихКоды.Номенклатура.ПометкаУдаления, &неопред)
			|ИЗ
			|	РегистрСведений.ДополнительныеШтрихКоды КАК ДополнительныеШтрихКоды
			|ГДЕ
			|	(ДополнительныеШтрихКоды.ШтрихКод = &ШтрихКод
			|			ИЛИ ДополнительныеШтрихКоды.ШтрихКод = &ШтрихКодВРЕГ)
			|	И (ДополнительныеШтрихКоды.ДействуетСДаты = &ПустаяДата
			|			ИЛИ ДополнительныеШтрихКоды.ДействуетСДаты >= &ДатаДок)
			|	И (ДополнительныеШтрихКоды.ДействуетПоДату = &ПустаяДата
			|			ИЛИ ДополнительныеШтрихКоды.ДействуетПоДату <= &ДатаДок)
			|
			|УПОРЯДОЧИТЬ ПО
			|	НоменклатураПометкаУдаления";
			
			Запрос.УстановитьПараметр("ДатаДок", ДатаДокумента);
			Запрос.УстановитьПараметр("ПустаяДата", '00010101');
			
		Иначе
			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	ЕСТЬNULL(ШтрихКоды.Номенклатура, &неопред) КАК Номенклатура,
			|	ЕСТЬNULL(ШтрихКоды.СерияНоменклатуры, &неопред) КАК СерияНоменклатуры,
			|	ЕСТЬNULL(ШтрихКоды.ЕдиницаИзмерения, &неопред) КАК ЕдиницаИзмерения,
			|	ЕСТЬNULL(ШтрихКоды.Номенклатура.ПометкаУдаления, &неопред) КАК НоменклатураПометкаУдаления
			|ИЗ
			|	РегистрСведений.ШтрихКоды КАК ШтрихКоды
			|ГДЕ
			|	(ШтрихКоды.ШтрихКод = &ШтрихКод
			|			ИЛИ ШтрихКоды.ШтрихКод = &ШтрихКодВРЕГ)
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	ЕСТЬNULL(ДополнительныеШтрихКоды.Номенклатура, &неопред),
			|	ЕСТЬNULL(ДополнительныеШтрихКоды.СерияНоменклатуры, &неопред),
			|	ЕСТЬNULL(ДополнительныеШтрихКоды.ЕдиницаИзмерения, &неопред),
			|	ЕСТЬNULL(ДополнительныеШтрихКоды.Номенклатура.ПометкаУдаления, &неопред)
			|ИЗ
			|	РегистрСведений.ДополнительныеШтрихКоды КАК ДополнительныеШтрихКоды
			|ГДЕ
			|	(ДополнительныеШтрихКоды.ШтрихКод = &ШтрихКод
			|			ИЛИ ДополнительныеШтрихКоды.ШтрихКод = &ШтрихКодВРЕГ)
			|
			|УПОРЯДОЧИТЬ ПО
			|	НоменклатураПометкаУдаления";
		КонецЕсли;
		
		Запрос.УстановитьПараметр("неопред", Неопределено);
		
	Иначе			
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|	ШтрихКоды.Номенклатура КАК Номенклатура,
		|	ШтрихКоды.СерияНоменклатуры,
		|	ШтрихКоды.ЕдиницаИзмерения,
		|	ШтрихКоды.Номенклатура.ПометкаУдаления КАК НоменклатураПометкаУдаления
		|ИЗ
		|	РегистрСведений.ШтрихКоды КАК ШтрихКоды
		|ГДЕ
		|	(ШтрихКоды.ШтрихКод = &ШтрихКод
		|			ИЛИ ШтрихКоды.ШтрихКод = &ШтрихКодВРЕГ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НоменклатураПометкаУдаления";
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ШтрихКод", нрег(ШтрихКод));
	Запрос.УстановитьПараметр("ШтрихКодВРЕГ", ВРЕГ(ШтрихКод));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Если ВСтруктуре Тогда
			Номенклатура = Новый Структура;
			Номенклатура.Вставить("Номенклатура", Выборка.Номенклатура);
			Номенклатура.Вставить("СерияНоменклатуры", Выборка.СерияНоменклатуры);
			Номенклатура.Вставить("ЕдиницаИзмерения", Выборка.ЕдиницаИзмерения);
			Номенклатура.Вставить("Количество", 1);
			НоменклатураСтруктура = Истина;
			
		иначе
			Номенклатура = Выборка.Номенклатура;
		КонецЕсли;
		
	Иначе
		
		Если ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ПриИспользованииШтрихКодаЕслиНоменклатураНеНайденаПоШтрихКодуИскатьПоАртикулу") Тогда
			
			//	Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 Номенклатура.Ссылка КАК Номенклатура
			|ИЗ Справочник.Номенклатура КАК Номенклатура
			|ГДЕ (Номенклатура.Артикул = &ОсновнойШтрихКод
			|			ИЛИ Номенклатура.Артикул = &ОсновнойШтрихКодВРЕГ)
			|УПОРЯДОЧИТЬ ПО Номенклатура.ПометкаУдаления"	;
			
			Запрос.УстановитьПараметр("ОсновнойШтрихКод", нрег(ШтрихКод));
			Запрос.УстановитьПараметр("ОсновнойШтрихКодВРЕГ", врег(ШтрихКод));
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				
				Если ВСтруктуре Тогда
					Номенклатура = Новый Структура;
					Номенклатура.Вставить("Номенклатура", Выборка.Номенклатура);
					Номенклатура.Вставить("СерияНоменклатуры", ОбщийМодульПовтор.ЗначениеПредопределенного("Справочники.СерииНоменклатуры.ПустаяСсылка()"));
					Номенклатура.Вставить("ЕдиницаИзмерения", Выборка.ЕдиницаИзмерения);
					Номенклатура.Вставить("Количество", 1);
					НоменклатураСтруктура = Истина;
					
				иначе
					Номенклатура = Выборка.ссылка;	
				КонецЕсли;
				
			Иначе
				//	Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 Номенклатура.Ссылка
				|ИЗ Справочник.Номенклатура КАК Номенклатура
				|ГДЕ Номенклатура.ОсновнойШтрихКод = &ОсновнойШтрихКод
				|	ИЛИ Номенклатура.ОсновнойШтрихКод = &ОсновнойШтрихКодВРЕГ
				|УПОРЯДОЧИТЬ ПО Номенклатура.ПометкаУдаления"	;
				
				Запрос.УстановитьПараметр("ОсновнойШтрихКод", нрег(ШтрихКод));
				Запрос.УстановитьПараметр("ОсновнойШтрихКодВРЕГ", врег(ШтрихКод));
				
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					Номенклатура = Выборка.ссылка;
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Номенклатура = Неопределено Тогда
		
		Если ОбщийМодульПовтор.ПолучитьПараметрСеанса("ВестиУчетПоСериямНоменклатуры")
			И ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ШтрихКодомМожетВыступатьСерияИлиКодПродукта") Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			|	СерииНоменклатуры.Ссылка КАК СерияНоменклатуры,
			|	СерииНоменклатуры.Владелец КАК Номенклатура,
			|	СерииНоменклатуры.ПометкаУдаления КАК ПометкаУдаления
			|ИЗ
			|	Справочник.СерииНоменклатуры КАК СерииНоменклатуры
			|ГДЕ
			|	СерииНоменклатуры.ПометкаУдаления = ЛОЖЬ
			|	И (СерииНоменклатуры.КодПродукта = &ОсновнойШтрихКод
			|			ИЛИ СерииНоменклатуры.Наименование = &ОсновнойШтрихКод
			|			ИЛИ СерииНоменклатуры.КодПродукта = &ОсновнойШтрихКодВРЕГ
			|			ИЛИ СерииНоменклатуры.Наименование = &ОсновнойШтрихКодВРЕГ)
			|
			|УПОРЯДОЧИТЬ ПО
			|	ПометкаУдаления";
			
			Запрос.УстановитьПараметр("ОсновнойШтрихКод", нрег(ШтрихКод));
			Запрос.УстановитьПараметр("ОсновнойШтрихКодВРЕГ", врег(ШтрихКод));
			
			РезультатЗапроса = Запрос.Выполнить();
			если не РезультатЗапроса.Пустой() тогда
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					если ВСтруктуре тогда
						
						Номенклатура = Новый Структура;
						Номенклатура.Вставить("Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
						Номенклатура.Вставить("СерияНоменклатуры", ВыборкаДетальныеЗаписи.СерияНоменклатуры);
						Номенклатура.Вставить("ЕдиницаИзмерения", Выборка.ЕдиницаИзмерения);
						Номенклатура.Вставить("Количество", 1);
						НоменклатураСтруктура = Истина;
						
					иначе
						Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;	
					КонецЕсли;	
				КонецЦикла;				
				
			КонецЕсли;
		конецесли;
		
		Если Номенклатура = Неопределено Тогда
			если ВСтруктуре тогда
				
				Номенклатура = Новый Структура;
				Номенклатура.Вставить("Номенклатура", ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"));
				Номенклатура.Вставить("СерияНоменклатуры", Неопределено);
				Номенклатура.Вставить("ЕдиницаИзмерения", Неопределено);
				Номенклатура.Вставить("Количество", 1);
				НоменклатураСтруктура = Истина;
				
			иначе
				Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
			КонецЕсли;	
		КонецЕсли;
		
		Возврат Номенклатура;	
		
	Иначе
		если ВСтруктуре
			и не НоменклатураСтруктура тогда
			
			НоменклатураВСтруктуре = Новый Структура;
			НоменклатураВСтруктуре.Вставить("Номенклатура", Номенклатура);
			НоменклатураВСтруктуре.Вставить("СерияНоменклатуры", Неопределено);
			НоменклатураВСтруктуре.Вставить("ЕдиницаИзмерения", Неопределено);
			НоменклатураВСтруктуре.Вставить("Количество", 1);
			
			Возврат НоменклатураВСтруктуре;
			
		иначе
			Возврат Номенклатура;	
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

Функция   СвязаннаяНоменклатурнаяГруппа(Знач Родитель)
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 НоменклатурныеГруппы.Ссылка
	|ИЗ Справочник.НоменклатурныеГруппы КАК НоменклатурныеГруппы
	|ГДЕ НоменклатурныеГруппы.СвязатьОдноименнуюГруппуНоменклатуры = ИСТИНА
	|	И НоменклатурныеГруппы.ПометкаУдаления = ЛОЖЬ
	|	И НоменклатурныеГруппы.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", Родитель.Наименование);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();		
		ВыборкаДетальныеЗаписи.Следующий();
		Результат = ВыборкаДетальныеЗаписи.ссылка;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
процедура УстановитьНаименованиеНоменклатурыПоФормуле(Знач НоменклатураОбъект) Экспорт
	
	Если ОбщийМодульПовтор.ПолучитьПараметрСеанса("ВестиУчетНоменклатурыВРазрезеНоменклатурныхГруппПС") Тогда
		
		Если НЕ ЗначениеЗаполнено(НоменклатураОбъект.НоменклатурнаяГруппа)
			и ЗначениеЗаполнено(НоменклатураОбъект.Родитель) Тогда
			
			СвязаннаяНоменклатурнаяГруппа = СвязаннаяНоменклатурнаяГруппа(НоменклатураОбъект.Родитель);
			Если не СвязаннаяНоменклатурнаяГруппа = Неопределено 
				и не НоменклатураОбъект.НоменклатурнаяГруппа = СвязаннаяНоменклатурнаяГруппа Тогда
				
				НоменклатураОбъект.НоменклатурнаяГруппа = СвязаннаяНоменклатурнаяГруппа;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НоменклатураОбъект.НоменклатурнаяГруппа)
			и ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ИспользоватьФормулыАвтоНаименованияФормированияШтрихКодаИТекстаСШтрихКодом")
			и ЗначениеЗаполнено(НоменклатураОбъект.НоменклатурнаяГруппа.ФормулаАвтоНаименованияноменклатурыДаннойГруппы) Тогда
			
			Попытка 
				Номенклатура 	= НоменклатураОбъект;
				Цена 			= 0;
				льготнаяцена 	= 0;
				Формула 		= НоменклатураОбъект.НоменклатурнаяГруппа.ФормулаАвтоНаименованияноменклатурыДаннойГруппы.Формула;
				Формулаврег 	= врег(Формула);
				
				если НЕ найти(Формулаврег, "ЦЕНА") = 0 тогда
					
					ВидЦен = ОбщийМодульПовтор.ЗначениеПредопределенного("Справочники.ВидыЦен.ОсновнойВидЦен");
					//усл не менять
					Если (ТипЗнч(Номенклатура) = Тип("СправочникСсылка.Номенклатура") 
						И ЗначениеЗаполнено(Номенклатура))
						ИЛИ (ТипЗнч(Номенклатура) = Тип("СправочникОбъект.Номенклатура") 
						И ЗначениеЗаполнено(Номенклатура.ссылка)) Тогда
						
						Формулаврег = врег(Формула);
						
						Цена = ОбщийМодульСервер.ПолучитьЦенуНаСервере(Номенклатура, ВидЦен, ОбщийМодульСервисСервер.ПользователяТекущаяДата(), Истина) ;
						Если цена = 0 Тогда
							Цена = ОбщийМодульСервер.ПолучитьЦенуНаСервере(Номенклатура, ВидЦен, ОбщийМодульСервисСервер.ПользователяТекущаяДата(), Истина) ;
						КонецЕсли;
						
					Иначе
						
						Если ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ИспользоватьСложныйМеханизмЦен") Тогда
							попытка
								Цена = ОбщийМодульСервер.ПолучитьЦенуНаСервере(Номенклатура.ссылка, Истина, ОбщийМодульСервисСервер.ПользователяТекущаяДата(), Истина) ;
							Исключение
							КонецПопытки;	
							
						Иначе
							попытка
								Цена = НоменклатураОбъект.Цена;
							Исключение
							КонецПопытки;	
						КонецЕсли;
						
					КонецЕсли; 	
					
					если НЕ найти(Формулаврег, "ЛЬГОТНАЯЦЕНА") = 0 тогда
						льготнаяцена = ОбщийМодульСервер.ПолучитьЛьготнуюЦену(Номенклатура.ссылка, , цена, видцен);
					КонецЕсли;
				КонецЕсли;
				
				НаименованиеНов = "";
				Производитель 	= НоменклатураОбъект.Производитель;
				НоменклатурнаяГруппа = НоменклатураОбъект.НоменклатурнаяГруппа;
				
				Выполнить(" НаименованиеНов = """" + "  + Формула  + ";") ;
				
				Если не НаименованиеНов = НоменклатураОбъект.Наименование тогда
					НоменклатураОбъект.Наименование = НаименованиеНов;
				КонецЕсли;
				
			Исключение 	
				если ОбщийМодульПовторВТеченииСервера.ВыводитьСообщенияМожно() тогда
					ОбщийМодульСервисСервер.ДобавитьСообщениеПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ошибка при попытке авто-наименования номенклатуры:") + ОписаниеОшибки(), , НоменклатураОбъект);
					//сообщить(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ошибка при попытке авто-наименования номенклатуры:") + ОписаниеОшибки());					
				КонецЕсли;
			КонецПопытки;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция   УстановитьШтрихКодНоменклатурыПоФормуле(Знач ОбъектНоменклатура, Знач ФормулаШтрихКода = "", Знач ВидЦен = Неопределено, Знач Дата = Неопределено, Знач Цена = Неопределено, Знач СерияНоменклатуры = "", Знач ЕдиницаИзмерения = Неопределено) экспорт
	
	Если Дата = Неопределено Тогда
		Дата = ОбщийМодульСервисСервер.ПользователяТекущаяДата();
	КонецЕсли;
	
	Если ФормулаШтрихКода = "" Тогда  
		
		Если ЗначениеЗаполнено(ОбъектНоменклатура.Производитель)
			и ЗначениеЗаполнено(ОбъектНоменклатура.Производитель.СвояФормулаШтрихКодаНоменклатуры) Тогда
			
			ФормулаШтрихКода = ОбъектНоменклатура.Производитель.СвояФормулаШтрихКодаНоменклатуры.Формула;
		иначе
			ФормулаШтрихКодаСсылка = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ОсновнаяФормулаШтрихКодаНоменклатуры");
			Если ЗначениеЗаполнено(ФормулаШтрихКодаСсылка) Тогда
				ФормулаШтрихКода = ФормулаШтрихКодаСсылка.Формула;
			КонецЕсли;
		КонецЕсли;		
		
	КонецЕсли;
	
	Результат = "";	
	Если ЗначениеЗаполнено(ФормулаШтрихКода) Тогда
		Попытка 
			Номенклатура = ОбъектНоменклатура;
			Если ВидЦен = Неопределено Тогда
				ВидЦен = ОбщийМодульПовтор.ЗначениеПредопределенного("Справочники.ВидыЦен.ОсновнойВидЦен");
			КонецЕсли;
			
			если Цена = Неопределено тогда
				Цена = ОбщийМодульСервер.ПолучитьЦенуНаСервере(Номенклатура, ВидЦен, Дата, , , , , , , , ЕдиницаИзмерения);		
			КонецЕсли;
			
			НоменклатурнаяГруппа = ОбъектНоменклатура.НоменклатурнаяГруппа;
			Производитель = ОбъектНоменклатура.Производитель;
			
			выполнить(" Результат = """"+" + ФормулаШтрихКода + ";") ;
			
			Если ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ИспользоватьВШтрихКодеТолькоЛатинскиеСимволы") Тогда
				Результат = ПодсистемаИЭИмпортЭкспортФС.ПеревестиСтрокуВЛатинскиеСимволы(Результат, Ложь);
			КонецЕсли;
			
		Исключение 	
			если ОбщийМодульПовторВТеченииСервера.ВыводитьСообщенияМожно() тогда
				ОбщийМодульСервисСервер.ДобавитьСообщениеПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ошибка при авто-формировании Штрих-кода номенклатуры:") + ОписаниеОшибки(), , ОбъектНоменклатура.Ссылка);
				//сообщить(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ошибка при авто-формировании Штрих-кода номенклатуры:") + ОписаниеОшибки());	
			КонецЕсли;
		КонецПопытки; 		           	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция   СоздатьНоменклатуру(Знач ШтрихКод, Знач Производитель, Знач НоменклатурнаяГруппа, Знач Цена, Знач наименование, Знач ВидЦен, Знач Родитель = Неопределено, Знач Серия = "")  Экспорт
	
	ИспользоватьСложныйМеханизмЦен = ОбщийМодульПовтор.ПолучитьПараметрСеанса("ИспользоватьСложныйМеханизмЦенПС");
	
	Если ОбщийМодульПовтор.ПолучитьПараметрСеанса("ВестиУчетНоменклатурыВРазрезеНоменклатурныхГруппПС") тогда
		
		если ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("НоменклатурнаяГруппаОбязательныйРеквизитЛюбойНоменклатуры")
			и НЕ ЗначениеЗаполнено(НоменклатурнаяГруппа) Тогда
			
			если ОбщийМодульПовторВТеченииСервера.ВыводитьСообщенияМожно() тогда
				ОбщийМодульСервисСервер.ДобавитьСообщениеПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Номенклатурная группа обязательный реквизит номенклатуры, но она не указана!"), , );
			КонецЕсли;
			
			Возврат неопределено;	
			
		ИначеЕСли ЗначениеЗаполнено(НоменклатурнаяГруппа) тогда
			
			Если НоменклатурнаяГруппа.СвязатьОдноименнуюГруппуНоменклатуры Тогда
				родитель = Справочники.Номенклатура.НайтиПоНаименованию(НоменклатурнаяГруппа.Наименование) ;
				если не родитель.ЭтоГруппа тогда
					родитель = Неопределено;						
				КонецЕсли;
			КонецЕсли;
			
			если ЗначениеЗаполнено(НоменклатурнаяГруппа.ФормулаАвтоНаименованияНоменклатурыДаннойГруппы)
				и ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ИспользоватьФормулыАвтоНаименованияФормированияШтрихКодаИТекстаСШтрихКодом") Тогда
				
				формула = врег(НоменклатурнаяГруппа.ФормулаАвтоНаименованияНоменклатурыДаннойГруппы.формула);
				
				ошибка = ложь;
				
				Если не найти(формула, "ЦЕНА") = 0 
					и цена = 0 Тогда
					
					если ОбщийМодульПовторВТеченииСервера.ВыводитьСообщенияМожно() тогда
						ОбщийМодульСервисСервер.ДобавитьСообщениеПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("В формуле наименования номенклатуры фигурирует Цена.") + " " + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Но она не заполнена!"), , );
						//Сообщение = Новый СообщениеПользователю;
						//Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("В формуле наименования номенклатуры фигурирует") + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке(" Цена.") + " " + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Но она не заполнена!");
						//Сообщение.Сообщить();                                               	
					КонецЕсли;
					
					ошибка = истина;
					
				КонецЕсли;
				
				Если не найти(формула, "ПРОИЗВОДИТЕЛЬ") = 0 
					и НЕ ЗначениеЗаполнено(Производитель) Тогда
					
					если ОбщийМодульПовторВТеченииСервера.ВыводитьСообщенияМожно() тогда
						ОбщийМодульСервисСервер.ДобавитьСообщениеПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("В формуле наименования номенклатуры фигурирует Производитель.") + " " + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Но он не указан!"));
						//Сообщение = Новый СообщениеПользователю;
						//Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("В формуле наименования номенклатуры фигурирует") + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке(" Производитель.") + " " + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Но он не указан!");
						//Сообщение.Сообщить();                                               	
					КонецЕсли;
					
					ошибка = истина;
					
				КонецЕсли;
				
				Если не найти(формула, "ВИДЦЕН") = 0 
					и НЕ ЗначениеЗаполнено(ВидЦен) Тогда
					
					если ОбщийМодульПовторВТеченииСервера.ВыводитьСообщенияМожно() тогда
						ОбщийМодульСервисСервер.ДобавитьСообщениеПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("В формуле наименования номенклатуры фигурирует Вид Цен.") + " " + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Но он не указан!"));
						//Сообщение = Новый СообщениеПользователю;
						//Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("В формуле наименования номенклатуры фигурирует") + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке(" Вид Цен.") + " " + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Но он не указан!");
						//Сообщение.Сообщить();                                               	
					КонецЕсли;
					
					ошибка = истина;
					
				КонецЕсли;
				
				Если не найти(формула, "ШТРИХКОД") = 0 
					и НЕ ЗначениеЗаполнено(ШтрихКод) Тогда
					
					если ОбщийМодульПовторВТеченииСервера.ВыводитьСообщенияМожно() тогда
						ОбщийМодульСервисСервер.ДобавитьСообщениеПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("В формуле наименования номенклатуры фигурирует Штрих КОд.") + " " + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Но он не указан!"));
						//Сообщение = Новый СообщениеПользователю;
						//Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("В формуле наименования номенклатуры фигурирует") + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке(" Штрих КОд.") + " " + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Но он не указан!");
						//Сообщение.Сообщить();                                               	
					КонецЕсли;
					
					ошибка = истина;
					
				КонецЕсли;
				
				если ошибка тогда
					Возврат неопределено;	
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	НоваНоменклатура = Справочники.Номенклатура.СоздатьЭлемент() ;
	НоваНоменклатура.Наименование 		  = наименование;
	НоваНоменклатура.ОсновнойШтрихКод 	  = ШтрихКод;
	НоваНоменклатура.Производитель 		  = Производитель;
	НоваНоменклатура.НоменклатурнаяГруппа = НоменклатурнаяГруппа;
	
	если не родитель = Неопределено
		и ЗначениеЗаполнено(родитель) тогда
		
		НоваНоменклатура.родитель = родитель;
	КонецЕсли;
	
	Если НЕ ИспользоватьСложныйМеханизмЦен Тогда
		НоваНоменклатура.Цена = Цена;
	КонецЕсли;
	
	НоваНоменклатура.Записать();
	
	если не серия = "" тогда
		
		НоваяСерия = Справочники.СерииНоменклатуры.СоздатьЭлемент() ;
		НоваяСерия.Наименование = серия;
		НоваяСерия.Владелец 	= НоваНоменклатура.Ссылка;
		НоваяСерия.Записать();
		
	КонецЕсли;
	
	Если НЕ Цена = 0 
		и ИспользоватьСложныйМеханизмЦен Тогда	
		
		если ЗначениеЗаполнено(ВидЦен) Тогда
			
			Дата = Началомесяца(ОбщийМодульСервисСервер.ПользователяТекущаяДата()) - 3600 * 24;
			
			Рсмз = РегистрыСведений.Цены.СоздатьМенеджерЗаписи();
			РСМЗ.ВидЦен 	  = ВидЦен;
			РСМЗ.Номенклатура = НоваНоменклатура.Ссылка;
			РСМЗ.Период 	  = Дата;
			РСМЗ.Цена	 	  = Цена;
			РСМЗ.Вручную	  = истина;
			РСМЗ.Комментарий  = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Цена установлена при создании номенклатуры");
			
			Попытка 
				рсмз.Записать(Истина);
				
				СтрокаТовара = Новый Структура;
				СтрокаТовара.Вставить("Номенклатура", НоваНоменклатура.Ссылка);
				СтрокаТовара.Вставить("Цена", Цена);
				ОбщийМодульСервер.УстановитьЦенуИВсеЗависимые(ВидЦен, СтрокаТовара, , , Дата, Истина, , , Ложь);
				
				//на случай наименования по цене
				НоваНоменклатура = НоваНоменклатура.Ссылка.ПолучитьОбъект();
				НоваНоменклатура.записать();
				
			Исключение 	
				если ОбщийМодульПовторВТеченииСервера.ВыводитьСообщенияМожно() тогда
					ОбщийМодульСервисСервер.ДобавитьСообщениеПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Произошла ошибка при установке цены:") + " " + ОписаниеОшибки());
					//Сообщение = Новый СообщениеПользователю;
					//Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Произошла ошибка при установке цены:") + " " + ОписаниеОшибки();
					//Сообщение.Сообщить();                                               	
				КонецЕсли;
				
			КонецПопытки;
			
		иначе
			если ОбщийМодульПовторВТеченииСервера.ВыводитьСообщенияМожно() тогда
				ОбщийМодульСервисСервер.ДобавитьСообщениеПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Не указан Вид цен!"));
				//Сообщение = Новый СообщениеПользователю;
				//Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Не указан Вид цен!");
				//Сообщение.Сообщить();                                               	
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат НоваНоменклатура.ссылка;
	
КонецФункции //СоздатьНоменклатуру

&НаСервере
Процедура ПроверитьИСортироватьТаблицуТовары(ЭтотОбъект, Знач ЭтоПланПродаж = Ложь, Знач ИмяТаблицы = "Товары") Экспорт
	
	Если ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("СортироватьНоменклатуруПоНаименованиюПередЗаписьюДокументов") Тогда
		
		ТОварыДляСортировки = ЭтотОбъект[ИмяТаблицы].Выгрузить();
		
		Если ЭтоПланПродаж Тогда
			ТОварыДляСортировки.Сортировать("НоменклатураИлиГруппа");
			
		ИначеЕсли ОбщийМодульПовтор.ПолучитьПараметрСеанса("ВестиУчетНоменклатурыВРазрезеНоменклатурныхГруппПС")
			И ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("СортироватьНоменклатуруПоНоменклатурнойГруппеПередЗаписьюДокументов") тогда
			
			ТОварыДляСортировки.Колонки.Добавить("НоменклатурнаяГруппа");
			Для Каждого СтрокаТовар из ТОварыДляСортировки Цикл
				Если ЗначениеЗаполнено(СтрокаТовар.Номенклатура) Тогда
					СтрокаТовар.НоменклатурнаяГруппа = СтрокаТовар.Номенклатура.НоменклатурнаяГруппа;
				КонецЕсли;				
			КонецЦикла;
			
			ТОварыДляСортировки.Сортировать("НоменклатурнаяГруппа, Номенклатура");
			
		Иначе
			ТОварыДляСортировки.Сортировать("Номенклатура");
			
		КонецЕсли;		
		
		ЭтотОбъект[ИмяТаблицы].Загрузить(ТОварыДляСортировки);		
	КонецЕсли;   
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьТоварыНаСервере(Знач Ссылка) Экспорт	
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		
		ДокументОбъект = Ссылка.ПолучитьОБъект();
		ДокументОбъект.Товары.Очистить();
		
		Попытка 
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			
		Исключение 	
			если ОбщийМодульПовторВТеченииСервера.ВыводитьСообщенияМожно() тогда
				ОбщийМодульСервисСервер.ДобавитьСообщениеПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Произошла ошибка:") + " " + ОписаниеОшибки(), , Ссылка);
				//Сообщение = Новый СообщениеПользователю;
				//Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Произошла ошибка:") + " " + ОписаниеОшибки();
				//Сообщение.Сообщить();                                               	
			КонецЕсли;
			
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры //ОчиститьТоварыНаСервере

&НаСервере
Процедура ОкруглитьТоВары(Знач Ссылка, Знач Коэффициент, Знач ВидЦенОкруглятьТолькоВБольшуюСторону, Знач НаименованиеТаблицы) Экспорт
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		
		Документссылка = Ссылка.ссылка;
		
		ТипЗнчДокументссылка = ТипЗнч(Документссылка);
		ПеремещенияТовара 	 = ТипЗнчДокументссылка = Тип("ДокументСсылка.ПеремещенияТовара");
		Инвентаризации		 = ТипЗнчДокументссылка = Тип("ДокументСсылка.Инвентаризации");
		ПоступленияТовара 	 = ТипЗнчДокументссылка = Тип("ДокументСсылка.ПоступленияТовара");
		РасходыТовара 		 = ТипЗнчДокументссылка = Тип("ДокументСсылка.РасходыТовара");
		ВыполненияРабот		 = ТипЗнчДокументссылка = Тип("ДокументСсылка.ВыполненияРабот");
		УстановкиЦен 		 = ТипЗнчДокументссылка = Тип("ДокументСсылка.УстановкиЦен");
		Договора 			 = ТипЗнчДокументссылка = Тип("СправочникСсылка.Договора");
		УстановкиЦен 		 = ТипЗнчДокументссылка = Тип("ДокументСсылка.УстановкиЦен");
		КорректировкиИРегистрацияОстатков = ТипЗнчДокументссылка = Тип("ДокументСсылка.КорректировкиИРегистрацияОстатков");
		
		ДокументОбъект = Ссылка.ПолучитьОБъект();
		
		Для Каждого СтрокаТовара Из ДокументОбъект[НаименованиеТаблицы] Цикл			
			
			Цена = СтрокаТовара.Цена;
			
			если не Коэффициент = 0 тогда
				Цена = Цена * (10 * Коэффициент);	
			КонецЕсли;
			ЦенаНов = Окр(Цена);
			
			Если ВидЦенОкруглятьТолькоВБольшуюСторону Тогда
				
				ЦенаЦел = цел(Цена);
				если не ЦенаЦел = Цена тогда
					Цена = ЦенаЦел + 1;
				КонецЕсли;
				
			иначеесли не цена = 0 тогда				
				Цена = окр(Цена);
				
			КонецЕсли;	
			
			если не Коэффициент = 0 тогда
				Цена = Цена / (10 * Коэффициент);	
			КонецЕсли;
			
			СтрокаТовара.Цена = Цена;
			
			Если Врег(НаименованиеТаблицы) = "ТОВАРЫ" Тогда
				Если ВыполненияРабот Тогда 	
					
					Цена = СтрокаТовара.ЦенаПлан;
					
					если не Коэффициент = 0 тогда
						Цена = Цена * (10 * Коэффициент);	
					КонецЕсли;
					ЦенаНов = Окр(Цена);
					
					Если ВидЦенОкруглятьТолькоВБольшуюСторону Тогда
						
						ЦенаЦел = цел(Цена);
						если не ЦенаЦел = Цена тогда
							Цена = ЦенаЦел + 1;
						КонецЕсли;
						
					иначеесли не цена = 0 тогда
						
						Цена = окр(Цена);
						
					КонецЕсли;	
					
					если не Коэффициент = 0 тогда
						Цена = Цена / (10 * Коэффициент);	
					КонецЕсли;
					СтрокаТовара.ЦенаПлан = Цена;
				КонецЕсли;
				
				Если РасходыТовара 
					или ВыполненияРабот Тогда
					
					если ОбщийМодульПовтор.ПолучитьПараметрСеанса("ИспользоватьСкидкиПС") тогда
						СтрокаТовара.ПроцентСкидки = ОбщийМодульСервер.ПолучитьПроцентСкидкиНаСервере(СтрокаТовара.Номенклатура, строкатовара.количество, документссылка.видцен, документссылка.клиентпоставщик);	
					КонецЕсли;
					
					СтрокаТовара.СуммаБезСкидки = СтрокаТовара.Цена * СтрокаТовара.Количество;
					СтрокаТовара.Сумма = СтрокаТовара.СуммаБезСкидки - (СтрокаТовара.СуммаБезСкидки / 100 * СтрокаТовара.ПроцентСкидки);
					
					Если ВыполненияРабот Тогда
						если ОбщийМодульПовтор.ПолучитьПараметрСеанса("ИспользоватьСкидкиПС") тогда
							СтрокаТовара.ПроцентСкидкиПлан = ОбщийМодульСервер.ПолучитьПроцентСкидкиНаСервере(СтрокаТовара.Номенклатура, строкатовара.количество, документссылка.видцен, документссылка.клиентпоставщик);
						КонецЕсли;
						
						СтрокаТовара.СуммаБезСкидкиПлан = СтрокаТовара.ЦенаПлан * СтрокаТовара.КоличествоПлан;
						СтрокаТовара.План = СтрокаТовара.СуммаБезСкидкиПлан - (СтрокаТовара.СуммаБезСкидкиПлан / 100 * СтрокаТовара.ПроцентСкидкиПлан);
					КонецЕсли;
					
				иначеЕсли ПеремещенияТовара 
					или ПоступленияТовара
					или КорректировкиИРегистрацияОстатков Тогда
					
					СтрокаТовара.Сумма = СтрокаТовара.Цена * СтрокаТовара.Количество;
					
				иначеесли Инвентаризации 
					и ОбщийМодульПовтор.ПолучитьПараметрСеанса("ИспользоватьСкидкиПС") тогда
					
					ПроцентСкидки = ОбщийМодульСервер.ПолучитьПроцентСкидкиНаСервере(СтрокаТовара.Номенклатура); //акция ном
					если не процентскидки = 0 
						и не СтрокаТовара.Цена = 0 тогда
						
						СтрокаТовара.Цена  = СтрокаТовара.Цена - (СтрокаТовара.Цена/100 * ПроцентСкидки);
					КонецЕсли;
					
				ИначеЕсли УстановкиЦен Тогда
					
					Если Коэффициент = 0 Тогда
						СтрокаТовара.Цена = ОбщийМодульСервер.РассчитатьНовуюЦену(СтрокаТовара.Номенклатура, СтрокаТовара.СтараяЦена, ДокументСсылка.ВидЦен, ДокументСсылка.Дата);	
					КонецЕсли;
					СтрокаТовара.РазницаЦены = СтрокаТовара.Цена - СтрокаТовара.СтараяЦена; 				
					
				КонецЕсли;			
			КонецЕсли;			
		КонецЦикла;
		
		Попытка 
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			
		Исключение 	
			если ОбщийМодульПовторВТеченииСервера.ВыводитьСообщенияМожно() тогда
				ОбщийМодульСервисСервер.ДобавитьСообщениеПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Произошла ошибка:") + " " + ОписаниеОшибки(), , Ссылка);
				//Сообщение = Новый СообщениеПользователю;
				//Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Произошла ошибка:") + " " + ОписаниеОшибки();
				//Сообщение.Сообщить();                                               	
			КонецЕсли;
			
		КонецПопытки; 		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Функция   ПолучитьСписокНоменклатурыБыстрогоСпроса(Знач ВернутьСписок = истина) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ НоменклатураЧастогоСпроса.Позиция КАК Позиция,
	|	НоменклатураЧастогоСпроса.Номенклатура,
	|	НоменклатураЧастогоСпроса.Комментарий
	|ИЗ РегистрСведений.НоменклатураЧастогоСпроса КАК НоменклатураЧастогоСпроса
	|УПОРЯДОЧИТЬ ПО Позиция";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если ВернутьСписок Тогда
		списокрезультат = Новый СписокЗначений;
		
		если не РезультатЗапроса.Пустой() тогда
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				списокрезультат.Добавить(ВыборкаДетальныеЗаписи.номенклатура);
			КонецЦикла;	
		КонецЕсли;
		
		Возврат списокрезультат;
		
	Иначе
		Возврат РезультатЗапроса;
		
	КонецЕсли;
	
КонецФункции //ПолучитьСписокНоменклатурыБыстрогоСпроса

&НаСервере
Процедура ПересчитатьТоварыНаСервере(Знач Ссылка, Знач Коэффициент = 0, Знач НаименованиеТаблицы, Знач БезДопРасчетов) Экспорт
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		
		Документссылка = Ссылка.ссылка;
		
		ТипЗнчДокументссылка = ТипЗнч(Документссылка);
		ПеремещенияТовара 	 = ТипЗнчДокументссылка = Тип("ДокументСсылка.ПеремещенияТовара");
		Инвентаризации		 = ТипЗнчДокументссылка = Тип("ДокументСсылка.Инвентаризации");
		ПоступленияТовара 	 = ТипЗнчДокументссылка = Тип("ДокументСсылка.ПоступленияТовара");
		РасходыТовара 		 = ТипЗнчДокументссылка = Тип("ДокументСсылка.РасходыТовара");
		ВыполненияРабот		 = ТипЗнчДокументссылка = Тип("ДокументСсылка.ВыполненияРабот");
		УстановкиЦен 		 = ТипЗнчДокументссылка = Тип("ДокументСсылка.УстановкиЦен");
		Договора 			 = ТипЗнчДокументссылка = Тип("СправочникСсылка.Договора");
		УстановкиЦен 		 = ТипЗнчДокументссылка = Тип("ДокументСсылка.УстановкиЦен");
		КорректировкиИРегистрацияОстатков = ТипЗнчДокументссылка = Тип("ДокументСсылка.КорректировкиИРегистрацияОстатков");
		
		ДокументОбъект = Ссылка.ПолучитьОБъект();
		
		Для Каждого СтрокаТовара Из ДокументОбъект[НаименованиеТаблицы] Цикл			
			
			Если Коэффициент = 0 Тогда
				Если ПеремещенияТовара 
					или ПоступленияТовара
					Или РасходыТовара тогда
					
					СтрокаТовара.Цена = ОбщийМодульСервер.ПолучитьЦенуНаСервере(СтрокаТовара.Номенклатура, Документссылка.ВидЦен, Документссылка.Дата, Ложь,  СтрокаТовара.Количество, Документссылка.Договор, , , Ссылка, , СтрокаТовара.ЕдиницаИзмерения);
					
				ИначеЕсли КорректировкиИРегистрацияОстатков Тогда
					
					СтрокаТовара.Цена = ОбщийМодульСервер.ПолучитьЦенуНаСервере(СтрокаТовара.Номенклатура, Документссылка.ВидЦен, Документссылка.Дата, Ложь,  СтрокаТовара.Количество, , , , Ссылка, , СтрокаТовара.ЕдиницаИзмерения);
					
				ИначеЕсли Инвентаризации ТОгда
					
					СтрокаТовара.Цена = ОбщийМодульСервер.ПолучитьЦенуНаСервере(СтрокаТовара.Номенклатура, Документссылка.ВидЦен, Документссылка.Дата, Ложь, , , , , Ссылка);
					
				ИначеЕсли Договора Тогда				
					
					СтрокаТовара.Цена = ОбщийМодульСервер.ПолучитьЦенуНаСервере(СтрокаТовара.Номенклатура, Документссылка.ВидЦен, Документссылка.Дата, Ложь, , , , , Ссылка, , СтрокаТовара.ЕдиницаИзмерения);
					
				ИначеЕсли УстановкиЦен Тогда
					
					СтрокаТовара.СтараяЦена = ОбщийМодульСервер.ПолучитьЦенуНаСервере(СтрокаТовара.Номенклатура, Документссылка.ВидЦен, Документссылка.Дата, , , , , , Ссылка, , СтрокаТовара.ЕдиницаИзмерения);
					
				ИначеЕсли ВыполненияРабот Тогда
					СтрокаТовара.Цена 		= ОбщийМодульСервер.ПолучитьЦенуНаСервере(СтрокаТовара.Номенклатура, Документссылка.ВидЦен, СтрокаТовара.Дата, Ложь,  СтрокаТовара.Количество, Документссылка.Договор, , , Ссылка, , СтрокаТовара.ЕдиницаИзмерения);
					СтрокаТовара.ЦенаПлан 	= ОбщийМодульСервер.ПолучитьЦенуНаСервере(СтрокаТовара.Номенклатура, Документссылка.ВидЦен, СтрокаТовара.ДатаПлан, Ложь,  СтрокаТовара.КоличествоПлан, Документссылка.Договор, , , Ссылка, , СтрокаТовара.ЕдиницаИзмерения);
				КонецЕсли;
				
			иначе
				СтрокаТовара.Цена = СтрокаТовара.Цена * Коэффициент;
				Если ВыполненияРабот Тогда 	
					СтрокаТовара.ЦенаПлан = СтрокаТовара.ЦенаПлан * Коэффициент;
				КонецЕсли;
			КонецЕсли;
			
			Если НЕ БезДопРасчетов Тогда
				
				Если РасходыТовара 
					или ВыполненияРабот Тогда
					
					если ОбщийМодульПовтор.ПолучитьПараметрСеанса("ИспользоватьСкидкиПС") тогда
						СтрокаТовара.ПроцентСкидки = ОбщийМодульСервер.ПолучитьПроцентСкидкиНаСервере(СтрокаТовара.Номенклатура, строкатовара.количество, документссылка.видцен, документссылка.клиентпоставщик);	
					КонецЕсли;
					
					СтрокаТовара.СуммаБезСкидки = СтрокаТовара.Цена * СтрокаТовара.Количество;
					СтрокаТовара.Сумма = СтрокаТовара.СуммаБезСкидки - (СтрокаТовара.СуммаБезСкидки / 100 * СтрокаТовара.ПроцентСкидки);
					
					Если ВыполненияРабот Тогда
						если ОбщийМодульПовтор.ПолучитьПараметрСеанса("ИспользоватьСкидкиПС") тогда
							СтрокаТовара.ПроцентСкидкиПлан = ОбщийМодульСервер.ПолучитьПроцентСкидкиНаСервере(СтрокаТовара.Номенклатура, строкатовара.количество, документссылка.видцен, документссылка.клиентпоставщик);
						КонецЕсли;
						
						СтрокаТовара.СуммаБезСкидкиПлан = СтрокаТовара.ЦенаПлан * СтрокаТовара.КоличествоПлан;
						СтрокаТовара.План = СтрокаТовара.СуммаБезСкидкиПлан - (СтрокаТовара.СуммаБезСкидкиПлан / 100 * СтрокаТовара.ПроцентСкидкиПлан);
					КонецЕсли;
					
				иначеЕсли ПеремещенияТовара 
					или ПоступленияТовара
					или КорректировкиИРегистрацияОстатков Тогда
					
					СтрокаТовара.Сумма = СтрокаТовара.Цена * СтрокаТовара.Количество;
					
				иначеесли Инвентаризации 
					и ОбщийМодульПовтор.ПолучитьПараметрСеанса("ИспользоватьСкидкиПС") тогда
					
					ПроцентСкидки = ОбщийМодульСервер.ПолучитьПроцентСкидкиНаСервере(СтрокаТовара.Номенклатура); //акция ном
					если не процентскидки = 0 
						и не СтрокаТовара.Цена = 0 тогда
						
						СтрокаТовара.Цена  = СтрокаТовара.Цена - (СтрокаТовара.Цена/100 * ПроцентСкидки);
					КонецЕсли;
					
				ИначеЕсли УстановкиЦен Тогда
					
					Если Коэффициент = 0 Тогда
						СтрокаТовара.Цена = ОбщийМодульСервер.РассчитатьНовуюЦену(СтрокаТовара.Номенклатура, СтрокаТовара.СтараяЦена, ДокументСсылка.ВидЦен, ДокументСсылка.Дата);	
					КонецЕсли;
					СтрокаТовара.РазницаЦены = СтрокаТовара.Цена - СтрокаТовара.СтараяЦена; 				
					
				КонецЕсли;				
			КонецЕсли;
		КонецЦикла;
		
		Попытка 
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			
		Исключение 	
			если ОбщийМодульПовторВТеченииСервера.ВыводитьСообщенияМожно() тогда
				ОбщийМодульСервисСервер.ДобавитьСообщениеПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Произошла ошибка:") + " " + ОписаниеОшибки(), , Ссылка);
				//Сообщение = Новый СообщениеПользователю;
				//Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Произошла ошибка:") + " " + ОписаниеОшибки();
				//Сообщение.Сообщить();                                               	
			КонецЕсли;
			
		КонецПопытки; 		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Функция   НапечататьЭтикетку(Знач СтруктураПечати, Знач Таб = Неопределено) Экспорт
	
	ИмяПринтера 			= ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("НаименованиеПринтераШтрихКодов");
	ПечатьНаОбычныйПринтер 	= не ЗначениеЗаполнено(ИмяПринтера);		
	ИспользоватьШтрихКоды	= ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ИспользоватьШтрихКоды") ;
	
	Если Таб = Неопределено Тогда
		Таб = Новый ТабличныйДокумент;	
	КонецЕсли;
	
	ТекстЗаголовка = "";
	Если СтруктураПечати.Свойство("ТекстЗаголовка", ТекстЗаголовка) 
		и ЗначениеЗаполнено(ТекстЗаголовка) Тогда
		
		Макет = Обработки.ПечатьЭтикетки.ПолучитьМакет("МелкаяЭтикетка");
		
		ЭтикеткаОбласть   = Макет.ПолучитьОбласть("Заголовок");
		ЭтикеткаОбласть.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		Таб.Вывести(ЭтикеткаОбласть);
		ОбъектГотов = Истина
		
	Иначе
		ОбъектГотов = ложь;			
	КонецЕсли;				
	
	если ИспользоватьШтрихКоды тогда
		
		ФорматЭтикетки = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ФорматЭтикетки");
		АльтернативныйСпособФормированияШтрихКодаНаЭтикетках = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("АльтернативныйСпособФормированияШтрихКодаНаЭтикетках");
		Если АльтернативныйСпособФормированияШтрихКодаНаЭтикетках Тогда
			
			Макет = обработки.ПечатьШтрихкода.ПолучитьМакет("МакетМелкий");
			
			ЭтикеткаОбласть = Макет.ПолучитьОбласть("Строка|Колонка");
			Рисунок = ЭтикеткаОбласть.Рисунки.ШтрихКод;
			
			Эталон = Обработки.ПечатьШтрихкода.ПолучитьМакет("Эталон");
			КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
			
			ШиринаЭтикетки = Окр(Рисунок.Ширина / КоличествоМиллиметровВПикселе);
			если ФорматЭтикетки = Перечисления.ФорматыЭтикеток.Ширина_3_Высота_1  тогда
				ШиринаЭтикетки = ШиринаЭтикетки / 2 * 3;
			иначеесли ФорматЭтикетки = Перечисления.ФорматыЭтикеток.Ширина_5_Высота_1  тогда
				ШиринаЭтикетки = ШиринаЭтикетки / 2 * 5;
			конецесли;	
			
			ВысотаЭтикетки = Окр(Рисунок.Высота / КоличествоМиллиметровВПикселе);
			
			//ВысотаЭтикетки = ВысотаЭтикетки * 0.25;
			//ШиринаЭтикетки = ШиринаЭтикетки * 0.25;
			
			ПараметрыШтрихкода = Новый Структура;
			ПараметрыШтрихкода.Вставить("Ширина"			, ШиринаЭтикетки);
			ПараметрыШтрихкода.Вставить("Высота"			, ВысотаЭтикетки);
			ПараметрыШтрихкода.Вставить("ТипКода"			, 99);//ПланыВидовХарактеристик.ТипыШтрихКодов.CODE128 );//;ТипШтрихкода);
			ПараметрыШтрихкода.Вставить("ОтображатьТекст"	, Истина);
			ПараметрыШтрихкода.Вставить("РазмерШрифта"		, 9);
			ПараметрыШтрихкода.Вставить("УголПоворота"		, 0);//(УголПоворота));
			ПараметрыШтрихкода.Вставить("Штрихкод"			, СтруктураПечати.ШтрихКод);
			
			Картинка = МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
			
			Рисунок.Картинка = Картинка;
			Таб.Вывести(ЭтикеткаОбласть);
			
			ОбъектГотов = Истина;
			
		Иначе
			//	Попытка
			//КомпонентШК = Новый COMОбъект("V8.Barcod.2");
			//
			//НазваниеШрифта	 = "MS Serif";
			//РазмерШрифта	 = 6;
			//ВесШрифта		 = 400;
			//НаклонныйШрифт	 = Ложь;
			//ЗачёркнутыйШрифт = Ложь;
			//ПодстрочныйШрифт = Ложь;          
			//
			//КомпонентШК.УстановитьШрифт(НазваниеШрифта,
			//РазмерШрифта,
			//ВесШрифта,
			//НаклонныйШрифт,
			//ЗачёркнутыйШрифт,
			//ПодстрочныйШрифт);
			//
			//КомпонентШК = Неопределено;				
			//
			ТекКолонка = 1;
			ТекСтрока  = 1;		
			
			Макет = Обработки.ПечатьЭтикетки.ПолучитьМакет("МелкаяЭтикетка");
			
			Таб.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Мелкая1" + СокрЛП(ИмяКомпьютера());
			
			ВысотаЭтикетки = 17;
			
			если ФорматЭтикетки = Перечисления.ФорматыЭтикеток.Ширина_3_Высота_1  тогда
				ШиринаЭтикетки = 16;
			иначеесли ФорматЭтикетки = Перечисления.ФорматыЭтикеток.Ширина_5_Высота_1  тогда
				ШиринаЭтикетки = 23;
			иначе
				ШиринаЭтикетки = 26;
			конецесли;	
			
			Попытка		
				ЭтикеткаОбласть = Макет.ПолучитьОбласть(1, 1, 4, 2);
				ОбластьШтрихКод = ЭтикеткаОбласть.Области.ОбластьШтрихКод;
				ОбластьЦена     = ЭтикеткаОбласть.Области.Цена;		
				РисунокШтрихКод = ЭтикеткаОбласть.Рисунки.ШтрихКод;             	
				
				ВнешняяКомпонента = ПодключитьВнешнююКомпонентуПечатиШтрихкода();
				РисунокШтрихКод.Картинка = ПолучитьКартинкуШтрихкода(ВнешняяКомпонента, СтруктураПечати.ШтрихКод, 23, 14);
				
				////////РисунокШтрихКод.объект.УстановитьШрифт(НазваниеШрифта,
				////////РазмерШрифта,
				////////ВесШрифта,
				////////НаклонныйШрифт,
				////////ЗачёркнутыйШрифт,
				////////ПодстрочныйШрифт);
				////////
				////////РисунокШтрихКод.Расположить(ОбластьШтрихКод);
				////////
				////////если ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("РазмещениеТекстаСШтрихКодомНаЭтикетке") = Перечисления.ОтносительноеРазмещение.Сверху тогда
				////////	РисунокШтрихКод.Объект.положениеТекста = 1;
				////////иначе
				////////	РисунокШтрихКод.Объект.положениеТекста = 0;			
				////////КонецЕсли;
				////////
				////////РисунокШтрихКод.Объект.ВыравниваниеКода = 2;
				////////РисунокШтрихКод.Объект.ТипКода			= 4;
				////////РисунокШтрихКод.Объект.Сообщение		= СтруктураПечати.ШтрихКод;
				////////
				////////если не СтруктураПечати.ТекстСШтрихКодом = СтруктураПечати.ШтрихКод тогда
				////////	РисунокШтрихКод.Объект.ТекстКода = СтруктураПечати.ТекстСШтрихКодом;                                 	
				////////КонецЕсли;                                   	
				
				ОбластьЦена.ВысотаСтроки = ВысотаЭтикетки;
				//	ЭтикеткаОбласть.Область(2, 2, 2, 2).ШиринаКолонки = ШиринаЭтикетки;
				
				ОбластьЦена.Текст = "";
				Таб.Вывести(ЭтикеткаОбласть);
				РисунокШтрихКод = Неопределено;
				ОбъектГотов = Истина;
				
				если СтрДлина(СтруктураПечати.ТекстСШтрихКодом)>12 Тогда 
					ЭтикеткаОбласть   = Макет.ПолучитьОбласть("С1");
				Иначе 
					ЭтикеткаОбласть   = Макет.ПолучитьОбласть("С");
				КонецЕсли;
				ЭтикеткаОбласть.Параметры.ТекстПодШтрихКодом = СтруктураПечати.ТекстСШтрихКодом;
				Таб.Вывести(ЭтикеткаОбласть);
				//исключение
				//	если ОбщийМодульПовторВТеченииСервера.ВыводитьСообщенияМожно() тогда
				//		ОбщийМодульСервисСервер.ДобавитьСообщениеПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ошибка при обращении к подпрограмме печати Штрих-Кода!") + символы.ПС + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Перезапустите программу и принтер:") + " " + ОписаниеОшибки(), СтатусСообщения.Важное, );	
				//		//Сообщить(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ошибка при обращении к подпрограмме печати Штрих-Кода!") + символы.ПС + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Перезапустите программу и принтер:") + " " + ОписаниеОшибки(), СтатусСообщения.Важное);	
				//	КонецЕсли;
				//	
				//КонецПопытки;
				ТекКолонка = ТекКолонка + 1;				
				
			Исключение
				если ОбщийМодульПовторВТеченииСервера.ВыводитьСообщенияМожно() тогда
					ОбщийМодульСервисСервер.ДобавитьСообщениеПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Компонента 1С:Печать ШтрихКодов не установлена на данном компьютере!"), СтатусСообщения.Важное, );	
					Сообщить(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Компонента 1С:Печать ШтрихКодов не установлена на данном компьютере!"), СтатусСообщения.Важное);	
				КонецЕсли;
			КонецПопытки;	
		КонецЕсли;		
		
	Иначе
		Макет = Обработки.ПечатьЭтикетки.ПолучитьМакет("МелкаяЭтикетка");
		
		ЭтикеткаОбласть   = Макет.ПолучитьОбласть("С");
		ЭтикеткаОбласть.Параметры.ТекстПодШтрихКодом = СтруктураПечати.ТекстСШтрихКодом;
		Таб.Вывести(ЭтикеткаОбласть);
	КонецЕсли;
	
	если ОбъектГотов тогда
		
		таб.РазмерКолонтитулаСверху = 0;
		таб.РазмерКолонтитулаСнизу 	= 0;
		таб.КоличествоЭкземпляров   = СтруктураПечати.Количество;
		таб.ПолеСверху 	= 0;
		таб.ПолеСлева 	= 0;
		таб.ПолеСнизу 	= 0;
		таб.ПолеСправа 	= 0;
		таб.АвтоМасштаб = Истина;
		
		Если ЗначениеЗаполнено(ИмяПринтера) Тогда
			таб.ИмяПринтера = ИмяПринтера;
		КонецЕсли;
		
		//	если не ПечатьНаОбычныйПринтер тогда	
		//	Таб.Напечатать();               	
		//	КонецЕсли;
		
		Макет 			= Неопределено;
	КонецЕсли;
	
	возврат Таб;
	
КонецФункции

&НаСервере
Функция   НаименованиеЭтойНоменклатрнойГруппыНазначается(Знач НоменклатурнаяГруппа) Экспорт	
	Возврат ЗначениеЗаполнено(НоменклатурнаяГруппа)	и ЗначениеЗаполнено(НоменклатурнаяГруппа.ФормулаАвтоНаименованияНоменклатурыДаннойГруппы);	
КонецФункции //НаименованиеЭтойНоменклатрнойГруппыНазначается

Функция   ПроверитьНаличиеСерийНоменклатуры(Знач Ссылка, Знач ИмяТаблицы = "Товары") Экспорт
	
	НаличиеСерийНоменклатуры = Ложь;
	
	Если ОбщийМодульПовтор.ПолучитьПараметрСеанса("ВестиУчетПоСериямНоменклатуры")
		и ЗначениеЗаполнено(ссылка) Тогда
		
		Для Каждого СтрокаТовара Из Ссылка[ИмяТаблицы] Цикл
			Если ОбщийМодульПовтор.ТоварВедетсяПоСериям(СтрокаТовара.Номенклатура) Тогда
				
				НаличиеСерийНоменклатуры = Истина; 			
				Прервать;
				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат НаличиеСерийНоменклатуры;
	
КонецФункции //ПроверитьНаличиеСерийНоменклатуры

Функция   ОбнаружитьЕдиницуНоменклатуры(Знач Номенклатура, Знач Наименование) Экспорт
	
	Если ЗначениеЗаполнено(Наименование) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 ЕдиницыИзмерения.Ссылка
		|ИЗ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
		|ГДЕ ЕдиницыИзмерения.Наименование = &Наименование
		|	И ЕдиницыИзмерения.Владелец = &Номенклатура";
		
		Запрос.УстановитьПараметр("Наименование", Наименование);
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		
		РезультатЗапроса = Запрос.Выполнить();
		если не РезультатЗапроса.Пустой() тогда
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			ВыборкаДетальныеЗаписи.Следующий();
			Возврат ВыборкаДетальныеЗаписи.сылка;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ПредопределенноеЗначение("Справочник.ЕдиницыИзмерения.ПустаяСсылка");
	
КонецФункции //ОбнаружитьЕдиницуНоменклатуры

Функция   ОбнаружитьСериюНоменклатуры(Знач Номенклатура, Знач Наименование, Знач СоздаватьНовую = Ложь) Экспорт
	
	Если ЗначениеЗаполнено(Наименование) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 СерииНоменклатуры.Ссылка
		|ИЗ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
		|ГДЕ СерииНоменклатуры.Наименование = &Наименование
		|	И СерииНоменклатуры.Владелец = &Номенклатура";
		
		Запрос.УстановитьПараметр("Наименование", Наименование);
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		
		РезультатЗапроса = Запрос.Выполнить();
		если не РезультатЗапроса.Пустой() тогда
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			ВыборкаДетальныеЗаписи.Следующий();
			Возврат ВыборкаДетальныеЗаписи.сылка;
			
		КонецЕсли;
		
		Если СоздаватьНовую Тогда
			
			НоваяСерия = Справочники.СерииНоменклатуры.СоздатьЭлемент();
			НоваяСерия.Наименование = Наименование;
			НоваяСерия.Владелец 	= Номенклатура;
			НоваяСерия.Записать();
			
			Возврат НоваяСерия.Ссылка;
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат ПредопределенноеЗначение("Справочник.СерииНоменклатуры.ПустаяСсылка");
	
КонецФункции //ОбнаружитьСериюНоменклатуры

Функция   ПолучитьШтрихКодСерии(Знач СерияНоменклатуры) Экспорт
	
	Результат = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 ШтрихКоды.ШтрихКод
	|ИЗ РегистрСведений.ШтрихКоды КАК ШтрихКоды
	|ГДЕ ШтрихКоды.СерияНоменклатуры = &СерияНоменклатуры";
	
	Запрос.УстановитьПараметр("СерияНоменклатуры", СерияНоменклатуры);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	если не РезультатЗапроса.Пустой() тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ВыборкаДетальныеЗаписи.Следующий();
		Результат = ВыборкаДетальныеЗаписи.ШтрихКод;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции //ПолучитьШтрихКодСерии

Функция   ПолучитьШтрихКодЕдиницыИзмерения(Знач ЕдиницаИзмерения) Экспорт
	
	Результат = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 ШтрихКоды.ШтрихКод
	|ИЗ РегистрСведений.ШтрихКоды КАК ШтрихКоды
	|ГДЕ ШтрихКоды.ЕдиницаИзмерения = &ЕдиницаИзмерения";
	
	Запрос.УстановитьПараметр("ЕдиницаИзмерения", ЕдиницаИзмерения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	если не РезультатЗапроса.Пустой() тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ВыборкаДетальныеЗаписи.Следующий();
		Результат = ВыборкаДетальныеЗаписи.ШтрихКод;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции //ПолучитьШтрихКодСерии

Функция   ПолучитьШтрихКодНоменклатурыСерии(Знач Номенклатура, Знач СерияНоменклатуры, Знач ЕдиницаИзмерения = Неопределено) Экспорт
	
	Результат = "";
	
	Если ЗначениеЗаполнено(СерияНоменклатуры) Тогда
		Результат = ОбщийМодульТоварСервер.ПолучитьШтрихКодСерии(СерияНоменклатуры);
	ИначеЕсли ЗначениеЗаполнено(ЕдиницаИзмерения) Тогда
		Результат = ОбщийМодульТоварСервер.ПолучитьШтрихКодЕдиницыИзмерения(ЕдиницаИзмерения);
	КонецЕсли;
	
	Если Результат = "" Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 ШтрихКоды.ШтрихКод
		|ИЗ РегистрСведений.ШтрихКоды КАК ШтрихКоды
		|ГДЕ ШтрихКоды.Номенклатура = &Номенклатура";
		
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		если не РезультатЗапроса.Пустой() тогда
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			ВыборкаДетальныеЗаписи.Следующий();
			Результат = ВыборкаДетальныеЗаписи.ШтрихКод;
			
		Иначеесли ЗначениеЗаполнено(Номенклатура) Тогда
			Результат = Номенклатура.ОсновнойШтрихКод;
			
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

Процедура ИзменениеКонстантыИспользованияНаборовПередЗаписью(Знач Источник, Отказ) Экспорт
	
	Если НЕ источник.Значение Тогда //отключают наборы
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1 КорректировкиИРегистрацияОстатковТовары.Номенклатура
		|ИЗ Документ.КорректировкиИРегистрацияОстатков.Товары КАК КорректировкиИРегистрацияОстатковТовары
		|ГДЕ КорректировкиИРегистрацияОстатковТовары.Ссылка.Проведен = ИСТИНА
		|	И КорректировкиИРегистрацияОстатковТовары.Номенклатура.ЭтоНабор = ИСТИНА
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ ПЕРВЫЕ 1 ПеремещенияТовараТовары.Номенклатура
		|ИЗ Документ.ПеремещенияТовара.Товары КАК ПеремещенияТовараТовары
		|ГДЕ ПеремещенияТовараТовары.Ссылка.Проведен = ИСТИНА
		|	И ПеремещенияТовараТовары.Номенклатура.ЭтоНабор = ИСТИНА
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ ПЕРВЫЕ 1 ПоступленияТовараТовары.Номенклатура
		|ИЗ	Документ.ПоступленияТовара.Товары КАК ПоступленияТовараТовары
		|ГДЕ ПоступленияТовараТовары.Ссылка.Проведен = ИСТИНА
		|	И ПоступленияТовараТовары.Номенклатура.ЭтоНабор = ИСТИНА
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ ПЕРВЫЕ 1 РасходыТовараТовары.Номенклатура
		|ИЗ Документ.РасходыТовара.Товары КАК РасходыТовараТовары
		|ГДЕ РасходыТовараТовары.Ссылка.Проведен = ИСТИНА
		|	И РасходыТовараТовары.Номенклатура.ЭтоНабор = ИСТИНА";
		
		РезультатЗапроса = Запрос.Выполнить();
		если не РезультатЗапроса.Пустой() тогда
			
			если ОбщийМодульПовторВТеченииСервера.ВыводитьСообщенияМожно() тогда
				ОбщийМодульСервисСервер.ДобавитьСообщениеПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Нет возможности отменить использование Наборов! Они уже участвуют в проведенных документах."), ,);
				//Сообщение = Новый СообщениеПользователю;
				//Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Нет возможности отменить использование Наборов! Они уже участвуют в проведенных документах.");
				//Сообщение.Сообщить();                                               	
			КонецЕсли;
			
			отказ = истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция   НаименованиеГруппыПоПервомуСлову(Знач Наименование, Знач НеСоздавать = Ложь) Экспорт
	
	Наименование = сокрлп(Наименование);
	
	если не Наименование = "" тогда
		
		КонецСлова = найти(Наименование, " ");
		Если КонецСлова = 0 тогда
			КонецСлова = найти(Наименование, ",");
			Если КонецСлова = 0 тогда
				КонецСлова = найти(Наименование, ";");
				Если КонецСлова = 0 тогда
					КонецСлова = найти(Наименование, ".");
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;
		
		если не КонецСлова = 0 тогда
			наименование = лев(наименование, КонецСлова);	        	
		КонецЕсли;
		
		если наименование = "" тогда
			Возврат неопределено;
		иначе
			Возврат ОбщийМодульПовтор.ПолучитьГруппуНоменклатурыПоНаименованию(наименование, НеСоздавать);	
		КонецЕсли;
		
	иначе
		Возврат неопределено;	
	КонецЕсли;
	
КонецФункции //НаименованиеГруппыПоПервомуСлову(Наименование)

Функция   ПолучитьГруппуНоменклатурыПоНаименованию(Знач наименование, НеСоздавать = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 Номенклатура.Ссылка
	|ИЗ Справочник.Номенклатура КАК Номенклатура
	|ГДЕ Номенклатура.Наименование = &Наименование
	|	И Номенклатура.ЭтоГруппа = ИСТИНА";
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	
	РезультатЗапроса = Запрос.Выполнить();
	если не РезультатЗапроса.Пустой() тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ВыборкаДетальныеЗаписи.Следующий();
		результат = ВыборкаДетальныеЗаписи.ссылка;
		
	иначеЕсли НеСоздавать тогда
		результат = Неопределено;
		
	Иначе		
		результатОбъект = Справочники.Номенклатура.СоздатьГруппу() ;
		результатОбъект.Наименование = Наименование;
		результатОбъект.Записать();
		
		результат = результатОбъект.Ссылка;
		
	КонецЕсли;
	
	Возврат результат;
	
КонецФункции //ПолучитьГруппуНоменклатурыПоНаименованию(наименование)

Функция   ПолучитьССылкуНаСкопированныйОбъект(Знач Ссылка) Экспорт
	
	ОбъектКопия = Ссылка.Скопировать();
	ОбъектКопияСсылка = неопределено;
	
	Если ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ИспользоватьШтрихКоды")
		И ((ОбъектКопия.ОсновнойШтрихКод = "" 
		И ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ЗапретитьНоменклатуруБезШтрихКода"))
		иЛИ не ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("НеПроверятьУникальностьШтрихКода")) Тогда
		
		ОбщийМодульСервисСервер.ДобавитьСообщениеПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Отредактируйте Наименование и Штрих-код вручную!"), ,  Ссылка);
		//Сообщение = Новый СообщениеПользователю;
		//Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Отредактируйте Наименование и Штрих-код вручную!");
		//Сообщение.Сообщить();
		
		ОбъектКопия.ОсновнойШтрихКод = ОбъектКопия.ОсновнойШтрихКод + формат(ТекущаяДата(), "ДФ=ЧЧммсс");
	Иначе
		ОбщийМодульСервисСервер.ДобавитьСообщениеПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Отредактируйте Наименование вручную!"), , Ссылка);
		//Сообщение = Новый СообщениеПользователю;
		//Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Отредактируйте Наименование вручную!");
		//Сообщение.Сообщить();
		
	КонецЕсли;
	
	ОбъектКопия.наименование = ОбъектКопия.наименование + " " + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Копия товара с ценами");
	
	Если ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетНоменклатурыВРазрезеНоменклатурныхГрупп")
		И ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("НоменклатурнаяГруппаОбязательныйРеквизитЛюбойНоменклатуры")
		и НЕ ЗначениеЗаполнено(ОбъектКопия.НоменклатурнаяГруппа)Тогда
		
		ОбъектКопия.НоменклатурнаяГруппа = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("НоменклатурнаяГруппаПоУмолчанию");
	КонецЕсли;	
	
	попытка
		НеВыводитьСообщений = параметрысеанса.НеВыводитьСообщений; //без кэша
		параметрысеанса.НеВыводитьСообщений = Истина;
		ОбъектКопия.записать();
		параметрысеанса.НеВыводитьСообщений = НеВыводитьСообщений;
		
		ОбъектКопияСсылка = ОбъектКопия.ссылка;
		
		РсНз = Регистрысведений.Цены.СоздатьНаборЗаписей();
		РсНз.Отбор.Номенклатура.Установить(Ссылка);
		РсНз.Прочитать();
		
		Для Каждого ЗаписьОЦене Из РсНз Цикл
			
			Цены = РегистрыСведений.Цены.СоздатьМенеджерЗаписи();
			Цены.Активность 	= Истина;
			Цены.ВидЦен  		= ЗаписьОЦене.ВидЦен;
			Цены.Вручную		= ЗаписьОЦене.Вручную;
			Цены.Комментарий	= ЗаписьОЦене.Комментарий;
			Цены.Номенклатура	= ОбъектКопияСсылка;
			Цены.Период			= ЗаписьОЦене.Период;
			Цены.Цена 			= ЗаписьОЦене.Цена;
			
			Попытка 
				Цены.Записать(Истина);
				
			Исключение 
				ОбщийМодульСервисСервер.ДобавитьСообщениеПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ошибка при попытке записи в регистр сведений Цены:") + " " + ОписаниеОшибки(), , Ссылка);
				//Сообщение = Новый СообщениеПользователю;
				//Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ошибка при попытке записи в регистр сведений Цены:") + " " + ОписаниеОшибки();
				//Сообщение.Сообщить();
			КонецПопытки; 
		КонецЦикла;
		
		Если ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ПоддерживатьИныеЯзыкиКромеРусского") Тогда
			РсНз = Регистрысведений.ЗначенияНаДругихЯзыках.СоздатьНаборЗаписей();
			РсНз.Отбор.ОбъектБазыДанных.Установить(Ссылка);
			РсНз.Прочитать();
			
			Для Каждого ЗаписьОЯзыке Из РсНз Цикл
				
				Перевод = РегистрыСведений.ЗначенияНаДругихЯзыках.СоздатьМенеджерЗаписи();
				Перевод.Активность 		 = Истина;
				Перевод.НаЯзыке			 = ЗаписьОЯзыке.НаЯзыке;
				Перевод.ОбъектБазыДанных = ОбъектКопияСсылка;
				Перевод.Поле			 = ЗаписьОЯзыке.Поле;
				Перевод.Язык			 = ЗаписьОЯзыке.Язык;
				
				Попытка 
					Перевод.Записать(Истина);
					
				Исключение 
					ОбщийМодульСервисСервер.ДобавитьСообщениеПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ошибка при попытке записи Перевода:") + " " + ОписаниеОшибки(), , Ссылка);
					//Сообщение = Новый СообщениеПользователю;
					//Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ошибка при попытке записи Перевода:") + " " + ОписаниеОшибки();
					//Сообщение.Сообщить();
				КонецПопытки; 
			КонецЦикла;
		КонецЕсли;
		
	исключение
		
		ОбщийМодульСервисСервер.ДобавитьСообщениеПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ошибка при попытке записи копии номенклатуры:") + " " + ОписаниеОшибки(), , Ссылка);
		//Сообщение = Новый СообщениеПользователю;
		//Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ошибка при попытке записи копии номенклатуры:") + " " + ОписаниеОшибки();
		//Сообщение.Сообщить();
	конецпопытки;
	
	Возврат ОбъектКопияСсылка;
	
КонецФункции

Функция   ЭтоНабор(Знач Номенклатура) Экспорт
	Возврат Номенклатура.ЭтоНабор;
КонецФункции //ЭтоНабор

Функция   ПроверитьОтсутствиеСерииВОстатках(Знач Номенклатура, Знач СерияНоменклатуры, Знач Дата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ТоварыОстатки.КоличествоОстаток
	|ИЗ РегистрНакопления.Товары.Остатки(&Дата,
	|			СерияНоменклатуры = &СерияНоменклатуры
	|				И Номенклатура = &Номенклатура) КАК ТоварыОстатки";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("СерияНоменклатуры", СерияНоменклатуры);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	КоличествоОстаток = 0;
	
	РезультатЗапроса = Запрос.Выполнить();
	если не РезультатЗапроса.Пустой() тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			КоличествоОстаток = КоличествоОстаток + ВыборкаДетальныеЗаписи.КоличествоОстаток;
		КонецЦикла;	                            	
	КонецЕсли;
	
	Возврат не КоличествоОстаток = 0;
	
КонецФункции //ПроверитьОтсутствиеСерииВОстатках

Процедура ПечатьГарантийногоТалона(ТабДок, Знач ПараметрыПечати) Экспорт
	
	Ссылка = ПараметрыПечати.Ссылка;
	ПереченьЭлементов  = ПараметрыПечати.ПереченьЭлементов;
	ЭтоВыполненияРабот = Ложь;
	ПараметрыПечати.Свойство("ЭтоВыполненияРабот", ЭтоВыполненияРабот);
	Если ЭтоВыполненияРабот = Неопределено Тогда
		ЭтоВыполненияРабот = Ложь;
	КонецЕсли;
	
	Макет = ПолучитьОбщийМакет("ГарантийныйТалон");
	Запрос = Новый Запрос;
	
	Если ЭтоВыполненияРабот Тогда
		
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВыполненияРабот.Ссылка,
		               |	ВыполненияРабот.Дата,
		               |	ВыполненияРабот.Организация,
		               |	ВыполненияРабот.ВерсияДанных,
		               |	ВыполненияРабот.ПометкаУдаления,
		               |	ВыполненияРабот.Номер,
		               |	ВыполненияРабот.Проведен,
		               |	ВыполненияРабот.Клиент,
		               |	ВыполненияРабот.Договор,
		               |	ВыполненияРабот.ЗаказКлиента,
		               |	ВыполненияРабот.ВидЦен,
		               |	ВыполненияРабот.Результат,
		               |	ВыполненияРабот.ХранилищеДенег,
		               |	ВыполненияРабот.ДатаПлан,
		               |	ВыполненияРабот.РезультатПлан,
		               |	ВыполненияРабот.Актуален,
		               |	ВыполненияРабот.БезПлана,
		               |	ВыполненияРабот.Номенклатура,
		               |	ВыполненияРабот.СерияНоменклатуры,
		               |	ВыполненияРабот.Комментарий,
		               |	ВыполненияРабот.Ответственный,
		               |	ВыполненияРабот.ДатаСоздания,
		               |	ВыполненияРабот.ДатаРедакции,
		               |	ВыполненияРабот.Товары.(
		               |		Ссылка,
		               |		НомерСтроки,
		               |		ДатаПлан,
		               |		Дата,
		               |		Склад,
		               |		Номенклатура КАК СодержаниеВыполненнойРаботы,
		               |		СерияНоменклатуры,
		               |		Сотрудник,
		               |		Количество,
		               |		Цена,
		               |		План,
		               |		Сумма,
		               |		ПроцентСкидки,
		               |		СуммаБезСкидки,
		               |		ВаловаяПрибыль,
		               |		ОСтроке,
		               |		Номенклатура.НеОтслеживатьОстаток КАК НеОтслеживатьОстаток
		               |	),
		               |	ВыполненияРабот.Оплаты.(
		               |		Ссылка,
		               |		НомерСтроки,
		               |		ДатаПлан,
		               |		Дата,
		               |		План,
		               |		Сумма,
		               |		Валюта,
		               |		Курс,
		               |		ХранилищеДенег,
		               |		ФормаОплаты,
		               |		ОСтроке
		               |	),
		               |	ВыполненияРабот.Расходы.(
		               |		Ссылка,
		               |		НомерСтроки,
		               |		ДатаПлан,
		               |		Дата,
		               |		Поставщик,
		               |		Статья,
		               |		План,
		               |		Сумма,
		               |		Валюта,
		               |		Курс,
		               |		ХранилищеДенег,
		               |		ФормаОплаты,
		               |		Договор,
		               |		Сотрудник,
		               |		ОСтроке
		               |	),
		               |	ВыполненияРабот.Номенклатура.Производитель КАК Производитель,
		               |	ВыполненияРабот.Сотрудник,
		               |	ВыполненияРабот.ОбъектКлиента,
		               |	ВыполненияРабот.Валюта,
		               |	ВыполненияРабот.ТипРаботы,
		               |	ВыполненияРабот.ОрганизацияПродавец,
		               |	ВыполненияРабот.ДатаПродажи,
		               |	ВыполненияРабот.Комплектность,
		               |	ВыполненияРабот.ВнешнийВид,
		               |	ВыполненияРабот.ПричинаЦельРабот,
		               |	ВыполненияРабот.ОценочнаяСтоимостьОбъектаРабот
		               |ИЗ
		               |	Документ.ВыполненияРабот КАК ВыполненияРабот
		               |ГДЕ
		               |	ВыполненияРабот.Ссылка = &Ссылка";
		
	Иначе
		Запрос.Текст = "ВЫБРАТЬ
		|	РасходыТовара.Ссылка,
		|	РасходыТовара.Дата,
		|	РасходыТовара.Валюта,
		|	РасходыТовара.Организация,
		|	РасходыТовара.Товары.(
		|		Ссылка,
		|		НомерСтроки,
		|		Номенклатура,
		|		СерияНоменклатуры,
		|		Количество,
		|		Цена,
		|		Сумма,
		|		ПроцентСкидки,
		|		СуммаБезСкидки,
		|		ЗаказКлиента,
		|		ОСтроке,
		|		Номенклатура.НеОтслеживатьОстаток КАК НеОтслеживатьОстаток,
		|		Номенклатура.Производитель КАК Производитель
		|	),
		|	РасходыТовара.ВерсияДанных,
		|	РасходыТовара.ПометкаУдаления,
		|	РасходыТовара.Номер,
		|	РасходыТовара.Проведен,
		|	РасходыТовара.Склад,
		|	РасходыТовара.КлиентПоставщик,
		|	РасходыТовара.ПоступилоДенег,
		|	РасходыТовара.ВидЦен,
		|	РасходыТовара.Курс,
		|	РасходыТовара.Комментарий,
		|	РасходыТовара.ВидДокумента,
		|	РасходыТовара.ТовараНаСумму,
		|	РасходыТовара.ТовараВКоличестве,
		|	РасходыТовара.ПартияПриобретения,
		|	РасходыТовара.Договор,
		|	РасходыТовара.ХранилищеДенег,
		|	РасходыТовара.ЗаказКлиента,
		|	РасходыТовара.ЭтоЗаказ,
		|	РасходыТовара.ЗаказСогласован,
		|	РасходыТовара.ЗаказОплачен,
		|	РасходыТовара.ЗаказДатаПлана,
		|	РасходыТовара.ЗаказДатаФакта,
		|	РасходыТовара.ЗаказНомерПриРегистрации,
		|	РасходыТовара.Сотрудник,
		|	РасходыТовара.Ответственный,
		|	РасходыТовара.ДатаСоздания,
		|	РасходыТовара.ДатаРедакции,
		|	РасходыТовара.ПланОплаты.(
		|		Ссылка,
		|		НомерСтроки,
		|		Дата,
		|		ФормаОплаты,
		|		ХранилищеДенег,
		|		Сумма,
		|		ОСтроке
		|	),
		|	РасходыТовара.Представление,
		|	РасходыТовара.МоментВремени
		|ИЗ
		|	Документ.РасходыТовара КАК РасходыТовара
		|ГДЕ
		|	РасходыТовара.Ссылка = &Ссылка";
		
	КонецЕсли;
	
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОсновнаяВалюта = ОбщийМодульПовтор.ЗначениеПредопределенного("Справочники.Валюты.ОсновнаяВалюта");
	
	ТабДок.Очистить();
	
	СтруктураДополнительныПараметровМакета = ОбщийМодульСервер.ПолучитьСтруктуруДополнительныхПараметровМакетаПечати();
	Если НЕ ОбщийМодульПовтор.ПолучитьПараметрСеанса("ВестиУчетСобственныхЮридическихЛицПС")
		или не ЗначениеЗаполнено(Выборка.Организация) Тогда
		
		ТекстВШапкеДокументовПриПечати = СтруктураДополнительныПараметровМакета.ТекстВШапкеДокументовПриПечати;	
	иначе
		ТекстВШапкеДокументовПриПечати = "";
	КонецЕсли;
	
	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		
		Организация = ?(ЗначениеЗаполнено(Выборка.Организация), Выборка.Организация, ОбщийМодульПовтор.ЗначениеПредопределенного("Справочники.Организации.ОсновноеПредприятие")) ;
		НашЮридическийАдрес = Организация.Адрес;
		НашеОКПО 	= Организация.ОКПО;
		Дата 		= Выборка.Дата;
		Сотрудник 	= Выборка.Сотрудник;
		МассивСтрок = новый Массив;
		
		Если НЕ ЭтоВыполненияРабот Тогда			
			КлиентПоставщик = ОбщийМодульТекстСервер.ПолучитьОбщееНаименование(Выборка.КлиентПоставщик);
			Валюта 			= ?(ЗначениеЗаполнено(Выборка.Валюта), Выборка.Валюта, ОсновнаяВалюта);
			
			ВыборкаТовары 	= Выборка.Товары.Выбрать();
			Пока ВыборкаТовары.Следующий() Цикл
				МассивСтрок.Добавить(ВыборкаТовары);
			КонецЦикла;
			
		Иначе
			КлиентПоставщик = Выборка.Клиент;
			Валюта 			= ОсновнаяВалюта;
			
			ВыборкаТовары = Новый Структура;
			ВыборкаТовары.Вставить("НомерСтроки", 1);
			ВыборкаТовары.Вставить("Номенклатура", Выборка.Номенклатура);
			ВыборкаТовары.Вставить("СерияНоменклатуры", Выборка.СерияНоменклатуры);
			ВыборкаТовары.Вставить("Количество", 1);
			ВыборкаТовары.Вставить("Цена", Выборка.ОценочнаяСтоимостьОбъектаРабот);
			ВыборкаТовары.Вставить("Сумма", Выборка.ОценочнаяСтоимостьОбъектаРабот);
			ВыборкаТовары.Вставить("ПроцентСкидки", 0);
			ВыборкаТовары.Вставить("СуммаБезСкидки", 0);
			ВыборкаТовары.Вставить("ЗаказКлиента", "");
			ВыборкаТовары.Вставить("Остроке", Выборка.Комментарий);
			ВыборкаТовары.Вставить("НеОтслеживатьОстаток", Ложь);
			ВыборкаТовары.Вставить("Производитель", Выборка.Производитель);
			
			МассивСтрок.Добавить(ВыборкаТовары);			
		КонецЕсли;
		
		Для Каждого ВыборкаТовары Из МассивСтрок Цикл
			Если ВставлятьРазделительСтраниц Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			если не ВыборкаТовары.НеОтслеживатьОстаток Тогда
				
				Если ПереченьЭлементов.ПечататьГарантийныйТалон Тогда
					Шапка = Макет.ПолучитьОбласть("Шапка");					
					Шапка.Параметры.Заполнить(ВыборкаТовары);
					
					Шапка.Параметры.ОКПО = НашеОКПО;
					Шапка.Параметры.Дата = Дата;
					Шапка.Параметры.Валюта 		= Валюта;
					Шапка.Параметры.Организация = Организация;
					Шапка.Параметры.НашЮридическийАдрес = НашЮридическийАдрес;
					
					ПолноеНаименование = ОбщийМодульТекстСервер.ПолучитьОбщееНаименование(ВыборкаТовары.Номенклатура);
					Шапка.Параметры.ПолноеНаименование = ПолноеНаименование + ?(ЗначениеЗаполнено(ВыборкаТовары.Номенклатура) и ЗначениеЗаполнено(ВыборкаТовары.Номенклатура.Производитель), " " + ВыборкаТовары.Номенклатура.Производитель, "");
					
					ТабДок.Вывести(Шапка);	
				КонецЕсли;
				
				Если ПереченьЭлементов.ПечататьБлокТалонаОтИсполнителя Тогда
					Шапка = Макет.ПолучитьОбласть("ПриемПоГарантии");		
					Шапка.Параметры.Заполнить(ВыборкаТовары);
					ТабДок.Вывести(Шапка);	
				КонецЕсли;
				
				Если ЭтоВыполненияРабот 
					И ПереченьЭлементов.ПечататьСписокРаботИсполнителя Тогда
					
					Шапка = Макет.ПолучитьОбласть("ШапкаРабот");
					Шапка.Параметры.Заполнить(ВыборкаТовары);
					ТабДок.Вывести(Шапка);	
					ВыборкаРаботы = Выборка.Товары.Выбрать();
					Пока ВыборкаРаботы.Следующий() Цикл
						Строка = Макет.ПолучитьОбласть("СтрокаРабот");		
					КонецЦикла;
				КонецЕсли;
				
				Если ПереченьЭлементов.ПечататьПодвалРаботИсполнителя Тогда
					Шапка = Макет.ПолучитьОбласть("ПодвалРабот");                   	
					Шапка.Параметры.Заполнить(ВыборкаТовары);
					ТабДок.Вывести(Шапка);	
				КонецЕсли;
				
				Если ПереченьЭлементов.ПечататьКвитанцию Тогда
					Шапка = Макет.ПолучитьОбласть("Квитанция");
					Шапка.Параметры.Заполнить(ВыборкаТовары);
					Шапка.Параметры.Организация = ОбщийМодульТекстСервер.ПолучитьОбщееНаименование(Организация);
					Шапка.Параметры.Дата        = Выборка.Дата;
					Шапка.Параметры.Номер       = Выборка.Номер;
					Шапка.Параметры.Сотрудник	= Сотрудник;
					Шапка.Параметры.КлиентПоставщик = КлиентПоставщик;
					Шапка.Параметры.ТекстВШапкеДокументовПриПечати 	 = ТекстВШапкеДокументовПриПечати;
					Шапка.Параметры.ТекстВПодвалеДокументовПриПечати = СтруктураДополнительныПараметровМакета.ТекстВПодвалеДокументовПриПечати;
					ТабДок.Вывести(Шапка);	
				КонецЕсли;
				
				Если ПереченьЭлементов.ПечататьГарантийныйТалонККвитанции Тогда
					Шапка = Макет.ПолучитьОбласть("ГарантийныйТалонККвитанции");
					Шапка.Параметры.Заполнить(ВыборкаТовары);
					Шапка.Параметры.Организация = ОбщийМодульТекстСервер.ПолучитьОбщееНаименование(Организация);
					Шапка.Параметры.Дата        = Выборка.Дата;
					Шапка.Параметры.Номер       = Выборка.Номер;
					Шапка.Параметры.КлиентПоставщик = КлиентПоставщик;
					Шапка.Параметры.Исполнитель		= Сотрудник;
					Шапка.Параметры.ТекстВШапкеДокументовПриПечати   = ТекстВШапкеДокументовПриПечати;
					Шапка.Параметры.ТекстВПодвалеДокументовПриПечати = СтруктураДополнительныПараметровМакета.ТекстВПодвалеДокументовПриПечати;
					ТабДок.Вывести(Шапка);	
				КонецЕсли;
				
				Если ПереченьЭлементов.ПечататьПоложениеОРемонте Тогда
					Шапка = Макет.ПолучитьОбласть("Положение");
					Шапка.Параметры.Заполнить(ВыборкаТовары);
					ТабДок.Вывести(Шапка);	
				КонецЕсли;
				
				ВставлятьРазделительСтраниц = Истина;	
			КонецЕсли;
		КонецЦикла;		
		
		Если ПереченьЭлементов.ПечататьЗаказНаряд Тогда
			
			Если ВставлятьРазделительСтраниц Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			Макет = ПолучитьОбщийМакет("ГарантийныйТалон");
			Шапка = Макет.ПолучитьОбласть("ЗаказНаряд");
			
			Шапка.Параметры.Заполнить(Выборка);
			
			Если ЗначениеЗаполнено(Сотрудник) ТОгда
				Подразделение = ОбщийМодульСервер.ПолучитьПодразделениеСотрудника(Сотрудник, Выборка.Дата);
				
				Шапка.Параметры.АдресПодразделения 	  = Подразделение.Адрес;
				Шапка.Параметры.ТелефоныПодразделения = Подразделение.Телефон;
			КонецЕсли;
			Шапка.Параметры.ОтКого = "";
			
			Если ЗначениеЗаполнено(КлиентПоставщик) Тогда
				Шапка.Параметры.Контрагент 			= КлиентПоставщик;
				Шапка.Параметры.ТелефоныКонтрагента = КлиентПоставщик.Телефон;
				Шапка.Параметры.АдресКонтрагента 	= КлиентПоставщик.Адрес;	
			КонецЕсли;		
			
			Номенклатура = Выборка.Номенклатура;
			Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
				Шапка.Параметры.Номенклатура = Выборка.ОбъектКлиента;
			Иначе
				Шапка.Параметры.Производитель 		 = Номенклатура.Производитель;
				Шапка.Параметры.НоменклатурнаяГруппа = Номенклатура.НоменклатурнаяГруппа;
			КонецЕсли;
			ТабДок.Вывести(Шапка);			
			
			ВставлятьРазделительСтраниц = Истина;
		КонецЕсли;
		
		Если ПереченьЭлементов.ПечататьТехнологическуюКартуРемонта Тогда
			
			Если ВставлятьРазделительСтраниц Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			Макет = ПолучитьОбщийМакет("ГарантийныйТалон");
			Шапка = Макет.ПолучитьОбласть("ТехнологическаяКартаРемонта");
			
			Шапка.Параметры.Заполнить(Выборка);
			
			Если ЗначениеЗаполнено(Сотрудник) ТОгда
				Подразделение = ОбщийМодульСервер.ПолучитьПодразделениеСотрудника(Сотрудник, Выборка.Дата);
				
				Шапка.Параметры.АдресПодразделения 	  = Подразделение.Адрес;
				Шапка.Параметры.ТелефоныПодразделения = Подразделение.Телефон;
			КонецЕсли;
			Шапка.Параметры.ОтКого = "";
			
			Если ЗначениеЗаполнено(КлиентПоставщик) Тогда
				Шапка.Параметры.Контрагент 			= КлиентПоставщик;
				Шапка.Параметры.ТелефоныКонтрагента = КлиентПоставщик.Телефон;
				Шапка.Параметры.АдресКонтрагента 	= КлиентПоставщик.Адрес;	
			КонецЕсли;		
			
			Номенклатура = Выборка.Номенклатура;
			Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
				Шапка.Параметры.Номенклатура = Выборка.ОбъектКлиента;
			Иначе
				Шапка.Параметры.Производитель 		 = Номенклатура.Производитель;
				Шапка.Параметры.НоменклатурнаяГруппа = Номенклатура.НоменклатурнаяГруппа;
			КонецЕсли;
			ТабДок.Вывести(Шапка);			
			
			ВставлятьРазделительСтраниц = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПечатьНалоговойНакладной(Знач ТабДок, Знач ПараметрыПечати) Экспорт
	
	Ссылка = ПараметрыПечати.Ссылка;
	ПереченьЭлементов = ПараметрыПечати.ПереченьЭлементов;
	
	ЭтоВыполненияРабот = Ложь;
	ПараметрыПечати.Свойство("ЭтоВыполненияРабот", ЭтоВыполненияРабот);
	Если ЭтоВыполненияРабот = Неопределено Тогда
		ЭтоВыполненияРабот = Ложь;
	КонецЕсли;
	
	ПечататьКопию = Ложь;
	Если НЕ ПараметрыПечати.Свойство("ПечататьКопию", ПечататьКопию) Тогда
		ПечататьКопию = Ложь;
	КонецЕсли;
	
	ПечататьОригинал = Ложь;
	Если НЕ ПараметрыПечати.Свойство("ПечататьОригинал", ПечататьОригинал) Тогда
		ПечататьОригинал = Ложь;
	КонецЕсли;
	
	Если не ПечататьКопию
		и не ПечататьОригинал Тогда
		
		ПечататьОригинал = Истина;
	КонецЕсли;
	
	ПоследнийНомерНалоговойНакладной = ПереченьЭлементов.ПоследнийНомерНалоговойНакладной;
	
	Макет = ПолучитьОбщийМакет("РегламентированныеДокументы");
	Запрос = Новый Запрос;
	
	Если ЭтоВыполненияРабот Тогда
		
		Запрос.Текст = "ВЫБРАТЬ
		|	ВыполненияРабот.Ссылка,
		|	ВыполненияРабот.Дата,
		|	ВыполненияРабот.Организация,
		|	ВыполненияРабот.ВерсияДанных,
		|	ВыполненияРабот.ПометкаУдаления,
		|	ВыполненияРабот.Номер,
		|	ВыполненияРабот.Проведен,
		|	ВыполненияРабот.Клиент,
		|	ВыполненияРабот.Договор,
		|	ВыполненияРабот.ЗаказКлиента,
		|	ВыполненияРабот.ВидЦен,
		|	ВыполненияРабот.Результат,
		|	ВыполненияРабот.ХранилищеДенег,
		|	ВыполненияРабот.ДатаПлан,
		|	ВыполненияРабот.РезультатПлан,
		|	ВыполненияРабот.Актуален,
		|	ВыполненияРабот.БезПлана,
		|	ВыполненияРабот.Номенклатура,
		|	ВыполненияРабот.СерияНоменклатуры,
		|	ВыполненияРабот.Комментарий,
		|	ВыполненияРабот.Ответственный,
		|	ВыполненияРабот.ДатаСоздания,
		|	ВыполненияРабот.ДатаРедакции,
		|	ВыполненияРабот.Товары.(
		|		Ссылка,
		|		НомерСтроки,
		|		ДатаПлан,
		|		Дата,
		|		Склад,
		|		Номенклатура КАК СодержаниеВыполненнойРаботы,
		|		СерияНоменклатуры,
		|		Сотрудник,
		|		Количество,
		|		Цена,
		|		План,
		|		Сумма,
		|		ПроцентСкидки,
		|		СуммаБезСкидки,
		|		ВаловаяПрибыль,
		|		ОСтроке,
		|		Номенклатура.НеОтслеживатьОстаток КАК НеОтслеживатьОстаток
		|	),
		|	ВыполненияРабот.Оплаты.(
		|		Ссылка,
		|		НомерСтроки,
		|		ДатаПлан,
		|		Дата,
		|		План,
		|		Сумма,
		|		Валюта,
		|		Курс,
		|		ХранилищеДенег,
		|		ФормаОплаты,
		|		ОСтроке
		|	),
		|	ВыполненияРабот.Расходы.(
		|		Ссылка,
		|		НомерСтроки,
		|		ДатаПлан,
		|		Дата,
		|		Поставщик,
		|		Статья,
		|		План,
		|		Сумма,
		|		Валюта,
		|		Курс,
		|		ХранилищеДенег,
		|		ФормаОплаты,
		|		Договор,
		|		Сотрудник,
		|		ОСтроке
		|	),
		|	ВыполненияРабот.Представление,
		|	ВыполненияРабот.МоментВремени,
		|	ВыполненияРабот.Номенклатура.Производитель КАК Производитель
		|ИЗ
		|	Документ.ВыполненияРабот КАК ВыполненияРабот
		|ГДЕ
		|	ВыполненияРабот.Ссылка = &Ссылка";
		
	Иначе
		Запрос.Текст = "ВЫБРАТЬ
		|	РасходыТовара.Ссылка,
		|	РасходыТовара.Дата,
		|	РасходыТовара.Валюта,
		|	РасходыТовара.Организация,
		|	РасходыТовара.Товары.(
		|		Ссылка,
		|		НомерСтроки,
		|		Номенклатура,
		|		СерияНоменклатуры,
		|		Количество,
		|		Цена,
		|		Сумма,
		|		ПроцентСкидки,
		|		СуммаБезСкидки,
		|		ЗаказКлиента,
		|		ОСтроке,
		|		Номенклатура.НеОтслеживатьОстаток КАК НеОтслеживатьОстаток,
		|		Номенклатура.Производитель КАК Производитель
		|	),
		|	РасходыТовара.ВерсияДанных,
		|	РасходыТовара.ПометкаУдаления,
		|	РасходыТовара.Номер,
		|	РасходыТовара.Проведен,
		|	РасходыТовара.Склад,
		|	РасходыТовара.КлиентПоставщик,
		|	РасходыТовара.ПоступилоДенег,
		|	РасходыТовара.ВидЦен,
		|	РасходыТовара.Курс,
		|	РасходыТовара.Комментарий,
		|	РасходыТовара.ВидДокумента,
		|	РасходыТовара.ТовараНаСумму,
		|	РасходыТовара.ТовараВКоличестве,
		|	РасходыТовара.ПартияПриобретения,
		|	РасходыТовара.Договор,
		|	РасходыТовара.ХранилищеДенег,
		|	РасходыТовара.ЗаказКлиента,
		|	РасходыТовара.ЭтоЗаказ,
		|	РасходыТовара.ЗаказСогласован,
		|	РасходыТовара.ЗаказОплачен,
		|	РасходыТовара.ЗаказДатаПлана,
		|	РасходыТовара.ЗаказДатаФакта,
		|	РасходыТовара.ЗаказНомерПриРегистрации,
		|	РасходыТовара.Сотрудник,
		|	РасходыТовара.Ответственный,
		|	РасходыТовара.ДатаСоздания,
		|	РасходыТовара.ДатаРедакции,
		|	РасходыТовара.ПланОплаты.(
		|		Ссылка,
		|		НомерСтроки,
		|		Дата,
		|		ФормаОплаты,
		|		ХранилищеДенег,
		|		Сумма,
		|		ОСтроке
		|	),
		|	РасходыТовара.Представление,
		|	РасходыТовара.МоментВремени
		|ИЗ
		|	Документ.РасходыТовара КАК РасходыТовара
		|ГДЕ
		|	РасходыТовара.Ссылка = &Ссылка";
		
	КонецЕсли;
	
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОсновнаяВалюта = ОбщийМодульПовтор.ЗначениеПредопределенного("Справочники.Валюты.ОсновнаяВалюта");
	
	СтруктураДополнительныПараметровМакета = ОбщийМодульСервер.ПолучитьСтруктуруДополнительныхПараметровМакетаПечати();
	Если НЕ параметрысеанса.ВестиУчетСобственныхЮридическихЛицПС
		или не ЗначениеЗаполнено(Выборка.Организация) Тогда
		
		ТекстВШапкеДокументовПриПечати = СтруктураДополнительныПараметровМакета.ТекстВШапкеДокументовПриПечати;	
	иначе
		ТекстВШапкеДокументовПриПечати = "";
	КонецЕсли;
	
	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		
		Валюта = ?(ЗначениеЗаполнено(Выборка.Валюта), Выборка.Валюта, ОсновнаяВалюта);
		Организация = ?(ЗначениеЗаполнено(Выборка.Организация), Выборка.Организация, ОбщийМодульПовтор.ЗначениеПредопределенного("Справочники.Организации.ОсновноеПредприятие")) ;
		ПредставлениеОрганизации = ОбщийМодульТекстСервер.ПолучитьОбщееНаименование(организация);		
		НашЮридическийАдрес = Организация.Адрес;
		НашеОКПО = Организация.ОКПО;
		Дата = Выборка.Дата;
		
		Макет2014 = Дата >= Дата(2014, 3, 1);
		
		Если НЕ ЭтоВыполненияРабот Тогда
			Сотрудник = Выборка.Сотрудник;
			КлиентПоставщикНаименование = ОбщийМодульТекстСервер.ПолучитьОбщееНаименование(Выборка.КлиентПоставщик);
			КлиентПоставщик = Выборка.КлиентПоставщик;
		Иначе
			КлиентПоставщикНаименование = ОбщийМодульТекстСервер.ПолучитьОбщееНаименование(Выборка.Клиент);
			КлиентПоставщик = Выборка.Клиент;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Сотрудник) Тогда
			Сотрудник = Организация.Сотрудник;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(КлиентПоставщик) Тогда
			КлиентПоставщик = ПредопределенноеЗначение("Справочник.Клиенты.ФизическоеЛицо");
			КлиентПоставщикНаименование = ОбщийМодульТекстСервер.ПолучитьОбщееНаименование(КлиентПоставщик);
		КонецЕсли;
		
		ПараметрыШаблонаПечати = Новый Структура;
		
		ДатаДокумента = Формат(Выборка.Дата, "ДФ=ддММгггг");
		ПараметрыШаблонаПечати.Вставить("Д1", Сред(ДатаДокумента, 1, 1));
		ПараметрыШаблонаПечати.Вставить("Д2", Сред(ДатаДокумента, 2, 1));
		ПараметрыШаблонаПечати.Вставить("Д3", Сред(ДатаДокумента, 3, 1));
		ПараметрыШаблонаПечати.Вставить("Д4", Сред(ДатаДокумента, 4, 1));
		ПараметрыШаблонаПечати.Вставить("Д5", Сред(ДатаДокумента, 5, 1));
		ПараметрыШаблонаПечати.Вставить("Д6", Сред(ДатаДокумента, 6, 1));
		ПараметрыШаблонаПечати.Вставить("Д7", Сред(ДатаДокумента, 7, 1));
		ПараметрыШаблонаПечати.Вставить("Д8", Сред(ДатаДокумента, 8, 1));
		
		Если ПоследнийНомерНалоговойНакладной = 0 Тогда
			НомерДокумента = СокрЛП(Организация.ПоследнийНомерНалоговойНакладной) + 1;
			Попытка
				ОрганизацияОбъект = Организация.ПолучитьОбъект();
				ОрганизацияОбъект.ПоследнийНомерНалоговойНакладной = НомерДокумента;
				ОрганизацияОбъект.Записать();
			Исключение
			КонецПопытки;
		Иначе
			НомерДокумента = ПоследнийНомерНалоговойНакладной;
		КонецЕсли;
		
		НомерДокумента = Прав("       " + НомерДокумента, 7);
		ПараметрыШаблонаПечати.Вставить("Н1", Сред(НомерДокумента, 1, 1));
		ПараметрыШаблонаПечати.Вставить("Н2", Сред(НомерДокумента, 2, 1));
		ПараметрыШаблонаПечати.Вставить("Н3", Сред(НомерДокумента, 3, 1));
		ПараметрыШаблонаПечати.Вставить("Н4", Сред(НомерДокумента, 4, 1));
		ПараметрыШаблонаПечати.Вставить("Н5", Сред(НомерДокумента, 5, 1));
		ПараметрыШаблонаПечати.Вставить("Н6", Сред(НомерДокумента, 6, 1));
		ПараметрыШаблонаПечати.Вставить("Н7", Сред(НомерДокумента, 7, 1));
		
		ПараметрыШаблонаПечати.Вставить("Организация", Организация);
		ПараметрыШаблонаПечати.Вставить("ПредставлениеОрганизации", ПредставлениеОрганизации);
		ПараметрыШаблонаПечати.Вставить("КлиентПоставщик", КлиентПоставщик);
		ПараметрыШаблонаПечати.Вставить("КлиентПоставщикНаименование", КлиентПоставщикНаименование);
		ПараметрыШаблонаПечати.Вставить("КлиентПоставщикНаименование", КлиентПоставщикНаименование);
		
		НомерСвидетельстваПлательщикаНалогаНаДобавочнуюСтоимость = СокрЛП(Организация.НомерСвидетельстваПлательщикаНалогаНаДобавочнуюСтоимость) + "            ";
		ПараметрыШаблонаПечати.Вставить("с1", Сред(НомерСвидетельстваПлательщикаНалогаНаДобавочнуюСтоимость, 1, 1));
		ПараметрыШаблонаПечати.Вставить("с2", Сред(НомерСвидетельстваПлательщикаНалогаНаДобавочнуюСтоимость, 2, 1));
		ПараметрыШаблонаПечати.Вставить("с3", Сред(НомерСвидетельстваПлательщикаНалогаНаДобавочнуюСтоимость, 3, 1));
		ПараметрыШаблонаПечати.Вставить("с4", Сред(НомерСвидетельстваПлательщикаНалогаНаДобавочнуюСтоимость, 4, 1));
		ПараметрыШаблонаПечати.Вставить("с5", Сред(НомерСвидетельстваПлательщикаНалогаНаДобавочнуюСтоимость, 5, 1));
		ПараметрыШаблонаПечати.Вставить("с6", Сред(НомерСвидетельстваПлательщикаНалогаНаДобавочнуюСтоимость, 6, 1));
		ПараметрыШаблонаПечати.Вставить("с7", Сред(НомерСвидетельстваПлательщикаНалогаНаДобавочнуюСтоимость, 7, 1));
		ПараметрыШаблонаПечати.Вставить("с8", Сред(НомерСвидетельстваПлательщикаНалогаНаДобавочнуюСтоимость, 8, 1));
		ПараметрыШаблонаПечати.Вставить("с9", Сред(НомерСвидетельстваПлательщикаНалогаНаДобавочнуюСтоимость, 9, 1));
		
		НомерСвидетельстваПлательщикаНалогаНаДобавочнуюСтоимость = СокрЛП(КлиентПоставщик.НомерСвидетельстваПлательщикаНалогаНаДобавочнуюСтоимость) + "            ";
		ПараметрыШаблонаПечати.Вставить("м1", Сред(НомерСвидетельстваПлательщикаНалогаНаДобавочнуюСтоимость, 1, 1));
		ПараметрыШаблонаПечати.Вставить("м2", Сред(НомерСвидетельстваПлательщикаНалогаНаДобавочнуюСтоимость, 2, 1));
		ПараметрыШаблонаПечати.Вставить("м3", Сред(НомерСвидетельстваПлательщикаНалогаНаДобавочнуюСтоимость, 3, 1));
		ПараметрыШаблонаПечати.Вставить("м4", Сред(НомерСвидетельстваПлательщикаНалогаНаДобавочнуюСтоимость, 4, 1));
		ПараметрыШаблонаПечати.Вставить("м5", Сред(НомерСвидетельстваПлательщикаНалогаНаДобавочнуюСтоимость, 5, 1));
		ПараметрыШаблонаПечати.Вставить("м6", Сред(НомерСвидетельстваПлательщикаНалогаНаДобавочнуюСтоимость, 6, 1));
		ПараметрыШаблонаПечати.Вставить("м7", Сред(НомерСвидетельстваПлательщикаНалогаНаДобавочнуюСтоимость, 7, 1));
		ПараметрыШаблонаПечати.Вставить("м8", Сред(НомерСвидетельстваПлательщикаНалогаНаДобавочнуюСтоимость, 8, 1));
		ПараметрыШаблонаПечати.Вставить("м9", Сред(НомерСвидетельстваПлательщикаНалогаНаДобавочнуюСтоимость, 9, 1));
		
		ОКПО = СокрЛП(Организация.ОКПО) + "            ";
		ПараметрыШаблонаПечати.Вставить("и1", Сред(ОКПО, 1, 1));
		ПараметрыШаблонаПечати.Вставить("и2", Сред(ОКПО, 2, 1));
		ПараметрыШаблонаПечати.Вставить("и3", Сред(ОКПО, 3, 1));
		ПараметрыШаблонаПечати.Вставить("и4", Сред(ОКПО, 4, 1));
		ПараметрыШаблонаПечати.Вставить("и5", Сред(ОКПО, 5, 1));
		ПараметрыШаблонаПечати.Вставить("и6", Сред(ОКПО, 6, 1));
		ПараметрыШаблонаПечати.Вставить("и7", Сред(ОКПО, 7, 1));
		ПараметрыШаблонаПечати.Вставить("и8", Сред(ОКПО, 8, 1));
		ПараметрыШаблонаПечати.Вставить("и9", Сред(ОКПО, 9, 1));
		ПараметрыШаблонаПечати.Вставить("и10", Сред(ОКПО, 10, 1));
		ПараметрыШаблонаПечати.Вставить("и11", Сред(ОКПО, 11, 1));
		ПараметрыШаблонаПечати.Вставить("и12", Сред(ОКПО, 12, 1));
		
		ОКПО = СокрЛП(КлиентПоставщик.ОКПО) + "            ";
		ПараметрыШаблонаПечати.Вставить("к1", Сред(ОКПО, 1, 1));
		ПараметрыШаблонаПечати.Вставить("к2", Сред(ОКПО, 2, 1));
		ПараметрыШаблонаПечати.Вставить("к3", Сред(ОКПО, 3, 1));
		ПараметрыШаблонаПечати.Вставить("к4", Сред(ОКПО, 4, 1));
		ПараметрыШаблонаПечати.Вставить("к5", Сред(ОКПО, 5, 1));
		ПараметрыШаблонаПечати.Вставить("к6", Сред(ОКПО, 6, 1));
		ПараметрыШаблонаПечати.Вставить("к7", Сред(ОКПО, 7, 1));
		ПараметрыШаблонаПечати.Вставить("к8", Сред(ОКПО, 8, 1));
		ПараметрыШаблонаПечати.Вставить("к9", Сред(ОКПО, 9, 1));
		ПараметрыШаблонаПечати.Вставить("к10", Сред(ОКПО, 10, 1));
		ПараметрыШаблонаПечати.Вставить("к11", Сред(ОКПО, 11, 1));
		ПараметрыШаблонаПечати.Вставить("к12", Сред(ОКПО, 12, 1));
		
		ПараметрыШаблонаПечати.Вставить("ОрганизацияАдрес", Организация.Адрес);
		ПараметрыШаблонаПечати.Вставить("КлиентПоставщикАдрес", КлиентПоставщик.Адрес);
		
		Телефон = СокрЛП(Организация.Телефон) + "          ";
		Телефон = ПодсистемаИЭИмпортЭкспортФС.УбратьНечисловыеСимволы(Телефон, "", ложь);
		ПараметрыШаблонаПечати.Вставить("т1", Сред(Телефон, 1, 1));
		ПараметрыШаблонаПечати.Вставить("т2", Сред(Телефон, 2, 1));
		ПараметрыШаблонаПечати.Вставить("т3", Сред(Телефон, 3, 1));
		ПараметрыШаблонаПечати.Вставить("т4", Сред(Телефон, 4, 1));
		ПараметрыШаблонаПечати.Вставить("т5", Сред(Телефон, 5, 1));
		ПараметрыШаблонаПечати.Вставить("т6", Сред(Телефон, 6, 1));
		ПараметрыШаблонаПечати.Вставить("т7", Сред(Телефон, 7, 1));
		ПараметрыШаблонаПечати.Вставить("т8", Сред(Телефон, 8, 1));
		ПараметрыШаблонаПечати.Вставить("т9", Сред(Телефон, 9, 1));
		ПараметрыШаблонаПечати.Вставить("т10", Сред(Телефон, 10, 1));
		
		Телефон = СокрЛП(КлиентПоставщик.Телефон) + "          ";
		Телефон = ПодсистемаИЭИмпортЭкспортФС.УбратьНечисловыеСимволы(Телефон, "", ложь);
		ПараметрыШаблонаПечати.Вставить("ь1", Сред(Телефон, 1, 1));
		ПараметрыШаблонаПечати.Вставить("ь2", Сред(Телефон, 2, 1));
		ПараметрыШаблонаПечати.Вставить("ь3", Сред(Телефон, 3, 1));
		ПараметрыШаблонаПечати.Вставить("ь4", Сред(Телефон, 4, 1));
		ПараметрыШаблонаПечати.Вставить("ь5", Сред(Телефон, 5, 1));
		ПараметрыШаблонаПечати.Вставить("ь6", Сред(Телефон, 6, 1));
		ПараметрыШаблонаПечати.Вставить("ь7", Сред(Телефон, 7, 1));
		ПараметрыШаблонаПечати.Вставить("ь8", Сред(Телефон, 8, 1));
		ПараметрыШаблонаПечати.Вставить("ь9", Сред(Телефон, 9, 1));
		ПараметрыШаблонаПечати.Вставить("ь10", Сред(Телефон, 10, 1));
		
		Договор = Выборка.Договор;
		Если ЗначениеЗаполнено(Договор) Тогда
			ПараметрыШаблонаПечати.Вставить("Договор", Договор);
			
			ДатаЗаключения = Формат(Договор.ДатаЗаключения, "ДФ=ддММгггг");
			ПараметрыШаблонаПечати.Вставить("ДД1", Сред(ДатаЗаключения, 1, 1));
			ПараметрыШаблонаПечати.Вставить("ДД2", Сред(ДатаЗаключения, 2, 1));
			ПараметрыШаблонаПечати.Вставить("ДД3", Сред(ДатаЗаключения, 3, 1));
			ПараметрыШаблонаПечати.Вставить("ДД4", Сред(ДатаЗаключения, 4, 1));
			ПараметрыШаблонаПечати.Вставить("ДД5", Сред(ДатаЗаключения, 5, 1));
			ПараметрыШаблонаПечати.Вставить("ДД6", Сред(ДатаЗаключения, 6, 1));
			ПараметрыШаблонаПечати.Вставить("ДД7", Сред(ДатаЗаключения, 7, 1));
			ПараметрыШаблонаПечати.Вставить("ДД8", Сред(ДатаЗаключения, 8, 1));
			
			ПараметрыШаблонаПечати.Вставить("НомерДоговора", Договор.НомерДоговора);
			ПараметрыШаблонаПечати.Вставить("ФормаВзаиморасчетов", Договор.ФормаВзаиморасчетов);
			
		Иначе
			ПараметрыШаблонаПечати.Вставить("ФормаВзаиморасчетов", Организация.ФормаВзаиморасчетовПоУмолчанию);
		КонецЕсли;	
		
		НалНакл = Новый ТабличныйДокумент;
		НалНакл.КлючПараметровПечати = "НАЛ_НАКЛ_УКР";
		
		Шапка = Макет.ПолучитьОбласть("Пробел");	
		НалНакл.Вывести(Шапка);		
		
		Шапка = ?(Макет2014, Макет.ПолучитьОбласть("Заголовок14"), Макет.ПолучитьОбласть("Заголовок"));	
		Шапка.Параметры.Заполнить(ПараметрыШаблонаПечати);
		НалНакл.Вывести(Шапка);		
		
		Шапка = ?(Макет2014, Макет.ПолучитьОбласть("Шапка14"), Макет.ПолучитьОбласть("Шапка"));	
		НалНакл.Вывести(Шапка);		
		
		НДС   = 0;
		Всего = 0;
		ВсегоСНДС = 0;
		
		ВыборкаТовары = Выборка.Товары.Выбрать();
		Пока ВыборкаТовары.Следующий() Цикл
			
			Номенклатура = ВыборкаТовары.Номенклатура;
			Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
				Номенклатура = Справочники.Номенклатура.ТоварНаСумму ;
			КонецЕсли;
			Шапка = Макет.ПолучитьОбласть("РазделI");
			Шапка.Параметры.Дата = Выборка.Дата;
			Шапка.Параметры.Номенклатура = Номенклатура;
			Шапка.Параметры.НоменклатураПолноеНаименование = ОбщийМодульТекстСервер.ПолучитьОбщееНаименование(Номенклатура);
			Шапка.Параметры.КодУКТВЭД = Номенклатура.КодУКТВЭД;
			
			если не ВыборкаТовары.НеОтслеживатьОстаток Тогда
				Шапка.Параметры.ЕдИзм = "шт.";
			Иначе
				Шапка.Параметры.ЕдИзм = "послуга";
			КонецЕсли;
			Количество = ?(ВыборкаТовары.Количество = 0, 1, ВыборкаТовары.Количество);
			Шапка.Параметры.Количество = Количество;
			Сумма = ВыборкаТовары.Сумма;
			ВсегоСНДС = ВсегоСНДС + Сумма;
			СтавкаНДС = ?(ЗначениеЗаполнено(Номенклатура.СтавкаНДС), Номенклатура.СтавкаНДС, Организация.СтавкаНДС);
			СуммаБезНДС = Сумма - Сумма * (СтавкаНДС / 100);
			НДС = НДС + (Сумма - СуммаБезНДС);
			Шапка.Параметры.СуммаБезНДС = СуммаБезНДС;
			Шапка.Параметры.ЦенаБезНДС  = СуммаБезНДС / Количество;
			Всего = Всего + СуммаБезНДС;
			
			НалНакл.Вывести(Шапка);	
			
		КонецЦикла;
		
		Шапка = Макет.ПолучитьОбласть("ИтогРазделI");
		Шапка.Параметры.Всего = Всего;
		НалНакл.Вывести(Шапка);	
		
		Шапка = Макет.ПолучитьОбласть("ВозврТара");
		НалНакл.Вывести(Шапка);	
		
		Шапка = Макет.ПолучитьОбласть("итоги");
		Шапка.Параметры.НДС = НДС;
		Шапка.Параметры.ВсегоСНДС = ВсегоСНДС;
		НалНакл.Вывести(Шапка);	
		
		Шапка = ?(Макет2014, Макет.ПолучитьОбласть("Подвал14"), Макет.ПолучитьОбласть("Подвал"));	
		Шапка.Параметры.Сотрудник = Сотрудник;
		НалНакл.Вывести(Шапка);	
		
		Если ПечататьОригинал Тогда
			Шапка = ?(Макет2014, Макет.ПолучитьОбласть("Оригинал14"), Макет.ПолучитьОбласть("Оригинал"));	
			ТабДок.Вывести(Шапка);		
			
			ТабДок.Вывести(НалНакл);
			
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		Если ПечататьКопию Тогда
			Шапка = ?(Макет2014, Макет.ПолучитьОбласть("ПерваяКопия14"), Макет.ПолучитьОбласть("ПерваяКопия"));	
			ТабДок.Вывести(Шапка);		
			
			ТабДок.Вывести(НалНакл);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция   ОбнаружитьСпецификациюНоменклатуры(Знач Номенклатура, Знач Дата = Неопределено) Экспорт
	
	Если Дата = Неопределено Тогда
		Дата = ОбщийМодульСервисСервер.ПользователяТекущаяДата();
	КонецЕсли;
	
	Результат = ПредопределенноеЗначение("Справочник.Спецификации.ПустаяСсылка");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	СпецификацииТовары.Ссылка
	|ИЗ Справочник.Спецификации.Товары КАК СпецификацииТовары
	|ГДЕ СпецификацииТовары.Номенклатура = &Номенклатура
	|	И СпецификацииТовары.Ссылка.НеАктуальна = ЛОЖЬ
	|	И СпецификацииТовары.Ссылка.Дата <= &Дата
	|УПОРЯДОЧИТЬ ПО
	|	СпецификацииТовары.Ссылка.Дата УБЫВ,
	|	СпецификацииТовары.Ссылка.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Результат = ВыборкаДетальныеЗаписи.Ссылка;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция   НайтиНоменклатуруПоАртикулу(Знач Артикул, Знач ТочноеСоотвествие = Ложь) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 Номенклатура.Ссылка
	|ИЗ Справочник.Номенклатура КАК Номенклатура
	|ГДЕ Номенклатура.Артикул " + ?(ТочноеСоотвествие, " = ", " ПОДОБНО ") + "&Артикул";
	
	Запрос.УстановитьПараметр("Артикул", Артикул);
	
	РезультатЗапроса = Запрос.Выполнить();
	если не результатзапроса.Пустой() тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ВыборкаДетальныеЗаписи.Следующий();
		Возврат ВыборкаДетальныеЗаписи.ссылка;
		
	иначе
		Возврат неопределено;
	КонецЕсли;
	
КонецФункции //

Функция   ПолучитьКартинкуШтрихкода(ВнешняяКомпонента, Штрихкод, Ширина, Высота) Экспорт
	
	// Зададим размер картинки
	ВнешняяКомпонента.Ширина =250;
	ВнешняяКомпонента.Высота =90;
	
	// Разрешим компоненте самой определять тип кода
	ВнешняяКомпонента.АвтоТип = Ложь;
	ВнешняяКомпонента.ТипКода = 4;
	ВнешняяКомпонента.ОтображатьТекст = Ложь;
	
	
	// Если код содержит контрольный символ, обязательно указываем
	ВнешняяКомпонента.СодержитКС = СтрДлина(Штрихкод) = 13;
	
	// Если отображать контрольный символ не нужно
	// ВнешняяКомпонента.ВидимостьКС = Ложь;
	
	// Формируем картинку штрихкода
	ВнешняяКомпонента.ЗначениеКода = Штрихкод;
	// Если установленная нами ширина меньше минимально допустимой для этого штрихкода
	Если ВнешняяКомпонента.Ширина < ВнешняяКомпонента.МинимальнаяШиринаКода Тогда
		// Скорректируем ширину
		ВнешняяКомпонента.Ширина = ВнешняяКомпонента.МинимальнаяШиринаКода+10;
	КонецЕсли;
	
	// Сформируем картинку
	ДвоичныеДанныеКартинки = ВнешняяКомпонента.ПолучитьШтрихкод();
	
	// Если картинка сформировалась
	Если ДвоичныеДанныеКартинки <> Неопределено Тогда
		// Формируем из двоичных данных
		Возврат Новый Картинка(ДвоичныеДанныеКартинки);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция   ПодключитьВнешнююКомпонентуПечатиШтрихкода() Экспорт
	
	// В зависимости от типа платформы подключим соответствующую внешнюю компоненту
	СистемнаяИнформация = Новый СистемнаяИнформация;
	
	Если СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86 Тогда
		ПодключениеВыполнено = ПодключитьВнешнююКомпоненту("Обработка.ПечатьЭтикетокИЦенников.Макет.КомпонентаПечатиШтрихкодовWindows32", "КартинкаШтрихкода", ТипВнешнейКомпоненты.Native);
		
	ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда
		ПодключениеВыполнено = ПодключитьВнешнююКомпоненту("Обработка.ПечатьЭтикетокИЦенников.Макет.КомпонентаПечатиШтрихкодовWindows64", "КартинкаШтрихкода", ТипВнешнейКомпоненты.Native);
		
	ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86 Тогда
		ПодключениеВыполнено = ПодключитьВнешнююКомпоненту("Обработка.ПечатьЭтикетокИЦенников.Макет.КомпонентаПечатиШтрихкодовLinux32", "КартинкаШтрихкода", ТипВнешнейКомпоненты.Native);
		
	Иначе
		ПодключениеВыполнено = ПодключитьВнешнююКомпоненту("Обработка.ПечатьЭтикетокИЦенников.Макет.КомпонентаПечатиШтрихкодовLinux64", "КартинкаШтрихкода", ТипВнешнейКомпоненты.Native);
		
	КонецЕсли;                                                   
	
	// Создадим объект внешней компоненты
	Если ПодключениеВыполнено Тогда
		ВнешняяКомпонента = Новый("AddIn.КартинкаШтрихкода.Barcode");
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	// Если нет возможности рисовать
	Если НЕ ВнешняяКомпонента.ГрафикаУстановлена Тогда
		// То картинку сформировать не сможем
		Возврат Неопределено;
	Иначе
		
		// Установим основные параметры компоненты
		
		// Если в системе установлен шрифт Tahoma
		Если ВнешняяКомпонента.НайтиШрифт("Tahoma") = Истина Тогда
			// Выбираем его как шрифт для формирования картинки
			
			ВнешняяКомпонента.Шрифт = "Tahoma";
		Иначе
			
			// Шрифт Tahoma в системе отсутствует
			// Обойдем все доступные компоненте шрифты
			Для Сч = 0 По ВнешняяКомпонента.КоличествоШрифтов -1 Цикл
				// Получим очередной шрифт, доступный компоненте
				ТекущийШрифт = ВнешняяКомпонента.ШрифтПоИндексу(Сч);
				// Если шрифт доступен
				Если ТекущийШрифт <> Неопределено Тогда
					// Они и будет шрифтом для формирования штри-кода
					ВнешняяКомпонента.Шрифт = ТекущийШрифт;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		// Утановим размер шрифта
		ВнешняяКомпонента.РазмерШрифта = 14;
		
		Возврат ВнешняяКомпонента;
		
	КонецЕсли;
	
КонецФункции
