//sza140411-1606 : 
//sza101109-1811       
//sza101025

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("002700", , , );	
	
	Если НЕ ОТказ ТОгда
		ОбщийМодульКлиент.ДобавитьСобытиеЖурнала(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Выгрузил таблицу Документа в файл"), 2, ПараметрКоманды);
		ПодсистемаИЭИмпортЭкспортФСКлиент.ИмпортЭкспортОбработкаОбмена(
		ПодсистемаИЭИмпортЭкспортФСКлиент.СоздатьСтруктуруВызоваИмпЭкспОперации(ПараметрКоманды,, Истина,, "К")
		); //Экспорт  (Истина) /Импорт (ложь, К/С/З - карточка, список, Товары 
	
	КонецЕсли;	
	
КонецПроцедуры
