// sza131119-2322
// sza131003-1910 :
// sza101116-0110
// sza101115-1718

&НаКлиенте
Процедура ВыбратьТабличнуюЧасть(Команда)
	ЭтаФорма.Закрыть(Элементы.ИмяТабличнойЧасти);
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьИЗакрыть(Команда)

	ИмяТабличнойЧасти = "";
	ЭтаФорма.Закрыть(Элементы.ИмяТабличнойЧасти);

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()

	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)                                          // ПРИ ОТКРЫТИИ

	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);

	Если Элементы.ИмяТабличнойЧасти.СписокВыбора.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Таблиц у объекта нет!"));
		Отказ = ИСТИНА;
	ИначеЕсли Элементы.ИмяТабличнойЧасти.СписокВыбора.Количество() = 1 Тогда
		ЭтаФорма.ИмяТабличнойЧасти = Элементы.ИмяТабличнойЧасти.СписокВыбора.Получить(0);
		ОбщегоНазначения.СообщитьПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Таблица только одна -")+ЭтаФорма.ИмяТабличнойЧасти);
		Отказ = ИСТИНА
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)          // ПРИ СОЗДАНИИ НА СЕРВЕРЕ

		Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьСобственныйПереводЭлементовИнтерфейса") Тогда
			ОбщийМодульСервер.ПеревестиРеквизитыФормы(ЭтаФорма);
		КонецЕсли;

	Элементы.ИмяТабличнойЧасти.СписокВыбора.Очистить();
	Попытка
	Для Каждого ТипОбъекта Из Метаданные[Параметры.ТипМета][Параметры.ТипОбъектаОбмена].ТабличныеЧасти Цикл
		Элементы.ИмяТабличнойЧасти.СписокВыбора.Добавить(ТипОбъекта.Имя, ТипОбъекта.Синоним);

	КонецЦикла;

	Исключение
	КонецПопытки;

	ОбщийМодульСервисСервер.ОбработатьНовуюФорму(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура РеакцияНаПрочиеСобытияФормы(КомандаСобытияФормы) Экспорт // Для реакции на события для запрограммированных элементов
	ОбщийМодульКлиент.РеакцияНаПрочиеСобытияФормы(КомандаСобытияФормы, ЭтаФорма);
КонецПроцедуры
