// Суров С.В <s_surov@mail.ru>

// // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // 
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;

	РежимВыгрузки = 0;
	Если Параметры.Свойство("РежимВыгрузки") Тогда
		РежимВыгрузки = Параметры.РежимВыгрузки;
	КонецЕсли;
	
	НастройкиКомпоновки = Неопределено;
	
	Если ЭтоАдресВременногоХранилища(Параметры.АдресНастроекКомпоновки) Тогда
		
		НастройкиКомпоновки = ПолучитьИзВременногоХранилища(Параметры.АдресНастроекКомпоновки);
		
	КонецЕсли;
	
	ИнициализироватьКомпоновщикСервер(НастройкиКомпоновки);
	
КонецПроцедуры

// // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // 
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

&НаКлиенте
Процедура ЗавершитьРедактирование(Команда)
	
	Закрыть(ПолучитьНастройкиКомпоновкиСервер());
	
КонецПроцедуры

// // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // 
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ИнициализироватьКомпоновщикСервер(НастройкиКомпоновки)
	
	Если РежимВыгрузки = 0 Тогда
		
		СхемаВыгрузкиДанных = ПланыОбмена.ОбменССайтом.ПолучитьМакет("СхемаВыгрузкиКаталогПакетПредложений");
		
	ИначеЕсли РежимВыгрузки = 1 Тогда
	
		СхемаВыгрузкиДанных = ПланыОбмена.ОбменССайтом.ПолучитьМакет("СхемаВыгрузкиКаталог");
		
	ИначеЕсли РежимВыгрузки = 2 Тогда
		
		СхемаВыгрузкиДанных = ПланыОбмена.ОбменССайтом.ПолучитьМакет("СхемаВыгрузкиПакетПредложений");
		
	ИначеЕсли РежимВыгрузки = 3 Тогда
		
		СхемаВыгрузкиДанных = ПланыОбмена.ОбменССайтом.ПолучитьМакет("СхемаВыгрузкиОбновлениеПакетаПредложений");
		
	КонецЕсли;
	
	ДобавитьПереопределяемыеПоля(СхемаВыгрузкиДанных);
	
	УдалитьНеАктуальныеПоляОтбора(СхемаВыгрузкиДанных);
	
	УстановитьТипыЗначенияСсылочныхПолей(СхемаВыгрузкиДанных);
	
	АдресСхемы = ПоместитьВоВременноеХранилище(СхемаВыгрузкиДанных, УникальныйИдентификатор);
	КомпоновщикНастроекКомпоновкиДанных.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы)); 
	
	Если НастройкиКомпоновки = Неопределено Тогда
		КомпоновщикНастроекКомпоновкиДанных.ЗагрузитьНастройки(СхемаВыгрузкиДанных.НастройкиПоУмолчанию);
	Иначе
		КомпоновщикНастроекКомпоновкиДанных.ЗагрузитьНастройки(НастройкиКомпоновки);
		КомпоновщикНастроекКомпоновкиДанных.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура УдалитьНеАктуальныеПоляОтбора(СхемаВыгрузкиДанных)
	
	УдаляемыеПоля = Новый Массив;
	ЗаполнитьУдалемыеПоля(УдаляемыеПоля);
	
	УдалитьПоляОтбораИзСхемы(СхемаВыгрузкиДанных.НастройкиПоУмолчанию.Отбор.Элементы, УдаляемыеПоля);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУдалемыеПоля(УдаляемыеПоля);
	
	// Пакет предложений и каталог
	Если РежимВыгрузки = 0 Тогда
		
		ОбменССайтомПереопределяемый.ЗаполнитьУдаляемыеПоляОтбораКаталог(УдаляемыеПоля);
		ОбменССайтомПереопределяемый.ЗаполнитьУдаляемыеПоляОтбораПакетПредложений(УдаляемыеПоля);
		
		// Каталог
	ИначеЕсли РежимВыгрузки = 1 Тогда
		
		ОбменССайтомПереопределяемый.ЗаполнитьУдаляемыеПоляОтбораКаталог(УдаляемыеПоля);
		
		// Пакет предложений
	ИначеЕсли РежимВыгрузки = 2 Тогда
		
		ОбменССайтомПереопределяемый.ЗаполнитьУдаляемыеПоляОтбораПакетПредложений(УдаляемыеПоля);
		
		// Обновение пакета предложения
	ИначеЕсли РежимВыгрузки = 3 Тогда
		
		ОбменССайтомПереопределяемый.ЗаполнитьУдаляемыеПоляОтбораОбновлениеПакетаПредложений(УдаляемыеПоля);
		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УдалитьПоляОтбораИзСхемы(ЭлементыОтбора, УдаляемыеПоля)
	
	Если УдаляемыеПоля.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	н = 0;
	Пока н < ЭлементыОтбора.Количество() Цикл
		
		ПолеОтбора = ЭлементыОтбора[н];
		ИмяПоля = Строка(ПолеОтбора.ЛевоеЗначение);
		
		Если Не УдаляемыеПоля.Найти(ИмяПоля) = Неопределено Тогда
			
			ЭлементыОтбора.Удалить(ПолеОтбора);
			
		Иначе
			н = н + 1;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПереопределяемыеПоля(СхемаВыгрузкиДанных)
	
	ПоляОтбора = Новый Соответствие;
	
	// Пакет предложений и каталог
	Если РежимВыгрузки = 0 Тогда
		
		ОбменССайтомПереопределяемый.ЗаполнитьПоляОтбораКаталога(ПоляОтбора);
		ОбменССайтомПереопределяемый.ЗаполнитьПоляОтбораПакетаПредложений(ПоляОтбора);
		
	// Каталог
	ИначеЕсли РежимВыгрузки = 1 Тогда
		
		ОбменССайтомПереопределяемый.ЗаполнитьПоляОтбораКаталога(ПоляОтбора);
		
	// Пакет предложений
	ИначеЕсли РежимВыгрузки = 2 Тогда
		
		ОбменССайтомПереопределяемый.ЗаполнитьПоляОтбораПакетаПредложений(ПоляОтбора);
		
	// Обновение пакета предложения
	ИначеЕсли РежимВыгрузки = 3 Тогда
		
		ОбменССайтомПереопределяемый.ЗаполнитьПоляОтбораОбновленияПакетаПредложений(ПоляОтбора);
		
	КонецЕсли;
	
	ОбменССайтом.ДобавитьПоляОтбораВСхему(ПоляОтбора, СхемаВыгрузкиДанных);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьТипыЗначенияСсылочныхПолей(СхемаВыгрузкиДанных)
	
	
	ИмяСправочникаНоменклатура = ОбменССайтомПовтИсп.ИмяПрикладногоСправочника("Номенклатура");
	ТипЗначенийТовар = Новый ОписаниеТипов("СправочникСсылка." + ИмяСправочникаНоменклатура);
	
	ИмяСправочникаТипЦены = ОбменССайтомПовтИсп.ИмяПрикладногоСправочника("ВидыЦен");
	ТипЗначенийТипЦены = Новый ОписаниеТипов("СправочникСсылка." + ИмяСправочникаТипЦены);
	
	ИмяСправочникаСклады = ОбменССайтомПовтИсп.ИмяПрикладногоСправочника("Склады");
	ТипЗначенийСклады = Новый ОписаниеТипов("СправочникСсылка." + ИмяСправочникаСклады);
	
	ИмяПВХСвойства = ОбменССайтомПовтИсп.ИмяПрикладногоПВХ("ДополнительныеРеквизитыИСведения");
	ТипЗначенийСвойства = Новый ОписаниеТипов("СправочникСсылка." + ИмяПВХСвойства);
	
	ПоляСхемыВыгрузки = СхемаВыгрузкиДанных.НаборыДанных.НаборДанных1.Поля;
	
	ПолеНоменклатура = ПоляСхемыВыгрузки.Найти("Номенклатура");
	Если Не ПолеНоменклатура = Неопределено Тогда
		ПолеНоменклатура.ТипЗначения = ТипЗначенийТовар;
	КонецЕсли;
	
	ПолеСклад = ПоляСхемыВыгрузки.Найти("Склад");
	Если Не ПолеСклад = Неопределено Тогда
		ПолеСклад.ТипЗначения = ТипЗначенийСклады;
	КонецЕсли;
	
	ПолеВидЦены = ПоляСхемыВыгрузки.Найти("ТипЦены");
	Если Не ПолеВидЦены = Неопределено Тогда
		ПолеВидЦены.ТипЗначения = ТипЗначенийТипЦены;
	КонецЕсли;
	
	ПолеСвойствоНоменклатуры = ПоляСхемыВыгрузки.Найти("СвойствоНоменклатуры");
	Если Не ПолеСвойствоНоменклатуры = Неопределено Тогда
		ПолеСвойствоНоменклатуры.ТипЗначения = ТипЗначенийСвойства;
	КонецЕсли;
	
	ЭлементыОтбораСхемыВыгрузки = СхемаВыгрузкиДанных.НастройкиПоУмолчанию.Отбор.Элементы;
	
	Для Каждого ЭлементОтбора Из ЭлементыОтбораСхемыВыгрузки Цикл
		
		Если Нрег(ЭлементОтбора.ЛевоеЗначение) = НРег("Номенклатура") Тогда
			ЭлементОтбора.ПравоеЗначение = Справочники[ИмяСправочникаНоменклатура].ПустаяССылка();
			
		ИначеЕсли Нрег(ЭлементОтбора.ЛевоеЗначение) = НРег("ТипЦены") Тогда
			ЭлементОтбора.ПравоеЗначение = Справочники[ИмяСправочникаТипЦены].ПустаяССылка();
		
		ИначеЕсли Нрег(ЭлементОтбора.ЛевоеЗначение) = НРег("Склад") Тогда
			ЭлементОтбора.ПравоеЗначение = Справочники[ИмяСправочникаСклады].ПустаяССылка();
			
		ИначеЕсли Нрег(ЭлементОтбора.ЛевоеЗначение) = НРег("СвойствоНоменклатуры") Тогда
			ЭлементОтбора.ПравоеЗначение = Справочники[ИмяПВХСвойства].ПустаяССылка();
			
		ИначеЕсли Нрег(ЭлементОтбора.ЛевоеЗначение) = НРег("ОстатокНаСкладе") Тогда
			ЭлементОтбора.ПравоеЗначение = 0;
	
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНастройкиКомпоновкиСервер()
	
	Возврат КомпоновщикНастроекКомпоновкиДанных.ПолучитьНастройки();
	
КонецФункции

&НаСервере
Функция ПолучитьНастройкиПоУмолчаниюСервер()
	
	Если РежимВыгрузки = 0 Тогда
		
		СхемаВыгрузкиДанных = ПланыОбмена.ОбменССайтом.ПолучитьМакет("СхемаВыгрузкиКаталогПакетПредложений");
		
	ИначеЕсли РежимВыгрузки = 1 Тогда
		
		СхемаВыгрузкиДанных = ПланыОбмена.ОбменССайтом.ПолучитьМакет("СхемаВыгрузкиКаталог");
		
	ИначеЕсли РежимВыгрузки = 2 Тогда
		
		СхемаВыгрузкиДанных = ПланыОбмена.ОбменССайтом.ПолучитьМакет("СхемаВыгрузкиПакетПредложений");
		
	ИначеЕсли РежимВыгрузки = 3 Тогда
		
		СхемаВыгрузкиДанных = ПланыОбмена.ОбменССайтом.ПолучитьМакет("СхемаВыгрузкиОбновлениеПакетаПредложений");
		
	КонецЕсли;
	
	Возврат СхемаВыгрузкиДанных.НастройкиПоУмолчанию;
	
КонецФункции

&НаКлиенте
Процедура НастройкиПоУмолчанию(Команда)
	Закрыть(ПолучитьНастройкиПоУмолчаниюСервер());
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

