#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// sza151210-2247 про
// sza151022-2127
Процедура ПередЗаписью(Отказ)

	Если НЕ Отказ
		И Модифицированность()
		И НЕ ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("МассоваяЗагрузка", ИСТИНА)
		И ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ФормироватьОписаниеТаблицОбъектовДляИхСписков") Тогда

		ОбщийМодульСервер.ОформитьОписаниеТаблицы(ЭтотОбъект, "ДополнительныеРеквизиты", "ДополнительныйРеквизит", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("дополнительных реквизитов"));
	КонецЕсли;

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Комментарий = "";
КонецПроцедуры

#КонецЕсли
