// sza151210-2247 про
// sza151022-2127 
Процедура ПриКопировании(ОбъектКопирования)
	Комментарий = "";
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если НЕ Отказ
		И Модифицированность()
		И ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ФормироватьОписаниеТаблицОбъектовДляИхСписков") Тогда
		
			ОбщийМодульСервер.ОформитьОписаниеТаблицы(ЭтотОбъект, "ДополнительныеРеквизиты", "ДополнительныйРеквизит", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("дополн. реквизитов"));
		КонецЕсли;
		
КонецПроцедуры
