// sza151210-2356 про
// sza140420-1556  
// sza130909-0324 : 
&НаКлиенте
Процедура ОтборПоОрганизацииПриИзменении(Элемент)
	ОтборПоПоставщикуПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоПоставщикуОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	ОбщийМодульКлиент.ПоискОшибкиКодировки("Поставщики", ДанныеВыбора, Текст, ОтборПоПоставщику);
	ОтборПоПоставщикуПриИзмененииНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ОтборПоПоставщикуПриИзменении(Элемент) 	
	ОтборПоПоставщикуПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтборПоПоставщикуПриИзмененииНаСервере()
	
	список.Параметры.УстановитьЗначениеПараметра("Поставщик", ОтборПоПоставщику);
	список.Параметры.УстановитьЗначениеПараметра("Организация", ОтборПоОрганизации);
	список.Параметры.УстановитьЗначениеПараметра("НеИспользоватьОтборПоОрганизации", НЕ ПараметрыСеанса.ВестиУчетСобственныхЮридическихЛицПС ИЛИ НЕ ЗначениеЗаполнено(ОтборПоОрганизации));
	
КонецПроцедуры

&НаСервере
Функция   ПолучитьПоставщикапоУмолчанию()	
	
	РезультатПолучитьПоставщикапоУмолчанию = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ПоставщикПоУмолчанию");
	
	Возврат РезультатПолучитьПоставщикапоУмолчанию;
	
КонецФункции // ПолучитьКлиентаПоУмолчанию

&НаКлиенте
Процедура ПриЗакрытии()                                       // ПРИ ЗАКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)                                  // ПРИ ОТКРЫТИИ	
	
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
	
	Если ЗначениеЗаполнено(параметры.Поставщик) Тогда
		ОтборПоПоставщику = параметры.Поставщик;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ОтборПоПоставщику) Тогда
		ОтборПоПоставщику = ПолучитьПоставщикапоУмолчанию();
	КонецЕсли;
	ОтборПоПоставщикуПриИзмененииНаСервере();
	
	ПодключитьОбработчикОжидания("ПослеИзображенияОкнаФормы", 0.3, ИСТИНА);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеИзображенияОкнаФормы() // Когда окно уже нарисовано пользователю
	ЭтаФорма.Элементы.ФормаЗакрыть.Видимость = НЕ ЭтаФорма.Окно = Неопределено;	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("00065А", ЭтаФорма, Отказ, );	
	
	Если НЕ Отказ Тогда
		Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьСобственныйПереводЭлементовИнтерфейса") Тогда
			ОбщийМодульСервер.ПеревестиРеквизитыФормы(ЭтаФорма);	
		КонецЕсли;
		
		ОбщийМодульСервисСервер.ОформитьФорматКоличества(Элементы.Количество, , ИСТИНА);
		ОбщийМодульСервер.ОбеспечитьСписокОтборов(Список);
		ОтборПоПоставщикуПриИзмененииНаСервере();
		
		Элементы.ПроТовары.Видимость = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ФормироватьОписаниеТаблицОбъектовДляИхСписков");
	КонецЕсли;
	
КонецПроцедуры
