//sza130909-0324 : 

&НаКлиенте
Процедура ОтборПоПоставщикуПриИзменении(Элемент) 	
	ОтборПоПоставщикуПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтборПоПоставщикуПриИзмененииНаСервере()
	
	список.Параметры.УстановитьЗначениеПараметра("Поставщик", ОтборПоПоставщику);
	список.Параметры.УстановитьЗначениеПараметра("Организация", ОтборПоОрганизации);
	список.Параметры.УстановитьЗначениеПараметра("НеИспользоватьОтборПоОрганизации", НЕ ПараметрыСеанса.ВестиУчетСобственныхЮридическихЛицПС ИЛИ НЕ ЗначениеЗаполнено(ОтборПоОрганизации));
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)                                                                    // ПРИ ОТКРЫТИИ	
	
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
	
	Если ЗначениеЗаполнено(параметры.Поставщик) Тогда
		ОтборПоПоставщику = параметры.Поставщик;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ОтборПоПоставщику) Тогда
		ОтборПоПоставщику = ПолучитьПоставщикапоУмолчанию();
	КонецЕсли;
	ОтборПоПоставщикуПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Функция   ПолучитьПоставщикапоУмолчанию()	
	
	РезультатПолучитьПоставщикапоУмолчанию = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ПоставщикПоУмолчанию");
	
	Возврат РезультатПолучитьПоставщикапоУмолчанию;
	
КонецФункции //ПолучитьКлиентаПоУмолчанию

&НаКлиенте
Процедура ПриЗакрытии()                                                  // ПРИ ЗАКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоПоставщикуОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	ОбщийМодульКлиент.ПоискОшибкиКодировки("Поставщики", ДанныеВыбора, Текст, ОтборПоПоставщику);
	ОтборПоПоставщикуПриИзмененииНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ОтборПоОрганизацииПриИзменении(Элемент)
	ОтборПоПоставщикуПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОтборПоПоставщикуПриИзмененииНаСервере();
КонецПроцедуры
