// sza140726-1915
// sza140420-1435  
// sza131120-1125  
&НаКлиенте
Процедура ПриЗакрытии()                                                 // ПРИ ЗАКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)                                            // ПРИ ОТКРЫТИИ
	
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
	ПодключитьОбработчикОжидания("ПослеИзображенияОкнаФормы", 0.3, ИСТИНА);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеИзображенияОкнаФормы() // Когда окно уже нарисовано пользователю
	ЭтаФорма.Элементы.ФормаЗакрыть.Видимость = НЕ ЭтаФорма.Окно = Неопределено;	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("000657", ЭтаФорма, Отказ, );
	Если НЕ Отказ Тогда
		Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьСобственныйПереводЭлементовИнтерфейса") Тогда
			ОбщийМодульСервер.ПеревестиРеквизитыФормы(ЭтаФорма);	
		КонецЕсли;
		
		ОбщийМодульСервер.ОбеспечитьСписокОтборов(Список, "Взаимозачет");		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка=ЛОЖЬ;
   ОткрытьФорму("Документ.КорректировкиИРегистрацияОстатков.Форма.ФормаДокументаВзаимоЗачетаДолгаКонтрагентов",Новый Структура("Ключ",ВыбраннаяСтрока));
   
КонецПроцедуры

&НаКлиенте
Процедура НовыйДокументВзаимозачетаКонтрагентов(Команда)
	
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("Документ.КорректировкиИРегистрацияОстатков.Форма.ФормаДокументаВзаимоЗачетаДолгаКонтрагентов", ПараметрыФормы);

КонецПроцедуры
