//sza140120-1711 SZA: 

Процедура НаПечать(ТабДок, Ссылка) Экспорт
	
	Макет = Справочники.СредстваПредприятия.ПолучитьМакет("НаПечать");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ СредстваПредприятия.ДатаВводаВЭксплуатацию,
	|	СредстваПредприятия.ДатаОкончанияЭксплуатации,
	|	СредстваПредприятия.ИнвентарныйНомер,
	|	СредстваПредприятия.Комментарий,
	|	СредстваПредприятия.Наименование,
	|	СредстваПредприятия.НачальнаяСтоимость,
	|	СредстваПредприятия.НоменклатурнаяГруппа,
	|	СредстваПредприятия.Регион,
	|	СредстваПредприятия.Склад,
	|	СредстваПредприятия.ХранилищеДенег
	|ИЗ Справочник.СредстваПредприятия КАК СредстваПредприятия
	|ГДЕ СредстваПредприятия.Ссылка В (&Ссылка)";
	
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если НЕ ОбщийМодульПовтор.ТекущийЯзыкРусский()
		и ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ПоддерживатьНаименованияНаДругихЯзыкахКромеРусского", Истина) Тогда
		
		ВозможноеПредставление = ОбщийМодульПовтор.получитьПредставлениеНаЯзыке(Данные.ссылка, , Истина);
		Если НЕ ВозможноеПредставление = Неопределено Тогда
			Представление = ВозможноеПредставление;
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
