//sza140812-1930 на основании
//sza140411-1703
//sza140210-0357 
Процедура ПередЗаписью(Отказ)
	
	Если НЕ Отказ 
		И НЕ ПометкаУдаления Тогда
		
		ОбщийМодульСервер.ПроверитьСменуНаименованияНаТекущемЯзыке(Наименование, Ссылка);	
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Номенклатура") Тогда
		Комментарий 		 = ДанныеЗаполнения.Комментарий;
		Наименование 		 = ДанныеЗаполнения.Наименование;
		НоменклатурнаяГруппа = ДанныеЗаполнения.НоменклатурнаяГруппа;
		ИнвентарныйНомер 	 = ДанныеЗаполнения.ОсновнойШтрихКод;
		НачальнаяСтоимость   = ДанныеЗаполнения.Цена;
	КонецЕсли;
	
КонецПроцедуры
