#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// sza151218-1603
// sza140812-1930 на основании
// sza140411-1703
// sza140210-0357
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Номенклатура") Тогда
		Комментарий 		 = ДанныеЗаполнения.Комментарий;
		Наименование 		 = ДанныеЗаполнения.Наименование;
		НоменклатурнаяГруппа = ДанныеЗаполнения.НоменклатурнаяГруппа;
		ИнвентарныйНомер 	 = ДанныеЗаполнения.ОсновнойШтрихКод;
		НачальнаяСтоимость   = ДанныеЗаполнения.Цена;
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ)

	Если НЕ Отказ
		И НЕ ПометкаУдаления
		И НЕ ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("МассоваяЗагрузка", ИСТИНА) Тогда

		ОбщийМодульСервер.ПроверитьСменуНаименованияНаТекущемЯзыке(Наименование, Ссылка);

		Если НЕ ЭтоГруппа
			И ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ФормироватьОписаниеТаблицОбъектовДляИхСписков") Тогда

			ОбщийМодульСервер.ОформитьОписаниеТаблицы(ЭтотОбъект, "ЗакрепленныеСотрудники", "Сотрудник", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("закрепленных сотрудников"));
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецЕсли
