////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ
// Процедура - обаботчик события "Нажатие" в: Кнопка "ОК"
//

&НаКлиенте
Процедура ОКНажатие(Команда)

	ОповеститьОВыборе(Элементы.СписокНастроек.ТекущиеДанные);
	//Закрыть();

КонецПроцедуры

// Процедура - обаботчик события "Нажатие" в: Кнопка "Отмена"
//
&НаКлиенте
Процедура ОтменаНажатие(Команда)

	Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()

	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

			Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьСобственныйПереводЭлементовИнтерфейса") Тогда
			ОбщийМодульСервер.ПеревестиРеквизитыФормы(ЭтаФорма);
		КонецЕсли;

		ТекущиеДанные = СписокНастроек[0];

	Если Не ТекущиеДанные = Неопределено Тогда
		Элементы.СписокНастроек.ТекущаяСтрока = ТекущиеДанные;
	КонецЕсли;

	Элементы.Удалить.Доступность = Не СписокНастроек.Количество() = 0;
	Элементы.ОК.Доступность      = Не СписокНастроек.Количество() = 0;

	ОбщийМодульСервисСервер.ОбработатьНовуюФорму(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура РеакцияНаПрочиеСобытияФормы(КомандаСобытияФормы) Экспорт // Для реакции на события для запрограммированных элементов
	ОбщийМодульКлиент.РеакцияНаПрочиеСобытияФормы(КомандаСобытияФормы, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СписокНастроекПометкаПриИзменении(Элемент)

	ТекущиеДанные = Элементы.СписокНастроек.ТекущиеДанные;

	Если ТекущиеДанные.Пометка Тогда
		Для каждого ЭлементСписка Из СписокНастроек Цикл
			Если ЭлементСписка.Пометка и Не ЭлементСписка = ТекущиеДанные Тогда
				ЭлементСписка.Пометка = Ложь;
			КонецЕсли;

		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

// Процедура - обаботчик события "Нажатие" в: Кнопка "Удалить"
//
&НаКлиенте
Процедура УдалитьНажатие(Команда)

	ТекущиеДанные = Элементы.СписокНастроек.ТекущиеДанные;

	Если Не ТекущиеДанные = Неопределено Тогда
		СписокНастроек.Удалить(ТекущиеДанные);
	КонецЕсли;

КонецПроцедуры
