//sza140723-1727
//sza140409-0124  
Процедура НаПечать(ТабДок, Ссылка) Экспорт
	
	Макет = Документы.ТаблицыДанных.ПолучитьМакет("НаПечать");
	Макет.КодЯзыкаМакета = ОбщийМодульПовтор.ПолучитьТекущийЯзыкДокументов();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ТаблицыДанных.Дата,
	|	ТаблицыДанных.ДатаРедакции,
	|	ТаблицыДанных.ДатаСоздания,
	|	ТаблицыДанных.Комментарий,
	|	ТаблицыДанных.Номер,
	|	ТаблицыДанных.Ответственный,
	|	ТаблицыДанных.ТипДокумента,
	|	ТаблицыДанных.ОписаниеШапки.(
	|		НомерСтроки,
	|		РеквизитШапки,
	|		ОписаниеРеквизитаШапки,
	|		ЗначениеРевизитаШапки
	|	),
	|	ТаблицыДанных.ОписаниеКолонок.(
	|		НомерСтроки,
	|		РеквизитПоле,
	|		ТипПоля,
	|		ОписаниеПоляКолонки
	|	),
	|	ТаблицыДанных.ТаблицаСДанными.(
	|		НомерСтроки,
	|		ЗначениеПоляТаблицы1,
	|		ЗначениеПоляТаблицы2,
	|		ЗначениеПоляТаблицы3,
	|		ЗначениеПоляТаблицы4,
	|		ЗначениеПоляТаблицы5,
	|		ЗначениеПоляТаблицы6,
	|		ЗначениеПоляТаблицы7,
	|		ЗначениеПоляТаблицы8,
	|		ЗначениеПоляТаблицы9,
	|		ЗначениеПоляТаблицы10,
	|		ОСтроке
	|	),
	|	ТаблицыДанных.ЧислоЗаписей
	|ИЗ Документ.ТаблицыДанных КАК ТаблицыДанных
	|ГДЕ ТаблицыДанных.Ссылка В(&Ссылка)";
	
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок 			= Макет.ПолучитьОбласть("Заголовок");
	Шапка 						= Макет.ПолучитьОбласть("Шапка");
	ОбластьОписаниеШапкиШапка 	= Макет.ПолучитьОбласть("ОписаниеШапкиШапка");
	ОбластьОписаниеШапки 		= Макет.ПолучитьОбласть("ОписаниеШапки");
	ОбластьОписаниеКолонокШапка = Макет.ПолучитьОбласть("ОписаниеКолонокШапка");
	ОбластьОписаниеКолонок 		= Макет.ПолучитьОбласть("ОписаниеКолонок");
	ОбластьТаблицаСДаннымиШапка	= Макет.ПолучитьОбласть("ТаблицаСДаннымиШапка");
	ОбластьТаблицаСДанными 		= Макет.ПолучитьОбласть("ТаблицаСДанными");
	Подвал 						= Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = ЛОЖЬ;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьОписаниеШапкиШапка);
		ВыборкаОписаниеШапки = Выборка.ОписаниеШапки.Выбрать();
		Пока ВыборкаОписаниеШапки.Следующий() Цикл
			ОбластьОписаниеШапки.Параметры.Заполнить(ВыборкаОписаниеШапки);
			ТабДок.Вывести(ОбластьОписаниеШапки, ВыборкаОписаниеШапки.Уровень());
		КонецЦикла;

		ТабДок.Вывести(ОбластьОписаниеКолонокШапка);
		ВыборкаОписаниеКолонок = Выборка.ОписаниеКолонок.Выбрать();
		Пока ВыборкаОписаниеКолонок.Следующий() Цикл
			ОбластьОписаниеКолонок.Параметры.Заполнить(ВыборкаОписаниеКолонок);
			ТабДок.Вывести(ОбластьОписаниеКолонок, ВыборкаОписаниеКолонок.Уровень());
		КонецЦикла;

		ТабДок.Вывести(ОбластьТаблицаСДаннымиШапка);
		ВыборкаТаблицаСДанными = Выборка.ТаблицаСДанными.Выбрать();
		Пока ВыборкаТаблицаСДанными.Следующий() Цикл
			ОбластьТаблицаСДанными.Параметры.Заполнить(ВыборкаТаблицаСДанными);
			ТабДок.Вывести(ОбластьТаблицаСДанными, ВыборкаТаблицаСДанными.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = ИСТИНА;
	КонецЦикла;
	
КонецПроцедуры

