//sza140420-1707 SZA: 
//sza131121-1514 SZA: 

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("000100", , , );	
	
	Если НЕ Отказ Тогда
		ПараметрыФормы = Новый Структура("", );
		ОткрытьФорму("Отчет.ЖурналСобытий.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	КонецЕсли;

КонецПроцедуры
