//sza140611-1542 Хозяин: 
//sza131005-0251 : 

&НаКлиенте
Процедура ПриОткрытии(Отказ)                                             // ПРИ ОТКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()                                                  // ПРИ ЗАКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("000305", ЭтаФорма, Отказ, );	
	Если НЕ Отказ Тогда
		ОбщийМодульСервисСервер.ОформитьФорматКоличества(Элементы.Количество, , Истина);
		ОбщийМодульСервер.ОбеспечитьСписокОтборов(Список);	
		
		ОбщийМодульСервисСервер.ОформитьФорматКоличества(Элементы.Количество, , Истина);
	КонецЕсли;
	
КонецПроцедуры
