//sza140420-2104 SZA: 
//sza140114-0009 : 
//sza131119-2324
//sza110726-1530 
//sza110521-2153 ОпределитьФорматФайлаПоРасширению
//sza110515-0105 регистр сведений
//sza110427-0023 выгрузка
//sza110406-1938 
//sza110308-0135 
//sza110302-0011 
//sza110225-1217 
//sza110225-0102 УстановитьВидимостьДоступностьЭлементовФормы(
//sza110224-1525 РезультатПроизвольногоЗапроса
//sza110217-1131 СообщатьОНедостаточномЗаполненииПриЭкспортеДокументовДляПОБанка
//sza110216-2016 
//sza110216-1635 Файл архив
//sza110213-2131 ПравилаДляРаботыСЗапасами
//sza110213-0114 ШаблонФайла.ИскатьВПодкаталогах
//sza110213-0052 ?(Объект.ЗагружатьВсеФайлыИзПапки,
//sza110211-1203 вся папка
//sza110210-0055 результат произволього запроса
//sza110209-1618 
//sza110209-0050 ЗаполнитьПоРеквизитамОбъектаБазыДанных
//sza110207-1746 
//sza110205-2256 разное
//sza110131-1256 
//sza110128-1458 
//sza110128-0224 
//sza110126-1903 
//sza110126-0307 
//sza110120-0233 
//sza110118-1411 
//sza110112-1445 
//sza110111-0045 
//sza110110-1316 
//sza110107-1247 
//sza110107-0516 
//sza101222-2040 
//sza101209-2253 
//sza101207-2358 
//sza101204-0122 
//sza101203-0150 
//sza101201-1335 
//sza101116-1352 
//sza101116-0140 
//sza101115-1649 
//sza101110-1417 
//sza101109-1732 
//sza101108-2359 
//sza101105-0212 
//sza101025
//sza101023
&НаСервере
Функция   ИзменитьКомментарий(ПоследовательностьПолейВФайлеТекущиеДанные)
	
	Если ЗначениеЗаполнено(ПоследовательностьПолейВФайлеТекущиеДанные) Тогда
		возврат ПоследовательностьПолейВФайлеТекущиеДанные.Комментарий;
		
	иначе
		возврат "";
		
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция   ИзменитьИмяПоляВФайле(ПоследовательностьПолейВФайлеТекущиеДанные)
	
	Если ЗначениеЗаполнено(ПоследовательностьПолейВФайлеТекущиеДанные) Тогда
		возврат ПоследовательностьПолейВФайлеТекущиеДанные.ЗаголовокПоляПоУмолчанию;
	иначе
		возврат "";
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПоследовательностьПолейВФайлеПолеТаблицыПриИзменении(Элемент)
	
	ПриИзмененииПоля();
	
КонецПроцедуры

&НаКлиенте
Процедура ОценитьФайлПоТипу(ТипОценки)
	
	Если Объект.ПоследовательностьПолейВФайле.Количество() = 0 
		ИЛИ Вопрос(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Вы готовы удалить существующую таблицу полей шаблона?"), РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		
		Объект.ПоследовательностьПолейВФайле.Очистить();
		СтруктураДиалогФильтр = ПодсистемаИЭИмпортЭкспортФС.СтруктураДиалогФильтр(Объект);
		ДиалогРасширение = СтруктураДиалогФильтр.ДиалогРасширение;
		ДиалогФильтр 	 = СтруктураДиалогФильтр.ДиалогФильтр;
		ДиалогВыбораФайла1 					= Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		ДиалогВыбораФайла1.Заголовок  		= ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Выберите файл для оценки") + " " + ТипОценки + ":";
		ДиалогВыбораФайла1.ПолноеИмяФайла 	= ПодсистемаИЭИмпортЭкспортФС.константыПодсистемаИЭИмпортЭкспортФСПолучить(); //АДРЕС
		ДиалогВыбораФайла1.Фильтр  			= ДиалогФильтр;
		ДиалогВыбораФайла1.Расширение  		= ДиалогРасширение;
		ДиалогВыбораФайла1.МножественныйВыбор 		= Ложь;
		ДиалогВыбораФайла1.ПредварительныйПросмотр 	= Истина;
		ДиалогВыбораФайла1.ИндексФильтра 	= 0;
		ДиалогВыбораФайла1.ПроверятьСуществованиеФайла = Истина;
		
		Если ДиалогВыбораФайла1.Выбрать() Тогда
			АдресФайла = ДиалогВыбораФайла1.ПолноеИмяФайла;
			Попытка 
				ПодсистемаИЭИмпортЭкспортФС.константыПодсистемаИЭИмпортЭкспортФСУстановить(АдресФайла);
			Исключение 
			КонецПопытки; 
			
			ЗаполнитьШаблонНаСервере(АдресФайла,ТипОценки);
			
			УстановитьВидимостьДоступность();
			
		КонецЕсли; //когда файл АдресФайла выбран 
	КонецЕсли;
	
	ОпределитьФорматФайлаПоРасширению();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьШаблонНаСервере(АдресФайла, ТипОценки)
	
	Если СтрДлина(АдресФайла) > 4 Тогда
		Если ВРЕГ(Прав(АдресФайла,3)) = "XLS" Или ВРЕГ(Прав(АдресФайла,4)) = "XLSX" Тогда
			Объект.ФорматФайла = Перечисления.ПодсистемаИЭИмпортЭкспортФорматыФайлов.XLS ;
		ИначеЕсли ВРЕГ(Прав(АдресФайла,3)) = "DBF" Тогда
			Объект.ФорматФайла = Перечисления.ПодсистемаИЭИмпортЭкспортФорматыФайлов.DBF ;
			//ИначеЕсли ВРЕГ(Прав(АдресФайла,3)) = "XML" Тогда
			//	Объект.ФорматФайла = Перечисления.ПодсистемаИЭИмпортЭкспортФорматыФайлов.XML ;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ Объект.ЗагружатьВсеФайлыИзПапки Тогда
		Объект.АдресФайла = АдресФайла;
	КонецЕсли;	
	
	ОбъектШаблон= РеквизитФормыВЗначение("Объект");
	ПодсистемаИЭИмпортЭкспортФС.ПроизвестиОценкуФайла(ОбъектШаблон, АдресФайла, ТипОценки); 
	ЗначениеВРеквизитФормы(ОбъектШаблон, "Объект");
	
	Объект.Комментарий = Сокрлп(Объект.Комментарий) + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке(" По оценке файла") + " " + АдресФайла + " " + ТипОценки;
	
КонецПроцедуры //ЗаполнитьШаблонНаСервере()

&НаКлиенте
Процедура ОценитьФайлТовары(Команда)
	
	ОценитьФайлПоТипу("Товары");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)                                                                    // ПРИ ОТКРЫТИИ	
	
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0, Объект.Ссылка, Истина);
	
	Если Объект.Предопределенный Тогда
		Элементы.ВидШаблона.ТолькоПросмотр=Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) 
		и НЕ ЗначениеЗаполнено(Объект.ФорматФайла) Тогда
		Объект.ФорматФайла = ПредопределенноеЗначение("Перечисление.ПодсистемаИЭИмпортЭкспортФорматыФайлов.TXT");
	КонецЕсли;
	
	УстановитьВидимостьДоступность(Истина);
	
	#Если ТонкийКлиент Тогда
		Элементы.ТипТекущегоКлиента.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Сейчас запущен ""Тонкий клиент""");
	#Иначе
		#Если ВебКлиент Тогда
			Элементы.ТипТекущегоКлиента.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Сейчас запущен ""WEB-клиент""");
		#Иначе
			Элементы.ТипТекущегоКлиента.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Сейчас приложение в подходящем режиме.");
		#КонецЕсли
		
	#КонецЕсли
	УстановитьДоступностьПрогрессПроизводстваОбмена();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидШаблонаПриИзменении(Элемент)
	
	Если Объект.ВидШаблона = ПредопределенноеЗначение("Перечисление.ПодсистемаИЭИмпортЭкспортФайловВидыШаблонов.Предопределенный") 
		И НЕ Объект.Предопределенный Тогда
		
		Объект.ВидШаблона = ПредопределенноеЗначение("Перечисление.ПодсистемаИЭИмпортЭкспортФайловВидыШаблонов.ЛюбойВариант");
		
	ИначеЕсли Объект.ВидШаблона = ПредопределенноеЗначение("Перечисление.ПодсистемаИЭИмпортЭкспортФайловВидыШаблонов.РезультатПроизвольногоЗапроса") Тогда
		
		Объект.ИспользоватьТолькоДляЭкспорта = Истина;
		Объект.ИспользоватьТолькоДляИмпорта = Ложь;
		Объект.ИмяТаблицыШаблонаФайла = "";
		
	ИначеЕсли Объект.ВидШаблона = ПредопределенноеЗначение("Перечисление.ПодсистемаИЭИмпортЭкспортФайловВидыШаблонов.ДляОбменаСБанком") 
		и СокрЛП(Объект.ОбрабатыватьПлатежныеДокументы) = "" Тогда
		
		Объект.ОбрабатыватьПлатежныеДокументы = "Безналичные";
		
	КонецЕсли;
	
	УстановитьВидимостьДоступность(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСимволTAB(Команда)
	
	Объект.РазделительПолей = Объект.РазделительПолей + Символы.Таб;
	
КонецПроцедуры

&НаКлиенте
Процедура ОценитьФайл(Команда)
	
	ОценитьФайлПоТипу("");
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьТолькоДляЭкспортаПриИзменении(Элемент)
	
	Если Объект.ИспользоватьТолькоДляЭкспорта Тогда
		Объект.ИспользоватьТолькоДляИмпорта = Ложь;
	КонецЕсли;
	
	УстановитьВидимостьДоступность(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьТолькоДляИмпортаПриИзменении(Элемент)
	
	Если Объект.ИспользоватьТолькоДляИмпорта Тогда
		Объект.ИспользоватьТолькоДляЭкспорта = Ложь;
	КонецЕсли;
	
	УстановитьВидимостьДоступность(Истина);
	
КонецПроцедуры
&НаКлиенте
Процедура АдресФайлаБезВыбораНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтруктураДиалогФильтр = ПодсистемаИЭИмпортЭкспортФС.СтруктураДиалогФильтр(Объект);
	ДиалогРасширение = СтруктураДиалогФильтр.ДиалогРасширение;
	ДиалогФильтр = СтруктураДиалогФильтр.ДиалогФильтр;
	ДиалогВыбораФайла1 = Новый ДиалогВыбораФайла(?(Объект.ЗагружатьВсеФайлыИзПапки, РежимДиалогаВыбораФайла.ВыборКаталога, РежимДиалогаВыбораФайла.Открытие));
	ДиалогВыбораФайла1.Заголовок  		= ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Выберите") + " " + ?(Объект.ЗагружатьВсеФайлыИзПапки, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("каталог"), ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("файл")) + " :";
	ДиалогВыбораФайла1.ПолноеИмяФайла 	= ?(НЕ Объект.АдресФайла = "", Объект.АдресФайла, ПодсистемаИЭИмпортЭкспортФС.КонстантыОтносительныйАдресФайловПолучить()); //АДРЕС
	ДиалогВыбораФайла1.Фильтр  			= ДиалогФильтр;
	ДиалогВыбораФайла1.Расширение  		= ДиалогРасширение;
	ДиалогВыбораФайла1.МножественныйВыбор = Ложь;
	ДиалогВыбораФайла1.ПредварительныйПросмотр = Истина;
	ДиалогВыбораФайла1.ИндексФильтра 	= 0;
	ДиалогВыбораФайла1.ПроверятьСуществованиеФайла = Ложь;
	
	Если ДиалогВыбораФайла1.Выбрать() Тогда
		Объект.АдресФайла = ?(Объект.ЗагружатьВсеФайлыИзПапки, ДиалогВыбораФайла1.Каталог, ДиалогВыбораФайла1.ПолноеИмяФайла);
		Попытка 
			ПодсистемаИЭИмпортЭкспортФС.константыПодсистемаИЭИмпортЭкспортФСУстановить(Объект.АдресФайла);
		Исключение 
		КонецПопытки; 
		
		ОпределитьФорматФайлаПоРасширению();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОпределитьФорматФайлаПоРасширению() //Экспорт	
	
	Расширение = ВРег(Прав(Объект.АдресФайла, 3));
	
	Если Расширение = "XLS"
		ИЛИ Расширение = "LSX" Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.ФорматФайла) 
			ИЛИ НЕ объект.ФорматФайла = Перечисления.ПодсистемаИЭИмпортЭкспортФорматыФайлов.XLS Тогда
			объект.ФорматФайла = Перечисления.ПодсистемаИЭИмпортЭкспортФорматыФайлов.XLS ;         	
		КонецЕсли;
		УстановитьВидимостьДоступность();
		
	ИначеЕсли Расширение = "DBF" Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.ФорматФайла) 
			ИЛИ НЕ объект.ФорматФайла = Перечисления.ПодсистемаИЭИмпортЭкспортФорматыФайлов.DBF Тогда
			объект.ФорматФайла = Перечисления.ПодсистемаИЭИмпортЭкспортФорматыФайлов.DBF ;	
		КонецЕсли;
		УстановитьВидимостьДоступность();
		
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.ФорматФайла) тогда
		
		объект.ФорматФайла = Перечисления.ПодсистемаИЭИмпортЭкспортФорматыФайлов.TXT ;
		УстановитьВидимостьДоступность();
		
	КонецЕсли;
	
КонецПроцедуры //ОпределитьФорматФайлаПоРасширению

&НаКлиенте
Процедура ФорматФайлаПолеПриИзменении(Элемент)
	
	УстановитьМаскуПоФормату();
	УстановитьВидимостьДоступность();	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьМаскуПоФормату()
	
	Если НЕ Объект.ЗагружатьВсеФайлыИзПапки Тогда
		Если Объект.ФорматФайла = Перечисления.ПодсистемаИЭИмпортЭкспортФорматыФайлов.DBF Тогда
			Объект.МаскаФайла = "*.DBF" + ?(Объект.ФайлАрхив, "|*.ZIP", "");
		ИначеЕсли Объект.ФорматФайла = Перечисления.ПодсистемаИЭИмпортЭкспортФорматыФайлов.TXT Тогда
			Объект.МаскаФайла = "*.CSV|*.TXT" + ?(Объект.ФайлАрхив, "|*.ZIP", "");
		ИначеЕсли Объект.ФорматФайла = Перечисления.ПодсистемаИЭИмпортЭкспортФорматыФайлов.XLS Тогда
			Объект.МаскаФайла = "*.XLS|*.XLSX" + ?(Объект.ФайлАрхив, "|*.ZIP", "");
			//ИначеЕсли Объект.ФорматФайла = Перечисления.ПодсистемаИЭИмпортЭкспортФорматыФайлов.XML Тогда
			//	Объект.МаскаФайла = "*.XML" + ?(Объект.ФайлАрхив, "|*.ZIP", "");
		КонецЕсли; 	
	КонецЕсли;
	
КонецПроцедуры //УстановитьМаскуПоФормату

Процедура УстановитьВидимостьДоступность(ИмпортЭкспортИзменился = Ложь)
	
	ОбъектИспользоватьТолькоДляЭкспорта = Объект.ИспользоватьТолькоДляЭкспорта;
	ОбъектИспользоватьТолькоДляИмпорта  = Объект.ИспользоватьТолькоДляИмпорта;
	
	Если ОбъектИспользоватьТолькоДляЭкспорта Тогда
		Элементы.ФайлАрхив.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Файл архивировать");	
	ИначеЕсли ОбъектИспользоватьТолькоДляИмпорта тогда
		Элементы.ФайлАрхив.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Для всех файлов архива");	
	Иначе
		
		Элементы.ФайлАрхив.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Файл в архиве");	
	КонецЕсли;
	
	Элементы.ПарольАрхива.Видимость = Объект.ФайлАрхив;	
	
	Если Объект.ЗагружатьВсеФайлыИзПапки Тогда
		Элементы.АдресФайлаБезВыбора.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Каталог (папка) с файлами: ");
		//		Элементы.ВестиЖурналИмпортноЭкспортныхОпераций.Доступность = Ложь;
		Элементы.ВестиЖурналИмпортноЭкспортныхОпераций.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Вести журнал имен файлов и не загружать повторно");
		Элементы.ИскатьВПодкаталогах.Видимость = Истина;
		Элементы.ИспользоватьТолько.Видимость = Ложь;
		
	Иначе
		Элементы.АдресФайлаБезВыбора.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Строгий адрес файла (без выбора файла)");
		Элементы.ВестиЖурналИмпортноЭкспортныхОпераций.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Вести журнал импортно-экспортных операций");
		//		Элементы.ВестиЖурналИмпортноЭкспортныхОпераций.Доступность = Истина;
		Элементы.ИскатьВПодкаталогах.Видимость = Ложь;
		Элементы.ИспользоватьТолько.Видимость= Истина;
		
	КонецЕсли;
	
	Если Объект.ФорматФайла = Перечисления.ПодсистемаИЭИмпортЭкспортФорматыФайлов.DBF Тогда
		Элементы.ПараметрыТекстовогоФормата.Видимость = Ложь;
		Элементы.ПараметрыФорматаExcel.Видимость = Ложь;
		Элементы.ОбщиеПараметры.Видимость = Ложь;
		Элементы.КодировкаФайла.Видимость = Ложь;
		Элементы.КодировкаDOS.Видимость = Истина;
		
	ИначеЕсли Объект.ФорматФайла = Перечисления.ПодсистемаИЭИмпортЭкспортФорматыФайлов.XLS Тогда
		Элементы.ПараметрыТекстовогоФормата.Видимость = Ложь;
		Элементы.ПараметрыФорматаExcel.Видимость = Истина;
		Элементы.ОбщиеПараметры.Видимость = Истина;
		Элементы.КодировкаФайла.Видимость = Ложь;
		Элементы.КодировкаDOS.Видимость = Ложь;
		
	ИначеЕсли Объект.ФорматФайла = Перечисления.ПодсистемаИЭИмпортЭкспортФорматыФайлов.TXT Тогда
		Элементы.ПараметрыТекстовогоФормата.Видимость = Истина;
		Элементы.ПараметрыФорматаExcel.Видимость = Ложь;
		Элементы.ОбщиеПараметры.Видимость = Истина;
		Элементы.КодировкаФайла.Видимость = Истина;
		Элементы.КодировкаDOS.Видимость = Ложь;
		
	Иначе //xml
		Элементы.ПараметрыТекстовогоФормата.Видимость = Ложь;
		Элементы.ПараметрыФорматаExcel.Видимость = Ложь;
		Элементы.ОбщиеПараметры.Видимость = Ложь;
		Элементы.КодировкаФайла.Видимость = Ложь;
		Элементы.КодировкаDOS.Видимость = Ложь;
		
	КонецЕсли;
	
	Если ИмпортЭкспортИзменился Тогда
		
		НЕОбъектИспользоватьТолькоДляЭкспорта = НЕ ОбъектИспользоватьТолькоДляЭкспорта;
		
		Элементы.ЗагружатьИзКаталога.Видимость															 = НЕОбъектИспользоватьТолькоДляЭкспорта;
		Элементы.УдалятьФайлПослеУдачногоИмпорта.Видимость												 = НЕОбъектИспользоватьТолькоДляЭкспорта;
		Элементы.ПоследовательностьПолейВФайлеЕслиНеЗаполненоЗначитПринимаетПредыдущееЗначение.Видимость = НЕОбъектИспользоватьТолькоДляЭкспорта;
		Элементы.СоставлятьНаименованиеГруппыРодителяИзИменПолей.Видимость								 = НЕОбъектИспользоватьТолькоДляЭкспорта;
		Элементы.ДляОбновленияСуществующихОбъектов.Видимость											 = НЕОбъектИспользоватьТолькоДляЭкспорта;
		Элементы.ПроОбновлениеСуществующихОбъектов.Видимость											 = НЕОбъектИспользоватьТолькоДляЭкспорта;
		Элементы.СложноеУсловиеДебета.Видимость											 				 = НЕОбъектИспользоватьТолькоДляЭкспорта;
		Элементы.Клиенты.Видимость																	 = НЕОбъектИспользоватьТолькоДляЭкспорта;
		Элементы.ФильтроватьНеподходящиеСимволы.Видимость												 = НЕОбъектИспользоватьТолькоДляЭкспорта;
		Элементы.ПравилаДляДокументов.Видимость 														 = НЕОбъектИспользоватьТолькоДляЭкспорта;
		Элементы.УсловияОперацийСПлатежнымиДокументами.Видимость										 = НЕОбъектИспользоватьТолькоДляЭкспорта;
		Элементы.ДляОбновленияСуществующихОбъектов.Видимость											 = НЕОбъектИспользоватьТолькоДляЭкспорта;
		Элементы.НеУчитыватьПоследнююСтрокуФайла.Видимость												 = НЕОбъектИспользоватьТолькоДляЭкспорта;
		Элементы.ЗначениеПлатежейПриУмолчанию.Видимость													 = НЕОбъектИспользоватьТолькоДляЭкспорта;
		Элементы.СоставлятьНаименованиеПоВыражениюИзИменПолей.Видимость									 = НЕОбъектИспользоватьТолькоДляЭкспорта;
		Элементы.ВсегдаСоздаватьНовыйЭлементИлиДокумент.Видимость										 = НЕОбъектИспользоватьТолькоДляЭкспорта;
		Элементы.ОткрыватьФормуКаждогоЭлементаИлиДокумента.Видимость									 = НЕОбъектИспользоватьТолькоДляЭкспорта;
		Элементы.СоздаватьЭлементыСправочниковВСлучаеИхОтсутствия.Видимость								 = НЕОбъектИспользоватьТолькоДляЭкспорта;
		Элементы.ИспользоватьВКачествеКлючевыхТолькоПоляИзТаблицы.Видимость								 = НЕОбъектИспользоватьТолькоДляЭкспорта;
		Элементы.УстанавливатьТекущуюДатуДляДокументовЕслиНеОпределена.Видимость						 = НЕОбъектИспользоватьТолькоДляЭкспорта;
		Элементы.УстанавливатьДатуДокументамПриИмпортеЕслиНеОпределена.Видимость						 = НЕОбъектИспользоватьТолькоДляЭкспорта;
		Элементы.НомерДокументаУстанавливатьНоНомеруВходящегоИлиИсходящегоДокумента.Видимость			 = НЕОбъектИспользоватьТолькоДляЭкспорта; 
		Элементы.ДополнительноеЗаполнениеРеквизитовПриИмпорте.Видимость									 = НЕОбъектИспользоватьТолькоДляЭкспорта;		
		Элементы.ДопустимоеЧислоПустыхСтрокПриПоискеКонцаФайла.Видимость								 = НЕОбъектИспользоватьТолькоДляЭкспорта;		
		Элементы.ПоследовательностьПолейВФайлеДанноеПолеКлючевоеДляПоискаИЗаписи.Видимость				 = НЕОбъектИспользоватьТолькоДляЭкспорта;		
		Элементы.ЗаголовокБлокаДанных.Видимость															 = НЕОбъектИспользоватьТолькоДляЭкспорта;
		Элементы.УстанавливатьПризнакАвансаДокументамДенежныхСредств.Видимость							 = НЕОбъектИспользоватьТолькоДляЭкспорта;
		
		Элементы.ПопытатьсяПроводитьДокументы.Видимость													 = НЕОбъектИспользоватьТолькоДляЭкспорта;
		
		Элементы.ДобавитьТекстФайлу.Видимость 												= НЕ ОбъектИспользоватьТолькоДляИмпорта;
		Элементы.СообщатьОНедостаточномЗаполненииПриЭкспортеДокументовДляПОБанка.Видимость 	= НЕ ОбъектИспользоватьТолькоДляИмпорта;
		Элементы.ПриЭкспортеПередЗаписью.Видимость											= НЕ ОбъектИспользоватьТолькоДляИмпорта;		
		
	КонецЕсли;
	
	Элементы.ГруппаНовыхКлиентов.Видимость = НЕ ОбъектИспользоватьТолькоДляЭкспорта И Объект.СоздаватьКлиентовПоОКПО;
	Элементы.ОткрыватьФормуДокументовКоторыеНеУдалосьПровести.Видимость = НЕ ОбъектИспользоватьТолькоДляЭкспорта И Объект.ПопытатьсяПроводитьДокументы;
	Элементы.ДопольнительноеПоведение.Видимость = Объект.ИспользоватьДополнительноеПоведение;
	
	ОбъектВыполнятьПрограммы = Объект.ВыполнятьПрограммы;
	Элементы.ОбщийКод.Видимость  		= ОбъектВыполнятьПрограммы;
	Элементы.КодСтрокиДанных.Видимость  = ОбъектВыполнятьПрограммы;
	Элементы.КодПоляДанных.Видимость	= ОбъектВыполнятьПрограммы;
	Элементы.ОтборПоОбъектамСОпределеннымиРеквизитами.Видимость = Объект.ДанныйШаблонИспользоватьТолькоДляОбъектовСОпределеннымиРеквизитами;
	
	МожноСуммироватьДанныеДокументовРасходДСПланПриВыгрузкеДляОдногоКлиентаОтОднойОрганизацииВТеченииСуток = НЕ ОбъектИспользоватьТолькоДляИмпорта И Объект.ОбрабатыватьПлатежныеДокументы = "Планы";
	Элементы.СуммироватьДанныеДокументовРасходДСПланПриВыгрузкеДляОдногоКлиентаОтОднойОрганизацииВТеченииСуток.Видимость = МожноСуммироватьДанныеДокументовРасходДСПланПриВыгрузкеДляОдногоКлиентаОтОднойОрганизацииВТеченииСуток;
	Элементы.ВставлятьМеждуТекстамиНазначенияСледующийТекст.Видимость = Объект.СуммироватьДанныеДокументовРасходДСПланПриВыгрузкеДляОдногоКлиентаОтОднойОрганизацииВТеченииСуток И МожноСуммироватьДанныеДокументовРасходДСПланПриВыгрузкеДляОдногоКлиентаОтОднойОрганизацииВТеченииСуток;
	Элементы.СуммироватьТолькоЕслиПлатежкиСОднимНомером.Видимость = Элементы.ВставлятьМеждуТекстамиНазначенияСледующийТекст.Видимость;
	
	Если Элементы.ПроОбновлениеСуществующихОбъектов.Видимость 
		И Объект.ВидШаблона = Перечисления.ПодсистемаИЭИмпортЭкспортФайловВидыШаблонов.Предопределенный Тогда
		
		Элементы.ДляОбновленияСуществующихОбъектов.Видимость = Ложь;
		Элементы.ПроОбновлениеСуществующихОбъектов.Видимость = Ложь;
		
	КонецЕсли;
	
	Элементы.ОпределенныеЗначенияНовойНоменклатуры.Видимость = Объект.СоздаватьЭлементыСправочникаНоменклатураВСлучаеИхОтсутствия;
	
	Элементы.ИмяТаблицыШаблонаФайла.Доступность = Истина;
	Элементы.ИмяТаблицыШаблонаФайла.Видимость = Истина;
	Элементы.ДанныеИмпортаЭтоРезультатПроизвольногоШаблона.Видимость = Ложь;
	Элементы.НеПропускатьОбъектыПомеченныеНаУдаление.Видимость = Истина;
	Элементы.ИспользоватьТолько.Видимость = Истина;
	Элементы.СоставноеИмя.Видимость = истина;
	
	Если Объект.ВидШаблона = Перечисления.ПодсистемаИЭИмпортЭкспортФайловВидыШаблонов.ДляКарточкиСправочникаИлиШапкиДокумента Тогда
		Элементы.ПравилаДляРаботыСоСписками.Видимость = Ложь;
		Элементы.ПравилаДляРаботыСЗапасами.Видимость = Ложь;
		Элементы.ПравилаДляДокументов.видимость = Истина;
		Элементы.УсловияОперацийСПлатежнымиДокументами.Видимость = Ложь;
		
	ИначеЕсли Объект.ВидШаблона = Перечисления.ПодсистемаИЭИмпортЭкспортФайловВидыШаблонов.ДляОбменаСБанком Тогда
		Элементы.УсловияОперацийСПлатежнымиДокументами.Видимость = Истина;
		Элементы.ПравилаДляРаботыСоСписками.Видимость = Ложь;
		Элементы.ПравилаДляРаботыСЗапасами.Видимость = Ложь;
		Элементы.ПравилаДляДокументов.видимость = Истина;
		Элементы.ИмяТаблицыШаблонаФайла.Видимость = Ложь;
		
	ИначеЕсли Объект.ВидШаблона = Перечисления.ПодсистемаИЭИмпортЭкспортФайловВидыШаблонов.ДляСпискаЭлементовСправочникаИлиДокументов Тогда
		Элементы.ПравилаДляРаботыСоСписками.Видимость = Истина;
		Элементы.ПравилаДляРаботыСЗапасами.Видимость = Истина; //!
		Элементы.ПравилаДляДокументов.видимость = Истина;
		Элементы.УсловияОперацийСПлатежнымиДокументами.Видимость = Ложь;
		
	ИначеЕсли Объект.ВидШаблона = Перечисления.ПодсистемаИЭИмпортЭкспортФайловВидыШаблонов.ДляТаблицыТовары Тогда 
		Элементы.ПравилаДляРаботыСоСписками.Видимость = Истина;
		Элементы.ПравилаДляРаботыСЗапасами.Видимость = Истина;
		Объект.ИмяТаблицыШаблонаФайла = "Товары";
		Элементы.ИмяТаблицыШаблонаФайла.Доступность = Ложь;
		Элементы.ПравилаДляДокументов.Видимость = Ложь;
		Элементы.УсловияОперацийСПлатежнымиДокументами.Видимость = Ложь;
		Элементы.СоставноеИмя.Видимость = Ложь;
		
	ИначеЕсли Объект.ВидШаблона = Перечисления.ПодсистемаИЭИмпортЭкспортФайловВидыШаблонов.ЛюбойВариант Тогда 
		Элементы.ПравилаДляРаботыСоСписками.Видимость = Истина;
		Элементы.ПравилаДляРаботыСЗапасами.Видимость = Истина;
		Элементы.ПравилаДляДокументов.видимость = Истина;
		Элементы.УсловияОперацийСПлатежнымиДокументами.Видимость = Истина;
		
	ИначеЕсли Объект.ВидШаблона = Перечисления.ПодсистемаИЭИмпортЭкспортФайловВидыШаблонов.ДляРегистровСведений Тогда 
		Элементы.ПравилаДляРаботыСоСписками.Видимость = Истина;
		Элементы.ПравилаДляРаботыСЗапасами.Видимость = Ложь;
		Элементы.ПравилаДляДокументов.видимость = Ложь;
		Элементы.УсловияОперацийСПлатежнымиДокументами.Видимость = Ложь;
		Элементы.ИмяТаблицыШаблонаФайла.Видимость = Ложь;
		Элементы.ИмяРегистра.Видимость = Истина;
		
	ИначеЕсли Объект.ВидШаблона = Перечисления.ПодсистемаИЭИмпортЭкспортФайловВидыШаблонов.РезультатПроизвольногоЗапроса Тогда 
		Элементы.ДанныеИмпортаЭтоРезультатПроизвольногоШаблона.Видимость = Истина;
		Элементы.УсловияОперацийСПлатежнымиДокументами.Видимость = Ложь;
		Элементы.ПравилаДляРаботыСЗапасами.Видимость = Ложь;
		Элементы.ПравилаДляДокументов.видимость = Ложь;
		Элементы.УсловияОперацийСПлатежнымиДокументами.Видимость = Ложь;
		Элементы.НеПропускатьОбъектыПомеченныеНаУдаление.Видимость = Ложь;
		Элементы.ИспользоватьТолько.Видимость = Ложь;
		Элементы.ИмяТаблицыШаблонаФайла.Доступность = Ложь;
		Элементы.ИмяТаблицыШаблонаФайла.Видимость = Ложь;
		Элементы.ПравилаДляРаботыСоСписками.Видимость = Ложь;
		
	Иначе //предопределенный 
		Элементы.УсловияОперацийСПлатежнымиДокументами.Видимость = Ложь;
		Элементы.ПравилаДляРаботыСоСписками.Видимость = Истина;
		Элементы.ПравилаДляРаботыСЗапасами.Видимость = Истина;
		Элементы.ИмяТаблицыШаблонаФайла.Доступность = Ложь;
		Элементы.ПравилаДляДокументов.видимость = Истина;
		
	КонецЕсли;
	
	Элементы.ДобавлятьПустыеСтрокиМеждуПлатежами.Видимость = Объект.КаждоеПолеНоваяСтрока;
	Элементы.ЗнакМеждуИменемПоляИЗначением.Видимость 	= Объект.КаждоеПолеНоваяСтрока;
	Элементы.ПараметрыЗаголовкаБлокаДанных.Видимость 	= Объект.ИспользоватьЗаголовкиБлоковДанных;
	Элементы.ДополнительноЗаполнятьРеквизиты.Видимость 	= Объект.ДополнительноеЗаполнениеРеквизитовПриИмпорте И НЕ Объект.ИспользоватьТолькоДляЭкспорта;
	Элементы.СоставноеИмя.Видимость = Объект.СоздаватьЭлементыСправочникаНоменклатураВСлучаеИхОтсутствия ИЛИ Объект.ДляОбновленияСуществующихОбъектов; 
	
	Попытка 
		ДополнительныеМеханизмыУчетаИАнализаНоменклатуры = Ложь;
		Выполнить("ДополнительныеМеханизмыУчетаИАнализаНоменклатуры = ПолучитьФункциональнуюОпцию(Метаданные.ФункциональныеОпции.ПодсистемаИЭДополнительныеМеханизмыУчетаИАнализаНоменклатуры);");
		Элементы.Производитель.Видимость 					= ДополнительныеМеханизмыУчетаИАнализаНоменклатуры;
		Элементы.СоздаватьМаркиНоменклатуры.Видимость			= ДополнительныеМеханизмыУчетаИАнализаНоменклатуры;
		Элементы.СоздаватьМетодыПолученияНоменклатуры.Видимость = ДополнительныеМеханизмыУчетаИАнализаНоменклатуры;
		
	Исключение 
		Элементы.Производитель.Видимость					= Ложь;
		Элементы.СоздаватьМаркиНоменклатуры.Видимость			= Ложь;
		Элементы.СоздаватьМетодыПолученияНоменклатуры.Видимость	= Ложь;
		
	КонецПопытки;
	
	Элементы.ЕслиКлиентНеНайденПриИмпортеОткрыватьПодборИзСуществующих.Видимость = Объект.СоздаватьКлиентовПоОКПО;
	
КонецПроцедуры //УстановитьВидимостьДоступность()

&НаКлиенте
Процедура ОценитьОбъектБазыДанных(Команда)
	
	Если Объект.ПоследовательностьПолейВФайле.Количество() = 0 
		ИЛИ Вопрос(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Вы готовы очистить поля шаблона?"), РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		
		ПараметрыФормы = Новый Структура("ТипОбъектаОбмена","");
		ФормаВыбораТипа = ПолучитьФорму("Справочник.ПодсистемаИЭИмпортЭкспортФСШаблоны.Форма.ФормаВыбораТипаОбъектаБазыДанных", ПараметрыФормы);
		ФормаВыбораТипа.ОткрытьМодально();
		
		ТипОбъектаОбмена = ФормаВыбораТипа.ТипОбъектаОбмена;
		Если ЗначениеЗаполнено(ТипОбъектаОбмена) Тогда
			
			Если Лев(ТипОбъектаОбмена, 1) = "Д" Тогда
				ТипМета = "Документы";
			Иначе
				ТипМета = "Справочники";
			КонецЕсли;
			
			ТипОбъектаОбмена = Прав(ТипОбъектаОбмена, стрДлина(ТипОбъектаОбмена) - 1);
			Если Вопрос(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Оценить таблицу объекта") + " " + ТипОбъектаОбмена + "? (НЕТ - сам объект)", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
				ПараметрыФормы = Новый Структура("ТипОбъектаОбмена", ТипОбъектаОбмена);
				ПараметрыФормы.Вставить("ТипМета", ТипМета);
				ФормаВыбораТипа = ПолучитьФорму("Справочник.ПодсистемаИЭИмпортЭкспортФСШаблоны.Форма.ФормаВыбораТабличнойЧасти", ПараметрыФормы);
				ФормаВыбораТипа.ОткрытьМодально();
				ТаблицаОбъектаОбмена = ФормаВыбораТипа.ИмяТабличнойЧасти;
				Объект.ИмяТаблицыШаблонаФайла = ТаблицаОбъектаОбмена;
			Иначе 
				ТаблицаОбъектаОбмена = "";
			КонецЕсли;
			
			Объект.ПоследовательностьПолейВФайле.Очистить();
			Если Вопрос(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Создавать поля шаблона, согласно данных реквизитов объекта базы данных?"), РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
				СоздаватьПоляШаблона = Истина;
			Иначе
				СоздаватьПоляШаблона = Ложь;
			КонецЕсли;
			
			ОценитьОбъектНаСервере(ТипМета, ТипОбъектаОбмена, ТаблицаОбъектаОбмена, СоздаватьПоляШаблона);
			
			Объект.Комментарий = Сокрлп(Объект.Комментарий) + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке(" По оценке объекта базы данных") + " " + ТипОбъектаОбмена + " " + ТаблицаОбъектаОбмена;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОценитьОбъектНаСервере(ТипМета, ТипОбъектаОбмена, ТаблицаОбъектаОбмена, СоздаватьПоляШаблона, РежимЗаполнения = 0)
	
	ОбъектШаблон = РеквизитФормыВЗначение("Объект");
	
	ПодсистемаИЭИмпортЭкспортФС.ПроизвестиОценкуОбъектаБазыДанных(ОбъектШаблон, ТипМета, ТипОбъектаОбмена, ТаблицаОбъектаОбмена, СоздаватьПоляШаблона, РежимЗаполнения); 
	
	ЗначениеВРеквизитФормы(ОбъектШаблон, "Объект");
	
КонецПроцедуры //ОценитьОбъектНаСервере

&НаКлиенте
Процедура ПоказыватьПрогрессПроизводстваОбменаПриИзменении(Элемент)
	
	УстановитьДоступностьПрогрессПроизводстваОбмена();
	
КонецПроцедуры

Процедура УстановитьДоступностьПрогрессПроизводстваОбмена()
	
	Если Объект.ПоказыватьПрогрессПроизводстваОбмена Тогда
		Элементы.РасчитыватьСрокОкончанияОбмена.Доступность = Истина;
		Элементы.ПоказыватьОбъектыОбмена.Доступность = Истина;
	Иначе
		Элементы.РасчитыватьСрокОкончанияОбмена.Доступность = Ложь;
		Элементы.ПоказыватьОбъектыОбмена.Доступность = Ложь;
	КонецЕсли;
	
	Если Объект.ПоказыватьОбъектыОбмена и Элементы.ПоказыватьОбъектыОбмена.Доступность Тогда
		Элементы.НеЗакрыватьОкноПеречняОбъектовОбмена.Видимость = Истина;
	Иначе
		Элементы.НеЗакрыватьОкноПеречняОбъектовОбмена.Видимость = Ложь;
	КонецЕсли;
	УстановитьВидимостьДоступность();
	
КонецПроцедуры //УстановитьДоступностьПрогрессПроизводстваОбмена

&НаКлиенте
Процедура ПоказыватьОбъектыОбменаПриИзменении(Элемент)
	
	УстановитьДоступностьПрогрессПроизводстваОбмена();
	
КонецПроцедуры

&НаКлиенте
Процедура УсловияФильтраНомерПоляПриИзменении(Элемент)
	
	Попытка 
		Элементы.УсловияФильтра.ТекущиеДанные.ИмяПоля = СокрЛП(Объект.ПоследовательностьПолейВФайле[элементы.УсловияФильтра.ТекущиеДанные.номерполя - 1].ПолеТаблицы);
		
	Исключение Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Произошла ошибка:") + " " + ОписаниеОшибки();
		Сообщение.Поле = "ИмяПоля";
		Сообщение.УстановитьДанные(Объект);
		Сообщение.Сообщить();
		
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздаватьЭлементыСправочниковВСлучаеИхОтсутствияПриИзменении(Элемент)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура КаждоеПолеНоваяСтрокаПриИзменении(Элемент)
	
	Элементы.ДобавлятьПустыеСтрокиМеждуПлатежами.Видимость = Объект.КаждоеПолеНоваяСтрока;
	Элементы.ЗнакМеждуИменемПоляИЗначением.Видимость = Объект.КаждоеПолеНоваяСтрока;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭтоПлатежныйдокументПриИзменении(Элемент)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ТолькоРасходныеПриИзменении(Элемент)
	
	Если Объект.ТолькоРасходные Тогда
		Объект.ТолькоПриходные = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТолькоПриходныеПриИзменении(Элемент)
	
	Если Объект.ТолькоПриходные Тогда
		Объект.ТолькоРасходные = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьЗаголовкиБлоковДанныхПриИзменении(Элемент)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаголовокБлокаДанныхШаблонаПолеТаблицыПриИзменении(Элемент)
	
	Элементы.ЗаголовокБлокаДанныхШаблона.ТекущиеДанные.КомментарийПоля = ИзменитьКомментарий(Элементы.ЗаголовокБлокаДанныхШаблона.ТекущиеДанные.ПолеТаблицы);
	
	Если НЕ Объект.ФорматФайла = ПредопределенноеЗначение("Перечисление.ПодсистемаИЭИмпортЭкспортФорматыФайлов.DBF") 
		и НЕ ЗначениеЗаполнено(Элементы.ЗаголовокБлокаДанныхШаблона.ТекущиеДанные.ИмяПоляВФайле) ТОгда
		
		Элементы.ЗаголовокБлокаДанныхШаблона.ТекущиеДанные.ИмяПоляВФайле = ИзменитьИмяПоляВФайле(Элементы.ЗаголовокБлокаДанныхШаблона.ТекущиеДанные.ПолеТаблицы); 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьДополнительноПоведениеШаблонаПриИзменении(Элемент)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнятьПрограммыПриИзменении(Элемент)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ВсегдаСоздаватьНовыйЭлементИлиДокументПриИзменении(Элемент)
	
	Если Объект.ДляОбновленияСуществующихОбъектов 
		И Объект.ВсегдаСоздаватьНовыйЭлементИлиДокумент Тогда
		
		Объект.ДляОбновленияСуществующихОбъектов = Ложь; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДляОбновленияСуществующихОбъектовПриИзменении(Элемент)
	
	Если Объект.ДляОбновленияСуществующихОбъектов 
		И Объект.ВсегдаСоздаватьНовыйЭлементИлиДокумент Тогда
		
		Объект.ВсегдаСоздаватьНовыйЭлементИлиДокумент = Ложь; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныйШаблонИспользоватьТолькоДляОбъектовСОпределеннымиРеквизитамиПриИзменении(Элемент)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбрабатыватьПлатежныеДокументыПриИзменении(Элемент)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура СуммироватьДанныеДокументовРасходДСПланПриВыгрузкеДляОдногоКлиентаОтОднойОрганизацииВТеченииСутокПриИзменении(Элемент)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоРеквизитамОбъектаБазыДанных(Команда)
	
	ПараметрыФормы = Новый Структура("ТипОбъектаОбмена","");
	ФормаВыбораТипа = ПолучитьФорму("Справочник.ПодсистемаИЭИмпортЭкспортФСШаблоны.Форма.ФормаВыбораТипаОбъектаБазыДанных", ПараметрыФормы);
	ФормаВыбораТипа.ОткрытьМодально();
	
	ТипОбъектаОбмена = ФормаВыбораТипа.ТипОбъектаОбмена;
	Если ЗначениеЗаполнено(ТипОбъектаОбмена) Тогда
		
		Если Лев(ТипОбъектаОбмена, 1) = "Д" Тогда
			ТипМета = "Документы";
		Иначе
			ТипМета = "Справочники";
		КонецЕсли;
		
		ТипОбъектаОбмена = Прав(ТипОбъектаОбмена, стрДлина(ТипОбъектаОбмена) - 1);
		Если Вопрос(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Оценить таблицу объекта") + " " + ТипОбъектаОбмена + "? (НЕТ - сам объект)", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			
			ПараметрыФормы = Новый Структура("ТипОбъектаОбмена", ТипОбъектаОбмена);
			ПараметрыФормы.Вставить("ТипМета", ТипМета);
			ФормаВыбораТипа = ПолучитьФорму("Справочник.ПодсистемаИЭИмпортЭкспортФСШаблоны.Форма.ФормаВыбораТабличнойЧасти", ПараметрыФормы);
			ФормаВыбораТипа.ОткрытьМодально();
			
			ТаблицаОбъектаОбмена = ФормаВыбораТипа.ИмяТабличнойЧасти;
		Иначе 
			ТаблицаОбъектаОбмена = "";
		КонецЕсли;
		
		ОценитьОбъектНаСервере(ТипМета, ТипОбъектаОбмена, ТаблицаОбъектаОбмена, Ложь, 1);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТаблицуОтбора(Команда)
	
	Если Объект.ТолькоДляОбъектовСРеквизитами.Количество() > 0
		И Вопрос(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Вы готовы очистить таблицу отбора по реквизитам?"), РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		
		Объект.ТолькоДляОбъектовСРеквизитами.Очистить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТаблицуРеквизитов(Команда)
	
	Если Объект.ДополнительноеЗаполнениеРеквизитов.Количество() > 0 
		И Вопрос(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Вы готовы очистить таблицу дополнительных реквизитов?"), РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		
		Объект.ДополнительноеЗаполнениеРеквизитов.Очистить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоРеквизитамКоманда(Команда)
	
	ПараметрыФормы = Новый Структура("ТипОбъектаОбмена","");
	ФормаВыбораТипа = ПолучитьФорму("Справочник.ПодсистемаИЭИмпортЭкспортФСШаблоны.Форма.ФормаВыбораТипаОбъектаБазыДанных", ПараметрыФормы);
	ФормаВыбораТипа.ОткрытьМодально();
	
	ТипОбъектаОбмена = ФормаВыбораТипа.ТипОбъектаОбмена;
	Если ЗначениеЗаполнено(ТипОбъектаОбмена) Тогда
		
		Если Лев(ТипОбъектаОбмена, 1) = "Д" Тогда
			ТипМета = "Документы";
		Иначе
			ТипМета = "Справочники";
		КонецЕсли;
		
		ТипОбъектаОбмена = Прав(ТипОбъектаОбмена, стрДлина(ТипОбъектаОбмена) - 1);
		Если Вопрос(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Оценить таблицу объекта") + " " + ТипОбъектаОбмена + "? (НЕТ - сам объект)", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			
			ПараметрыФормы = Новый Структура("ТипОбъектаОбмена", ТипОбъектаОбмена);
			ПараметрыФормы.Вставить("ТипМета", ТипМета);
			ФормаВыбораТипа = ПолучитьФорму("Справочник.ПодсистемаИЭИмпортЭкспортФСШаблоны.Форма.ФормаВыбораТабличнойЧасти", ПараметрыФормы);
			ФормаВыбораТипа.ОткрытьМодально();
			
			ТаблицаОбъектаОбмена = ФормаВыбораТипа.ИмяТабличнойЧасти;			
		Иначе 
			ТаблицаОбъектаОбмена = "";
		КонецЕсли;
		
		ОценитьОбъектНаСервере(ТипМета, ТипОбъектаОбмена, ТаблицаОбъектаОбмена, Ложь, 2);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрыватьФормуДокументовКоторыеНеУдалосьПровестиПриИзменении(Элемент)
	
	Если Объект.ОткрыватьФормуДокументовКоторыеНеУдалосьПровести Тогда
		Объект.ОткрыватьФормуКаждогоЭлементаИлиДокумента = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрыватьФормуКаждогоЭлементаИлиДокументаПриИзменении(Элемент)
	
	Если Объект.ОткрыватьФормуКаждогоЭлементаИлиДокумента Тогда
		Объект.ОткрыватьФормуДокументовКоторыеНеУдалосьПровести = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстанавливатьДатуДокументамПриИмпортеЕслиНеОпределенаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.УстанавливатьДатуДокументамПриИмпортеЕслиНеОпределена) Тогда
		Объект.УстанавливатьТекущуюДатуДляДокументовЕслиНеОпределена = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстанавливатьТекущуюДатуДляДокументовЕслиНеОпределенаПриИзменении(Элемент)
	
	Если Объект.УстанавливатьТекущуюДатуДляДокументовЕслиНеОпределена Тогда
		Объект.УстанавливатьДатуДокументамПриИмпортеЕслиНеОпределена = '00010101';
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПоляДляПроизвольногоЗапроса(Команда)
	
	СоздатьПоляДляПроизвольноЗапросаНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьПоляДляПроизвольноЗапросаНаСервере(Режим = 0)
	
	ДатаНачала = ОбщийМодульСервисСервер.ПользователяТекущаяДата();
	ЗапросПроизвольный = Новый Запрос;
	ЗапросПроизвольный.Текст = СтрЗаменить(Объект.ТекстПроизвольногоЗапроса, "|", " ");
	ВыборкаОбъектов = Неопределено;
	
	Для каждого ПараметрЗапроса Из Объект.ПараметрыПроизвольногоЗапроса Цикл    
		ПараметрЗапросаНаименованиеПараметра = СтрЗаменить(СокрЛП(ПараметрЗапроса.НаименованиеПараметра), " ", "");
		ПараметрЗапросаНаименованиеПараметра = СтрЗаменить(ПараметрЗапросаНаименованиеПараметра, ".", "");
		ЗапросПроизвольный.УстановитьПараметр(ПараметрЗапроса.НаименованиеПараметра, ПараметрЗапроса.ЗначениеПараметра);
	КонецЦикла;
	
	ВзДС = ЗапросПроизвольный.Выполнить();
	Если Не ВзДС.Пустой() Тогда
		Если Режим = 1 Тогда
			СчетчикПолей = 0;
			Для Каждого КолонкаРезультата Из ВзДС.Колонки Цикл
				
				СчетчикПолей = СчетчикПолей + 1;
				НовоеПолеПоследовательности = Объект.ПоследовательностьПолейВФайле.Добавить();
				НовоеПолеПоследовательности.ПолеТаблицы  = БыстроСоздатьНовоеПолеНаСервере(КолонкаРезультата.Имя, КолонкаРезультата.ТипЗначения);
				НовоеПолеПоследовательности.КомментарийПоля = НовоеПолеПоследовательности.ПолеТаблицы.Комментарий;
				
				Если НЕ Объект.ФорматФайла = ПредопределенноеЗначение("Перечисление.ПодсистемаИЭИмпортЭкспортФорматыФайлов.DBF") Тогда
					НовоеПолеПоследовательности.ИмяПоляВФайле = НовоеПолеПоследовательности.ПолеТаблицы.ЗаголовокПоляПоУмолчанию; 	
				КонецЕсли;
			КонецЦикла;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Было создано:") + " " + СчетчикПолей + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке(" полей в последовательности.");
			Сообщение.УстановитьДанные(Объект);
			Сообщение.Сообщить();
			
		Иначе	
			ВыборкаОбъектов = ВзДС.Выбрать(); 	
		КонецЕсли;
		
	КонецЕсли;
	
	Если не ВыборкаОбъектов = Неопределено Тогда
		ВыборкаОбъектов.Следующий();
		
		Сообщение = Новый СообщениеПользователю;
		разницаВремени = ОбщийМодульСервисСервер.ПользователяТекущаяДата() - ДатаНачала;
		Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Всего в результате запроса:") + " " + ВыборкаОбъектов.Количество() + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке(" записе. Выполнен за") + " " + разницаВремени + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке(" сек.");
		Сообщение.УстановитьДанные(Объект);
		Сообщение.Сообщить();
		
		Для Каждого ПолеВФайле Из Объект.ПоследовательностьПолейВФайле Цикл
			ИмяПоляВФайле = СокрЛП(ПолеВФайле.ИмяПоляВФайле);
			Попытка 
				Выполнить(" Результат = ВыборкаОбъектов." + ИмяПоляВФайле + ";");
				
			Исключение 	
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Произошла ошибка обращения к результату запроса поля:") + " " + ИмяПоляВФайле + " - " + ОписаниеОшибки();
				Сообщение.УстановитьДанные(Объект);
				Сообщение.Сообщить();
				
			КонецПопытки;
		КонецЦикла;
		
	ИначеЕсли Режим = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Нет результата запроса!");
		Сообщение.УстановитьДанные(Объект);
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагружатьВсеФайлыИзПапкиПриИзменении(Элемент)
	
	Если Объект.ЗагружатьВсеФайлыИзПапки Тогда
		
		Объект.ВестиЖурналИмпортноЭкспортныхОпераций = Истина;
		Объект.ИспользоватьТолькоДляИмпорта = Истина;
		
	КонецЕсли;
	
	УстановитьВидимостьДоступность();	
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительноеЗаполнениеРеквизитовПриИмпортеПриИзменении(Элемент)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура НеИспользоватьДанноеПоле(Команда)
	
	Элементы.ПоследовательностьПолейВФайле.ТекущиеДанные.ПолеТаблицы =  ПолеПропуска();
	ПриИзмененииПоля();
	
КонецПроцедуры

&НаСервере
Функция   ПолеПропуска()	
	Возврат Справочники.ПодсистемаИЭИмпортЭкспортФСПоля.ПропуститьДанноеПоле;	
КонецФункции //ПолеПропуска

&НаКлиенте
Процедура БыстроСоздатьНовоеПоле(Команда)
	
	НаименованиеПоля = "";
	ВвестиСтроку(НаименованиеПоля, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите наименование нового поля: "), 100);
	
	Элементы.ПоследовательностьПолейВФайле.ТекущиеДанные.ПолеТаблицы =  БыстроСоздатьНовоеПолеНаСервере(НаименованиеПоля);
	ПриИзмененииПоля(Истина);
	
КонецПроцедуры

&НаСервере
Функция   БыстроСоздатьНовоеПолеНаСервере(НаименованиеПоля, ТипПоля = Неопределено)
	
	НовоеПоле = Справочники.ПодсистемаИЭИмпортЭкспортФСПоля.СоздатьЭлемент();
	Если ТипПоля = Неопределено Тогда
		НовоеПоле.ДлинаТут = 100;
		НовоеПоле.ТипТут = "S";
		НовоеПоле.ТочностьТут = 0;
		
	Иначе
		Если ТипПоля = Тип("Строка") Тогда
			НовоеПоле.ДлинаТут = 100;
			НовоеПоле.ТипТут = "S";
			НовоеПоле.ТочностьТут = 0;
			
		ИначеЕсли  ТипПоля = Тип("Число") Тогда
			НовоеПоле.ДлинаТут = 16;
			НовоеПоле.ТипТут = "N";
			НовоеПоле.ТочностьТут = 2;
			
		ИначеЕсли  ТипПоля = Тип("Дата") Тогда
			НовоеПоле.ДлинаТут = 8;
			НовоеПоле.ТипТут = "D";
			НовоеПоле.ТочностьТут = 0;
			
		ИначеЕсли  ТипПоля = Тип("Булево") Тогда
			НовоеПоле.ДлинаТут = 1;
			НовоеПоле.ТипТут = "L";
			НовоеПоле.ТочностьТут = 0;
			
		Иначе
			НовоеПоле.ДлинаТут = 100;
			НовоеПоле.ТипТут = "S";
			НовоеПоле.ТочностьТут = 0;
			
		КонецЕсли;
	КонецЕсли;
	
	НовоеПоле.ЗаголовокПоляПоУмолчанию = СтрЗаменить(НаименованиеПоля, " ", "");
	НовоеПоле.Комментарий = НаименованиеПоля;
	НовоеПоле.Наименование = СтрЗаменить(НаименованиеПоля, " ", "");
	//НовоеПоле.ОпределенноеЗначение =
	//НовоеПоле.ПолеПринадлежитОбъектуТаблицы =
	//НовоеПоле.Родитель =
	
	Попытка //Записи НовоеПоле
		НовоеПоле.Записать();
		Возврат НовоеПоле.Ссылка;
		
	Исключение //Записи НовоеПоле
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ошибка при попытке записи справочника:") + " " + НовоеПоле + " " + ОписаниеОшибки();
		Сообщение.УстановитьДанные(Объект);
		Сообщение.Сообщить();
		Возврат Справочники.ПодсистемаИЭИмпортЭкспортФСПоля.ПустаяСсылка();
		
	КонецПопытки; //Записи НовоеПоле
	
КонецФункции //БыстроСоздатьНовоеПолеНаСервере

&НаКлиенте
Процедура ПриИзмененииПоля(Обязательно = Ложь) 
	
	Элементы.ПоследовательностьПолейВФайле.ТекущиеДанные.КомментарийПоля = ИзменитьКомментарий(Элементы.ПоследовательностьПолейВФайле.ТекущиеДанные.ПолеТаблицы);
	
	Если Обязательно 
		ИЛИ (НЕ ЗначениеЗаполнено(Элементы.ПоследовательностьПолейВФайле.ТекущиеДанные.ИмяПоляВФайле)) ТОгда
		
		Если Объект.ФорматФайла = ПредопределенноеЗначение("Перечисление.ПодсистемаИЭИмпортЭкспортФорматыФайлов.DBF") Тогда
			Элементы.ПоследовательностьПолейВФайле.ТекущиеДанные.ИмяПоляВФайле = ПодсистемаИЭИмпортЭкспортФС.ПеревестиСтрокуВЛатинскиеСимволы(ИзменитьИмяПоляВФайле(Элементы.ПоследовательностьПолейВФайле.ТекущиеДанные.ПолеТаблицы)); 
		Иначе
			Элементы.ПоследовательностьПолейВФайле.ТекущиеДанные.ИмяПоляВФайле = ИзменитьИмяПоляВФайле(Элементы.ПоследовательностьПолейВФайле.ТекущиеДанные.ПолеТаблицы); 
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры //ПриИзмененииПоля

&НаКлиенте
Процедура СоздатьПоляФайлаПоРезультатамЗапроса(Команда)
	
	СоздатьПоляДляПроизвольноЗапросаНаСервере(1);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПараметрыИзТекстаЗапроса(Команда)
	
	ЗагрузитьПараметрыИзТекстаЗапросаНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПараметрыИзТекстаЗапросаНаСервере()
	
	ТекстПроизвольногоЗапроса = Объект.ТекстПроизвольногоЗапроса;
	
	НачалоПараметра = 1;
	ЧислоИтераций = 0;
	Пока НЕ НачалоПараметра = 0 
		И ЧислоИтераций < 99 Цикл
		
		ЧислоИтераций = ЧислоИтераций + 1;
		
		НачалоПараметра = Найти(ТекстПроизвольногоЗапроса, "&");
		
		Если Не НачалоПараметра = 0 Тогда
			ТекстПроизвольногоЗапроса = Сред(ТекстПроизвольногоЗапроса, НачалоПараметра + 1);
			КонецПараметра = Найти(ТекстПроизвольногоЗапроса, Символы.ВТаб);
			Если КонецПараметра = 0 Тогда 	
				КонецПараметра = Найти(ТекстПроизвольногоЗапроса, "");
				Если КонецПараметра = 0 Тогда 	  
					КонецПараметра = Найти(ТекстПроизвольногоЗапроса, Символы.ПС);
					Если КонецПараметра = 0 Тогда 	  
						КонецПараметра = Найти(ТекстПроизвольногоЗапроса, Символы.Таб);						
						Если КонецПараметра = 0 Тогда 	
							КонецПараметра = Найти(ТекстПроизвольногоЗапроса, Символы.НПП);	
							Если КонецПараметра = 0 Тогда 	
								КонецПараметра = Найти(ТекстПроизвольногоЗапроса, " ");
								Если КонецПараметра = 0 Тогда 	
									КонецПараметра = Найти(ТекстПроизвольногоЗапроса, ",");									
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;	
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Если Не КонецПараметра = 0 Тогда 	
				НовыйПараметрНаименованиеПараметра = Лев(ТекстПроизвольногоЗапроса, КонецПараметра);
				ПараметрыОтбора = Новый Структура("НаименованиеПараметра", НовыйПараметрНаименованиеПараметра);
				МассивНайденного = Объект.ПараметрыПроизвольногоЗапроса.НайтиСтроки(ПараметрыОтбора);
				если МассивНайденного.Количество() = 0 Тогда
					НовыйПараметр = Объект.ПараметрыПроизвольногоЗапроса.Добавить();
					НовыйПараметр.НаименованиеПараметра = НовыйПараметрНаименованиеПараметра;	
				КонецЕсли;
				ТекстПроизвольногоЗапроса = Сред(ТекстПроизвольногоЗапроса, КонецПараметра);
			Иначе
				НовыйПараметр = Объект.ПараметрыПроизвольногоЗапроса.Добавить();
				НовыйПараметр.НаименованиеПараметра = ТекстПроизвольногоЗапроса;
				НачалоПараметра = 0;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры //ЗагрузитьПараметрыИзТекстаЗапросаНаСервере()

&НаКлиенте
Процедура СоздаватьКлиентовПоОКПОПриИзменении(Элемент)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПроизвольногоЗапросаНаименованиеПараметраПриИзменении(Элемент)
	
	Элементы.ПараметрыПроизвольногоЗапроса.НаименованиеПараметра = СокрЛП(Элементы.ПараметрыПроизвольногоЗапроса.НаименованиеПараметра);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВыгрузку(Команда)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		СтруктураИмпортаЭкспорта = ПодсистемаИЭИмпортЭкспортФСКлиент.СоздатьСтруктуруВызоваИмпЭкспОперации(
		неопределено, 
		Объект.Ссылка, 
		Истина, 
		Объект.АдресФайла, 
		"С",
		"",
		,
		неопределено);
		
		ТипМета = "СправочникСсылка";
		
		ТипОбъектаОперации = "";//Прав(ЗадачаОбмена.ТипОбъектаОперации, стрДлина(ЗадачаОбмена.ТипОбъектаОперации) - 1);
		СтруктураИмпортаЭкспорта.ТипМетаОбъектаОбмена = ТипМета;
		СтруктураИмпортаЭкспорта.ТипОбъектаОперации = ТипОбъектаОперации;
		Если Объект.ИмяТаблицыШаблонаФайла = "" Тогда 
			СтруктураИмпортаЭкспорта.ИмяТаблицыШаблонаФайла = "LISTofALL";	
		Иначе
			СтруктураИмпортаЭкспорта.ИмяТаблицыШаблонаФайла = Объект.ИмяТаблицыШаблонаФайла;
		КонецЕсли;
		
		СтруктураИмпортаЭкспорта.АдресФайла = Объект.АдресФайла;
		
		СтруктураИмпортаЭкспорта.ОбъектОперации = Неопределено ;
		
		ПодсистемаИЭИмпортЭкспортФСКлиент.ИмпортЭкспортОбработкаОбмена(СтруктураИмпортаЭкспорта);
		
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Объект не записан!");
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьЭтотШаблонВФайл(Команда)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ДиалогВыбФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
		ДиалогФильтр = "Файл (ieUNFSH0.DBf)|ieUNFSH0.DBf";
		ДиалогРасширение = "DBf";
		ДиалогВыбФайла.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Выберите файл для экспорта шаблона:");
		//ДиалогВыбФайла.ПолноеИмяФайла = ПодсистемаИЭИмпортЭкспортФС.КонстантыОтносительныйАдресФайловПолучить() + "ieUNFSH0.DBf";
		ДиалогВыбФайла.ПолноеИмяФайла = "ieUNFSH0.DBf";
		ДиалогВыбФайла.Фильтр = ДиалогФильтр;
		ДиалогВыбФайла.Расширение = ДиалогРасширение;
		ДиалогВыбФайла.МножественныйВыбор = Ложь;
		ДиалогВыбФайла.ПредварительныйПросмотр = Истина;
		ДиалогВыбФайла.ИндексФильтра = 0;
		ДиалогВыбФайла.ПроверятьСуществованиеФайла = Ложь;
		
		Если ДиалогВыбФайла.Выбрать() Тогда
			АдресФайла = ДиалогВыбФайла.ПолноеИмяФайла;
			ПодсистемаИЭИмпортЭкспортФС.ВыполнитьВыгрузкуШаблоновНаСервере(АдресФайла, Объект.Ссылка);
		КонецЕсли; //когда файл АдресФайла выбран
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяРегистраНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокРС = ПолучитьСписокРегистровСведений();
	Объект.ИмяРегистра  = СписокРС.ВыбратьЭлемент("Укажите регистр сведений:");
	
КонецПроцедуры

&НаСервере
Функция   ПолучитьСписокРегистровСведений()
	
	СписокРС = Новый СписокЗначений;
	
	Для Каждого Регистр из Метаданные.РегистрыСведений Цикл 	
		СписокРС.Добавить(СокрЛП(Регистр.Имя));
	КонецЦикла;	
	
	СписокРС.СортироватьПоЗначению();
	
	Возврат СписокРС;
	
КонецФункции

&НаКлиенте
Процедура ПриЗакрытии()
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1, Объект.Ссылка, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	глЧислоОбъектов = глЧислоОбъектов + 1; глПроверятьСообщения = Истина;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("002700", ЭтаФорма, Отказ, Объект);	
	
	Если НЕ ОТказ ТОгда
		ПоддержкаДругихЯзыков = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ПоддерживатьИныеЯзыкиКромеРусского") 
		И ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ПоддерживатьНаименованияНаДругихЯзыкахКромеРусского", Истина);
		
		если ПоддержкаДругихЯзыков 
			и ЗначениеЗаполнено(Объект.Ссылка) тогда
			
			Наименование = ОбщийМодульПовтор.получитьПредставлениеНаЯзыке(объект.Ссылка);
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗначенияНаДругихЯзыках.Язык,
			|	ЗначенияНаДругихЯзыках.НаЯзыке,
			|	ЗначенияНаДругихЯзыках.Поле
			|ИЗ
			|	РегистрСведений.ЗначенияНаДругихЯзыках КАК ЗначенияНаДругихЯзыках
			|ГДЕ
			|	ЗначенияНаДругихЯзыках.ОбъектБазыДанных = &ОбъектБазыДанных";
			
			Запрос.УстановитьПараметр("ОбъектБазыДанных", Объект.Ссылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			если не РезультатЗапроса.Пустой() тогда
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					Если ВыборкаДетальныеЗаписи.Поле = "Наименование" Тогда
						СтрокаЯзыка = НаименованияНаДругихЯзыках.Добавить();
						СтрокаЯзыка.Язык 	= ВыборкаДетальныеЗаписи.Язык;
						СтрокаЯзыка.НаЯзыке = ВыборкаДетальныеЗаписи.НаЯзыке;	
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
			
		иначе
			Наименование = объект.Наименование;
			
		КонецЕсли;	
		
		Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
			//	Объект.ПоказыватьПрогрессПроизводстваОбмена = Истина;
		КонецЕсли;
		
		КодДляСправки = "Общие:
		| ШаблонФайла
		| ПериодДляДокументов
		| ИмяТаблицыШаблонаФайла
		| ЭтоЗагрузкаСписка
		| ШаблонФайлаВидШаблонаДляРегистровСведений
		| ШаблонФайлаУстанавливатьФлагОбменаЗагрузки
		| ЭксельФайлИмпортаЭкспорта / БазаДБФФайлИмпортаЭкспорта
		| 
		| Для строки данных: 
		| МассивДанныхСтрокиФайла[0]
		| СтрокаТаблицыИлиЭлемент
		| ОбъектОперации
		| ОтказВЗаписи
		| 
		| Для поля:
		| СледующееПолеВФайле
		| СледующееПолеВФайле.ПолеТаблицы
		| СледующееПолеВФайле.ДанноеПолеКлючевоеДляПоискаИЗаписи
		| СледующееПолеВФайле.ЕслиНеЗаполненоЗначитПринимаетПредыдущееЗначение
		| СледующееПолеВФайле.НомерСтроки
		| ИмяПоляВФайлеИзТаблицы";	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	объект.Наименование = Наименование;
	НаименованиеИзменяли = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеНаДругихЯзыках(Команда)
	Элементы.НаименованияНаДругихЯзыках.Видимость  = НЕ Элементы.НаименованияНаДругихЯзыках.Видимость;
КонецПроцедуры

&НаКлиенте
Процедура НаименованияНаДругихЯзыкахНаЯзыкеПриИзменении(Элемент)
	БылиИзмененияЗначенияПолейНаЯзыках = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НаименованияНаДругихЯзыкахПриИзменении(Элемент)
	БылиИзмененияЗначенияПолейНаЯзыках = Истина;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	если ПоддержкаДругихЯзыков тогда
		если НаименованиеИзменяли тогда
			ОбщийМодульСервер.обновитьЗначениеНаЯзыке(Объект.Ссылка, Наименование);
		КонецЕсли;
		
		Если БылиИзмененияЗначенияПолейНаЯзыках Тогда
			Для Каждого СтрокаЯзыка Из НаименованияНаДругихЯзыках Цикл
				ОбщийМодульСервер.обновитьЗначениеНаЯзыке(Объект.Ссылка, СтрокаЯзыка.НаЯзыке, "Наименование", СтрокаЯзыка.Язык);	
			КонецЦикла;
			ОбновитьПовторноИспользуемыеЗначения();
		КонецЕсли;
		
	конецесли;
	
КонецПроцедуры

