//sza140606-0132 SZA: 

Процедура ПриКопировании(ОбъектКопирования)
	
	Комментарий = "";
	Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка") ;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если НЕ Отказ 
		И Не ПометкаУдаления Тогда
		
		Если не ЭтоГруппа 
			и Модифицированность() ТОгда
			
			Если ЗначениеЗаполнено(Родитель) ТОгда
				Если ЗначениеЗаполнено(Родитель.Подразделение)
					и (не ЗначениеЗаполнено(Подразделение) или Подразделение <> Родитель.Подразделение) Тогда
					
					Подразделение = Родитель.Подразделение;	
				КонецЕсли;
				Если ЗначениеЗаполнено(Родитель.РеализацияОтОпределеннойОрганизации)
					и (не ЗначениеЗаполнено(РеализацияОтОпределеннойОрганизации) или РеализацияОтОпределеннойОрганизации <> Родитель.РеализацияОтОпределеннойОрганизации) Тогда
					
					РеализацияОтОпределеннойОрганизации = Родитель.РеализацияОтОпределеннойОрганизации;	
				КонецЕсли;
				Если ЗначениеЗаполнено(Родитель.РеализацияСОпределенногоСклада)
					и (не ЗначениеЗаполнено(РеализацияСОпределенногоСклада) или РеализацияСОпределенногоСклада <> Родитель.РеализацияСОпределенногоСклада) Тогда
					
					РеализацияСОпределенногоСклада = Родитель.РеализацияСОпределенногоСклада;	
				КонецЕсли;
				Если ЗначениеЗаполнено(Родитель.РеализоватьСИспользованиеОпределенногоВидаЦен)
					и (не ЗначениеЗаполнено(РеализоватьСИспользованиеОпределенногоВидаЦен) или РеализоватьСИспользованиеОпределенногоВидаЦен <> Родитель.РеализоватьСИспользованиеОпределенногоВидаЦен) Тогда
					
					РеализоватьСИспользованиеОпределенногоВидаЦен = Родитель.РеализоватьСИспользованиеОпределенногоВидаЦен;	
				КонецЕсли;
				Если ЗначениеЗаполнено(Родитель.РеализоватьСПоступлениеДенегВОпределенноеХранилище)
					и (не ЗначениеЗаполнено(РеализоватьСПоступлениеДенегВОпределенноеХранилище) или РеализоватьСПоступлениеДенегВОпределенноеХранилище <> Родитель.РеализоватьСПоступлениеДенегВОпределенноеХранилище) Тогда
					
					РеализоватьСПоступлениеДенегВОпределенноеХранилище = Родитель.РеализоватьСПоступлениеДенегВОпределенноеХранилище;	
				КонецЕсли;
			КонецЕсли;
			
			Отказ = ОбщийМодульСервер.ПроверитьУникальностьНаименование(Отказ, "АссортиментДляРабочегоМестаКассира", ЭтотОбъект.Наименование, ЭтотОбъект.Ссылка, "Подразделение", Подразделение);
			
		ИначеЕсли Модифицированность() тогда
			
			Если НЕ Отказ 
				И ЗначениеЗаполнено(Ссылка) Тогда
				
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				|	АссортиментДляРабочегоМестаКассира.Ссылка
				|ИЗ Справочник.АссортиментДляРабочегоМестаКассира КАК АссортиментДляРабочегоМестаКассира
				|ГДЕ АссортиментДляРабочегоМестаКассира.Родитель = &Родитель";
				
				Запрос.УстановитьПараметр("Родитель", Ссылка);
				
				РезультатЗапроса = Запрос.Выполнить();
				Если Не РезультатЗапроса.Пустой() Тогда
					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						ОбъектАссортимента = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
						НеМенять = Истина;
						Если НЕ ОбъектАссортимента.Подразделение = Подразделение Тогда
							ОбъектАссортимента.Подразделение = Подразделение;
							НеМенять = Ложь;
						КонецЕсли;
						Если ЗначениеЗаполнено(РеализацияОтОпределеннойОрганизации)
							И НЕ ОбъектАссортимента.РеализацияОтОпределеннойОрганизации = РеализацияОтОпределеннойОрганизации Тогда
							
							ОбъектАссортимента.РеализацияОтОпределеннойОрганизации = РеализацияОтОпределеннойОрганизации;
							НеМенять = Ложь;
						КонецЕсли;
						Если ЗначениеЗаполнено(РеализацияСОпределенногоСклада)
							И НЕ ОбъектАссортимента.РеализацияСОпределенногоСклада = РеализацияСОпределенногоСклада Тогда
							
							ОбъектАссортимента.РеализацияСОпределенногоСклада = РеализацияСОпределенногоСклада;
							НеМенять = Ложь;
						КонецЕсли;
						Если ЗначениеЗаполнено(РеализоватьСИспользованиеОпределенногоВидаЦен)
							И НЕ ОбъектАссортимента.РеализоватьСИспользованиеОпределенногоВидаЦен = РеализоватьСИспользованиеОпределенногоВидаЦен Тогда
							
							ОбъектАссортимента.РеализоватьСИспользованиеОпределенногоВидаЦен = РеализоватьСИспользованиеОпределенногоВидаЦен;
							НеМенять = Ложь;
						КонецЕсли;
						Если ЗначениеЗаполнено(РеализоватьСПоступлениеДенегВОпределенноеХранилище)
							И НЕ ОбъектАссортимента.РеализоватьСПоступлениеДенегВОпределенноеХранилище = РеализоватьСПоступлениеДенегВОпределенноеХранилище Тогда
							
							ОбъектАссортимента.РеализоватьСПоступлениеДенегВОпределенноеХранилище = РеализоватьСПоступлениеДенегВОпределенноеХранилище;
							НеМенять = Ложь;
						КонецЕсли;
						Если НЕ НеМенять Тогда
							ОбъектАссортимента.Записать();
						КонецЕсли;
						
					КонецЦикла;                	               	
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли; 	
	КонецЕсли;
	
КонецПроцедуры
