// sza141222-0217
// sza141017-0341 :
// sza140320-1551

&НаКлиенте
Процедура ДобавитьГруппу(Команда)

	НоваяГруппаЗначений = СоздатьНовуюГруппуЗначений(ВладелецЗначений);
	ПоказатьЗначение(Неопределено, НоваяГруппаЗначений);

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗначение(Команда)

	ПараметрыФормы = Новый Структура("ВладелецЗначений", ВладелецЗначений);
	ОткрытьФорму("Справочник.НаборЗначенийДополнительныхРеквизитов.ФормаОбъекта", ПараметрыФормы);

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

		Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьСобственныйПереводЭлементовИнтерфейса") Тогда
			ОбщийМодульСервер.ПеревестиРеквизитыФормы(ЭтаФорма);
		КонецЕсли;

	ОбщийМодульСервер.ОбеспечитьСписокОтборов(Список);
	ВладелецЗначений = ?(ЗначениеЗаполнено(Параметры.Владелец), Параметры.Владелец, Параметры.Отбор.Владелец);
	ЗначениеЗаполненоПараметрыВладелец = ЗначениеЗаполнено(ВладелецЗначений);
	Если ЗначениеЗаполненоПараметрыВладелец Тогда
		Список.Параметры.УстановитьЗначениеПараметра("Владелец", ВладелецЗначений);
		Элементы.Владелец.Видимость = ЛОЖЬ;
	Иначе
		Элементы.ВладелецЗначений.Видимость = ЛОЖЬ;
	КонецЕсли;

	Список.Параметры.УстановитьЗначениеПараметра("ОтборПоВладельцу", ЗначениеЗаполненоПараметрыВладелец);

КонецПроцедуры

&НаСервереБезКонтекста
Функция   СоздатьНовуюГруппуЗначений(Знач ВладелецЗначений)

	НоваяГруппаЗначений = Справочники.ЗначенияЯчеекТаблицДанных.СоздатьГруппу();
	НоваяГруппаЗначений.Наименование = "";
	НоваяГруппаЗначений.Владелец = ВладелецЗначений;
	НоваяГруппаЗначений.Записать();

	Возврат НоваяГруппаЗначений.Ссылка;

КонецФункции
