//sza141222-0217
//sza141017-0341 : 
//sza140320-1551  

&НаКлиенте
Процедура ПриЗакрытии()
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщийМодульСервер.ОбеспечитьСписокОтборов(Список);
	
	ВладелецЗначений = ?(ЗначениеЗаполнено(Параметры.Владелец), Параметры.Владелец, Параметры.Отбор.Владелец);
	ЗначениеЗаполненоПараметрыВладелец = ЗначениеЗаполнено(ВладелецЗначений);
	Если ЗначениеЗаполненоПараметрыВладелец Тогда
		Список.Параметры.УстановитьЗначениеПараметра("Владелец", ВладелецЗначений);
		Элементы.Владелец.Видимость = ЛОЖЬ;
	Иначе
		Элементы.ВладелецЗначений.Видимость = ЛОЖЬ;
	КонецЕсли;

	Список.Параметры.УстановитьЗначениеПараметра("ОтборПоВладельцу", ЗначениеЗаполненоПараметрыВладелец);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЗначение(Команда)
	
	ПараметрыФормы = Новый Структура("ВладелецЗначений", ВладелецЗначений);
	ФормаЗначения = ПолучитьФорму("Справочник.НаборЗначенийДополнительныхРеквизитов.ФормаОбъекта", ПараметрыФормы);
	ФормаЗначения.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьГруппу(Команда)
	
	НоваяГруппаЗначений = СоздатьНовуюГруппуЗначений(ВладелецЗначений);
	ОткрытьЗначение(НоваяГруппаЗначений);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция   СоздатьНовуюГруппуЗначений(Знач ВладелецЗначений)
	
	НоваяГруппаЗначений = Справочники.ЗначенияЯчеекТаблицДанных.СоздатьГруппу();
	НоваяГруппаЗначений.Наименование = "";
	НоваяГруппаЗначений.Владелец = ВладелецЗначений;
	НоваяГруппаЗначений.Записать();
	
	Возврат НоваяГруппаЗначений.Ссылка;
	
КонецФункции