// Суров С.В <s_surov@mail.ru>

// Процедура, вызываемая из одноименного обработчика события формы узла плана обмена "Обмен с сайтом".
// 
// Параметры:
//  Форма - форма, из обработчика события которой происходит вызов процедуры.
//  Отказ - Булево - признак отказа от выполнения действия.
// 
Процедура ФормаУзлаПриОткрытии(Форма, Отказ) Экспорт
	
	
	
КонецПроцедуры

// Процедура, вызываемая из одноименного обработчика события формы узла плана обмена "Обмен с сайтом".
// 
// Параметры:
//  Форма - форма, из обработчика события которой происходит вызов процедуры.
//  Отказ - Булево - признак отказа от выполнения действия.
//  ПараметрыЗаписи - Структура, содержащая параметры записи. 
// 
Процедура ФормаУзлаПередЗаписью(Форма, Отказ, ПараметрыЗаписи) Экспорт
	
	Если НЕ Форма.ВыгружатьЦеныОстатки Тогда
		Форма.СписокТочекСамовывоза.Очистить();
	КонецЕсли;
	
	Если Не Форма.ВыгружатьТовары Тогда
		Форма.Объект.ВыгружатьКартинки            = ЛОЖЬ;
		Форма.ВыгружатьФайлы                      = ЛОЖЬ;
		Форма.КлассифицироватьПоВидамНоменклатуры = ЛОЖЬ;
	КонецЕсли;
	
	Если НЕ (Форма.ИспользуютсяГруппыДоступаПартнеров 
	        И (Форма.ИспользоватьПартнеровКакКонтрагентов
	         ИЛИ Форма.СоздаватьПартнеровДляНовыхКонтрагентов)) Тогда
		
		Форма.ГруппаДоступаПартнеров = Неопределено;// ПредопределенноеЗначение("Справочник.ГруппыДоступаПартнеров.ПустаяСсылка");
		
	КонецЕсли;
	
КонецПроцедуры
