//sza140524-2351 SZA: 
//sza140210-0224 

&НаКлиенте
Процедура НапечататьЭтиКоманды(Команда)
	
	СтруктураОтвета = Новый Структура;
	Если НалоговаяНакладная Тогда
		СтруктураОтвета.Вставить("ПечататьТакжеРасходнуюНакладную", ПечататьТакжеРасходнуюНакладную);
		СтруктураОтвета.Вставить("РасходнаяВДваЭкземпляра", РасходнаяВДваЭкземпляра);
		СтруктураОтвета.Вставить("СчетВДваЭкземпляра", СчетВДваЭкземпляра);
		СтруктураОтвета.Вставить("ТОРГ12ВДваЭкземпляра", ТОРГ12ВДваЭкземпляра);
		СтруктураОтвета.Вставить("ПечатьСчета", ПечатьСчета);
		СтруктураОтвета.Вставить("ПечататьТОРГ12", ПечататьТОРГ12);
		СтруктураОтвета.Вставить("ПечататьКопию", ПечататьКопию);
		СтруктураОтвета.Вставить("ПечататьОригинал", ПечататьОригинал);
		СтруктураОтвета.Вставить("ПоследнийНомерНалоговойНакладной", ПоследнийНомерНалоговойНакладной);
		СтруктураОтвета.Вставить("ЗаголовокРасходнойНакладной", ЗаголовокРасходнойНакладной);
		
		ЗаписатьНомерНН();
		
	Иначе
		СтруктураОтвета.Вставить("ПечататьГарантийныйТалон", ПечататьГарантийныйТалон);
		СтруктураОтвета.Вставить("ПечататьБлокТалонаОтИсполнителя", ПечататьБлокТалонаОтИсполнителя);
		СтруктураОтвета.Вставить("ПечататьСписокРаботИсполнителя", ПечататьСписокРаботИсполнителя);
		СтруктураОтвета.Вставить("ПечататьПодвалРаботИсполнителя", ПечататьПодвалРаботИсполнителя);
		СтруктураОтвета.Вставить("ПечататьКвитанцию", ПечататьКвитанцию);
		СтруктураОтвета.Вставить("ПечататьГарантийныйТалонККвитанции", ПечататьГарантийныйТалонККвитанции);
		СтруктураОтвета.Вставить("ПечататьПоложениеОРемонте", ПечататьПоложениеОРемонте);
		СтруктураОтвета.Вставить("ПечататьТехнологическуюКартуРемонта", ПечататьТехнологическуюКартуРемонта);
		СтруктураОтвета.Вставить("ПечататьЗаказНаряд", ПечататьЗаказНаряд);
	КонецЕсли;
	
	Закрыть(СтруктураОтвета);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменаПечати(Команда)
	Закрыть(неопределено);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("002100", ЭтаФорма, Отказ, );
	
	Если НЕ Отказ Тогда	
		
		НалоговаяНакладная = Параметры.НалоговаяНакладная;
		
		Если Параметры.НалоговаяНакладная Тогда
			
			Если НЕ ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ИспользоватьМеханизмыПечатиНалоговойНакладнойДляУкраины") Тогда
				Элементы.ОсновныеПараметрыПечатиНалоговойНакладной.Видимость = Ложь;
				ПечататьОригинал = Ложь;
				ПечататьКопию 	 = Ложь;
				
			Иначе
				Элементы.ЭлементыПечатиДокументаГарантийногоОбязательства.Видимость = Ложь;
				Элементы.ЭлементыПечатиНалоговойНакладнойДляУкраины.Видимость 		= Истина;
				Организация = Параметры.Организация;
				Если НЕ ЗначениеЗаполнено(Организация) Тогда
					Организация = ПредопределенноеЗначение("Справочник.Организации.ОсновноеПредприятие");
				КонецЕсли;		
				ПоследнийНомерНалоговойНакладной = Организация.ПоследнийНомерНалоговойНакладной;
				ПоследнийНомерНалоговойНакладной = ПоследнийНомерНалоговойНакладной + 1;
				
			КонецЕсли;
			
			ИспользоватьМеханизмыПечатиФормыТОРГ12 	= ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ИспользоватьМеханизмыПечатиФормыТОРГ12");
			Элементы.ПечататьТОРГ12.Видимость 		= ИспользоватьМеханизмыПечатиФормыТОРГ12;
			Элементы.ТОРГ12ВДваЭкземпляра.Видимость = ИспользоватьМеханизмыПечатиФормыТОРГ12;
			Элементы.ПечататьЗаказНаряд.Видимость 	= параметры.ЭтоВыполнениеРабот;
			Элементы.ПечататьТехнологическуюКартуРемонта.Видимость = параметры.ЭтоВыполнениеРабот;
			
		Иначе
			Элементы.ЭлементыПечатиДокументаГарантийногоОбязательства.Видимость = Истина;
			Элементы.ЭлементыПечатиНалоговойНакладнойДляУкраины.Видимость 		= Ложь;
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
	
	Если НЕ ЗначениеЗаполнено(ЗаголовокРасходнойНакладной) Тогда
		ЗаголовокРасходнойНакладной = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ИндивидуальныйТекстВШапкеПечатнойФормыРасходаТовара");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНомерНН()
	
	Если ПечататьОригинал Тогда
		Попытка
			ОрганизацияОбъект = Организация.ПолучитьОбъект();
			ОрганизацияОбъект.ПоследнийНомерНалоговойНакладной = ПоследнийНомерНалоговойНакладной;
			ОрганизацияОбъект.Записать();
		Исключение
		КонецПопытки;      	
	КонецЕсли;
	
КонецПроцедуры //
