// sza160116-0534 причес

&НаКлиенте
Процедура КомандаОК(Команда)
	
	Перем Документ, Счетчик, Действие, ПолнаяМаска, ИмяФайла, Файл;
	
	// Подготовили текст шаблона
	Документ = Новый ТекстовыйДокумент;
	Документ.УстановитьТекст(Шаблон);
	Счетчик = 1;
	Документ.ВставитьСтроку(Счетчик, "Имя:"); Счетчик = Счетчик + 1;
	Документ.ВставитьСтроку(Счетчик, СтрЗаменить(ИмяШаблона, Символы.ПС, "")); Счетчик = Счетчик + 1;
	Документ.ВставитьСтроку(Счетчик, "Описание:"); Счетчик = Счетчик + 1;
	Документ.ВставитьСтроку(Счетчик, СтрЗаменить(ОписаниеШаблона, Символы.ПС, "")); Счетчик = Счетчик + 1;
	Если ВыполняемыеДействия[0].Пометка ИЛИ ВыполняемыеДействия[1].Пометка Тогда
		Документ.ВставитьСтроку(Счетчик, "Действия:"); Счетчик = Счетчик + 1;
		Для Каждого Действие Из ВыполняемыеДействия Цикл
			Если Действие.Пометка Тогда
				Документ.ВставитьСтроку(Счетчик, Действие.Значение); Счетчик = Счетчик + 1;
			КонецЕсли;
		КонецЦикла; 
	КонецЕсли;
	Документ.ВставитьСтроку(Счетчик, "Шаблон:"); Счетчик = Счетчик + 1;
	// теперь получим очередное имя файла шаблона
	ПолнаяМаска = ПутьКШаблонам + "config%.lct";
	Счетчик = 1;
	Пока ИСТИНА Цикл
		
		ИмяФайла = СтрЗаменить(ПолнаяМаска, "%", Формат(Счетчик, "ЧГ=0"));
		Файл = Новый Файл(ИмяФайла);
		Если Файл.Существует() Тогда
			Счетчик = Счетчик + 1;
			Продолжить;
		КонецЕсли;
		Прервать;
	КонецЦикла;
	Документ.Записать(ИмяФайла);
	Закрыть(КодВозвратаДиалога.ОК);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьСобственныйПереводЭлементовИнтерфейса") Тогда
		ОбщийМодульСервер.ПеревестиРеквизитыФормы(ЭтаФорма);	
	КонецЕсли;
	
	// запомним важные параметры
	ПутьКШаблонам = Параметры.ПутьКШаблонам;
	Шаблон = Параметры.ФайлКонфигурации;
	
	// заполним список шаблонов действий и одновременно попробуем проставить параметры действий:
	// если текст "<dump" значит проставим флаг - запрашивать путь к дампу
	// если текст "<log" значит проставим флаг - запрашивать путь к файлам ТЖ
	ВыполняемыеДействия.Добавить("ПутьКДампу", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Запрашивать путь к каталогу хранения дампов"), ?(СтрЧислоВхождений(Шаблон, "<dump") > 0 , ИСТИНА, ЛОЖЬ));
	ВыполняемыеДействия.Добавить("ПутьКТЖ", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Запрашивать путь к каталогу хранения файлов технологического журнала"), ?(СтрЧислоВхождений(Шаблон, "<log") > 0 , ИСТИНА, ЛОЖЬ));
	
	// сформируем автоматическое описание шаблона
	ИмяШаблона = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Создан") + " " + ТекущаяДата();
	ОписаниеШаблона = СокрП(""+ ?(СтрЧислоВхождений(Шаблон, "<log") > 0 , ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Содержит настройки создания технологического журнала."), "") + " " +
	ОписаниеШаблона + ?(СтрЧислоВхождений(Шаблон, "<dump") > 0 , ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Содержит настройки создания дампов."), "") + " " +
	ОписаниеШаблона + ?(СтрЧислоВхождений(Шаблон, "<leaks") > 0 , ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Содержит настройки контроля утечек памяти в конфигурации."), "") + " " +
	ОписаниеШаблона + ?(СтрЧислоВхождений(Шаблон, "<mem") > 0 , ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Содержит настройки контроля утечек памяти на сервере."), "") + " " +
	ОписаниеШаблона + ?(СтрЧислоВхождений(Шаблон, "<defaultlog") > 0 , ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Содержит настройки технологического журнала по умолчанию."), "") + " " +
	ОписаниеШаблона + ?(СтрЧислоВхождений(Шаблон, "<system") > 0 , ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Содержит настройки системных событий."), ""));
	
КонецПроцедуры
