// sza140104-0215 :
// sza131214-0133 :

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)

	Если ОбщийМодульПовтор.ВывестиНаименованияНаДругомЯзыке() Тогда
		ВозможноеПредставление = ОбщийМодульПовтор.ПолучитьПредставлениеНаЯзыке(Данные.Ссылка, , ИСТИНА);
		Если НЕ ВозможноеПредставление = Неопределено Тогда
			Представление = ВозможноеПредставление;
			СтандартнаяОбработка = ЛОЖЬ;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура НаПечать(ТабДок, Ссылка) Экспорт

	Макет = Справочники.Регионы.ПолучитьМакет("НаПечать");

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Регионы.Важность,
	|	Регионы.Валюта,
	|	Регионы.ДатаРедакции,
	|	Регионы.ДатаСоздания,
	|	Регионы.Код,
	|	ВЫРАЗИТЬ(Регионы.Комментарий КАК Строка(1000)) КАК Комментарий,
	|	Регионы.Наименование,
	|	Регионы.Ответственный,
	|	Регионы.Размер,
	|	Регионы.ЧасовойПоясОтГринвича,
	|	Регионы.ЯзыкДокументов,
	|	Регионы.ЯзыкОбщения
	|ИЗ Справочник.Регионы КАК Регионы
	|ГДЕ Регионы.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);

	Выборка = Запрос.Выполнить().Выбрать();
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Очистить();
	ВставлятьРазделительСтраниц = Ложь;

	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьЗаголовок);
		ТабДок.Вывести(ОбластьЗаголовок);
		Шапка.Параметры.Заполнить(Выборка);
		ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(Шапка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());
		ВставлятьРазделительСтраниц = Истина;

	КонецЦикла;

КонецПроцедуры

#КонецЕсли
