// sza150117-0218

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ПользователяТекущаяДата = ОбщийМодульКлиент.ПользователяТекущаяДата();
	Если Запись.Доставить < ПользователяТекущаяДата Тогда
		Запись.Доставить = ПользователяТекущаяДата;
	КонецЕсли;
	
	Запись.ДатаОтправки = ПользователяТекущаяДата;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
		Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьСобственныйПереводЭлементовИнтерфейса") Тогда
			ОбщийМодульСервер.ПеревестиРеквизитыФормы(ЭтаФорма);	
		КонецЕсли;
		
	Если ЗначениеЗаполнено(Параметры.Ссылка) Тогда
		Запись.Ссылка = Параметры.Ссылка;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Запись.Пользователь)
		И ЗначениеЗаполнено(Параметры.Получатель) Тогда
		
		Запись.Пользователь = Параметры.Получатель;
		ЭтаФорма.ТекущийЭлемент = Элементы.Сообщение;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Запись.Отправитель) Тогда
		Запись.Отправитель = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Запись.Доставить) Тогда
		Запись.Доставить = ОбщийМодульСервисСервер.ПользователяТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры
