// sza140914-1325 именованные
// sza131213-2141 : 
&НаКлиенте
Процедура ПриЗакрытии()
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Отказ Тогда
		Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьСобственныйПереводЭлементовИнтерфейса") Тогда
			ОбщийМодульСервер.ПеревестиРеквизитыФормы(ЭтаФорма);	
		КонецЕсли;
		
		ОбщийМодульСервер.ОбеспечитьСписокОтборов(Список);	
		
		Если параметры.ДляДопРеквизитовКлиентов Тогда
			
			СписокИменованныхОбъектов = Новый СписокЗначений;
			Для Счетчик = 1 по 10 цикл
				Выполнить(" СписокИменованныхОбъектов.Добавить(Справочники.ДополнительныеРеквизиты.ДополнительныйРеквизитСправочникаКлиентов" + СокрЛП(Счетчик) + ".Ссылка);");
			КонецЦикла;
			
			Элементы.Отбор.Видимость = ЛОЖЬ;
			ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ОбъектБазыДанных");
			ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
			ЭлементОтбора.Использование  = ИСТИНА;
			ЭлементОтбора.ПравоеЗначение = СписокИменованныхОбъектов;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
