//sza140915-0025
Процедура Печать(ТабДок, Ссылка) Экспорт
	
	Макет = Справочники.ШаблоныМагнитныхКарт.ПолучитьМакет("Печать");
	Макет.КодЯзыкаМакета = ОбщийМодульПовтор.ПолучитьТекущийЯзыкДокументов();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ШаблоныМагнитныхКарт.ДатаРедакции,
	|	ШаблоныМагнитныхКарт.ДатаСоздания,
	|	ШаблоныМагнитныхКарт.ДлинаКода1,
	|	ШаблоныМагнитныхКарт.ДлинаКода2,
	|	ШаблоныМагнитныхКарт.ДлинаКода3,
	|	ШаблоныМагнитныхКарт.ДоступностьДорожки1,
	|	ШаблоныМагнитныхКарт.ДоступностьДорожки2,
	|	ШаблоныМагнитныхКарт.ДоступностьДорожки3,
	|	ШаблоныМагнитныхКарт.Код,
	|	ШаблоныМагнитныхКарт.Наименование,
	|	ШаблоныМагнитныхКарт.Ответственный,
	|	ШаблоныМагнитныхКарт.Префикс1,
	|	ШаблоныМагнитныхКарт.Префикс2,
	|	ШаблоныМагнитныхКарт.Префикс3,
	|	ШаблоныМагнитныхКарт.РазделительБлоков1,
	|	ШаблоныМагнитныхКарт.РазделительБлоков2,
	|	ШаблоныМагнитныхКарт.РазделительБлоков3,
	|	ШаблоныМагнитныхКарт.Суффикс1,
	|	ШаблоныМагнитныхКарт.Суффикс2,
	|	ШаблоныМагнитныхКарт.Суффикс3,
	|	ШаблоныМагнитныхКарт.ПоляДорожки1.(
	|		НомерСтроки,
	|		Поле,
	|		НомерБлока,
	|		НомерПервогоСимволаПоля,
	|		ДлинаПоля ),
	|	ШаблоныМагнитныхКарт.ПоляДорожки2.(
	|		НомерСтроки,
	|		Поле,
	|		НомерБлока,
	|		НомерПервогоСимволаПоля,
	|		ДлинаПоля ),
	|	ШаблоныМагнитныхКарт.ПоляДорожки3.(
	|		НомерСтроки,
	|		Поле,
	|		НомерБлока,
	|		НомерПервогоСимволаПоля,
	|		ДлинаПоля )
	|ИЗ Справочник.ШаблоныМагнитныхКарт КАК ШаблоныМагнитныхКарт
	|ГДЕ ШаблоныМагнитныхКарт.Ссылка В (&Ссылка)";
	
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок 		 = Макет.ПолучитьОбласть("Заголовок");
	Шапка 					 = Макет.ПолучитьОбласть("Шапка");
	ОбластьПоляДорожки1Шапка = Макет.ПолучитьОбласть("ПоляДорожки1Шапка");
	ОбластьПоляДорожки1 	 = Макет.ПолучитьОбласть("ПоляДорожки1");
	ОбластьПоляДорожки2Шапка = Макет.ПолучитьОбласть("ПоляДорожки2Шапка");
	ОбластьПоляДорожки2 	 = Макет.ПолучитьОбласть("ПоляДорожки2");
	ОбластьПоляДорожки3Шапка = Макет.ПолучитьОбласть("ПоляДорожки3Шапка");
	ОбластьПоляДорожки3 	 = Макет.ПолучитьОбласть("ПоляДорожки3");
	Подвал 					 = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = ЛОЖЬ;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьПоляДорожки1Шапка);
		ВыборкаПоляДорожки1 = Выборка.ПоляДорожки1.Выбрать();
		Пока ВыборкаПоляДорожки1.Следующий() Цикл
			ОбластьПоляДорожки1.Параметры.Заполнить(ВыборкаПоляДорожки1);
			ТабДок.Вывести(ОбластьПоляДорожки1, ВыборкаПоляДорожки1.Уровень());
		КонецЦикла;

		ТабДок.Вывести(ОбластьПоляДорожки2Шапка);
		ВыборкаПоляДорожки2 = Выборка.ПоляДорожки2.Выбрать();
		Пока ВыборкаПоляДорожки2.Следующий() Цикл
			ОбластьПоляДорожки2.Параметры.Заполнить(ВыборкаПоляДорожки2);
			ТабДок.Вывести(ОбластьПоляДорожки2, ВыборкаПоляДорожки2.Уровень());
		КонецЦикла;

		ТабДок.Вывести(ОбластьПоляДорожки3Шапка);
		ВыборкаПоляДорожки3 = Выборка.ПоляДорожки3.Выбрать();
		Пока ВыборкаПоляДорожки3.Следующий() Цикл
			ОбластьПоляДорожки3.Параметры.Заполнить(ВыборкаПоляДорожки3);
			ТабДок.Вывести(ОбластьПоляДорожки3, ВыборкаПоляДорожки3.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = ИСТИНА;
	КонецЦикла;
	
КонецПроцедуры
