#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	// sza140915-0025
	Процедура Печать(ДокументДляПечати, Ссылка) Экспорт
		
		Макет = Справочники.ШаблоныМагнитныхКарт.ПолучитьМакет("Печать");
		Макет.КодЯзыкаМакета = ОбщийМодульПовтор.ПолучитьТекущийЯзыкДокументов();
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ШаблоныМагнитныхКарт.ДатаРедакции,
		|	ШаблоныМагнитныхКарт.ДатаСоздания,
		|	ШаблоныМагнитныхКарт.ДлинаКода1,
		|	ШаблоныМагнитныхКарт.ДлинаКода2,
		|	ШаблоныМагнитныхКарт.ДлинаКода3,
		|	ШаблоныМагнитныхКарт.ДоступностьДорожки1,
		|	ШаблоныМагнитныхКарт.ДоступностьДорожки2,
		|	ШаблоныМагнитныхКарт.ДоступностьДорожки3,
		|	ШаблоныМагнитныхКарт.Код,
		|	ШаблоныМагнитныхКарт.Наименование,
		|	ШаблоныМагнитныхКарт.Ответственный,
		|	ШаблоныМагнитныхКарт.Префикс1,
		|	ШаблоныМагнитныхКарт.Префикс2,
		|	ШаблоныМагнитныхКарт.Префикс3,
		|	ШаблоныМагнитныхКарт.РазделительБлоков1,
		|	ШаблоныМагнитныхКарт.РазделительБлоков2,
		|	ШаблоныМагнитныхКарт.РазделительБлоков3,
		|	ШаблоныМагнитныхКарт.Суффикс1,
		|	ШаблоныМагнитныхКарт.Суффикс2,
		|	ШаблоныМагнитныхКарт.Суффикс3,
		|	ШаблоныМагнитныхКарт.ПоляДорожки1.(
		|		НомерСтроки,
		|		Поле,
		|		НомерБлока,
		|		НомерПервогоСимволаПоля,
		|		ДлинаПоля
		|	),
		|	ШаблоныМагнитныхКарт.ПоляДорожки2.(
		|		НомерСтроки,
		|		Поле,
		|		НомерБлока,
		|		НомерПервогоСимволаПоля,
		|		ДлинаПоля
		|	),
		|	ШаблоныМагнитныхКарт.ПоляДорожки3.(
		|		НомерСтроки,
		|		Поле,
		|		НомерБлока,
		|		НомерПервогоСимволаПоля,
		|		ДлинаПоля
		|	),
		|	ВЫРАЗИТЬ(ШаблоныМагнитныхКарт.Комментарий КАК СТРОКА(1000)) КАК Комментарий
		|ИЗ Справочник.ШаблоныМагнитныхКарт КАК ШаблоныМагнитныхКарт
		|ГДЕ ШаблоныМагнитныхКарт.Ссылка В(&Ссылка)";
		
		Запрос.Параметры.Вставить("Ссылка", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		ОбластьЗаголовок 		 = Макет.ПолучитьОбласть("Заголовок");
		Шапка 					 = Макет.ПолучитьОбласть("Шапка");
		ОбластьПоляДорожки1Шапка = Макет.ПолучитьОбласть("ПоляДорожки1Шапка");
		ОбластьПоляДорожки1 	 = Макет.ПолучитьОбласть("ПоляДорожки1");
		ОбластьПоляДорожки2Шапка = Макет.ПолучитьОбласть("ПоляДорожки2Шапка");
		ОбластьПоляДорожки2 	 = Макет.ПолучитьОбласть("ПоляДорожки2");
		ОбластьПоляДорожки3Шапка = Макет.ПолучитьОбласть("ПоляДорожки3Шапка");
		ОбластьПоляДорожки3 	 = Макет.ПолучитьОбласть("ПоляДорожки3");
		Подвал 					 = Макет.ПолучитьОбласть("Подвал");
		ДокументДляПечати.ИмяПараметровПечати  = "ШаблонМК" + СокрЛП(ИмяКомпьютера());
		ДокументДляПечати.КлючПараметровПечати = ДокументДляПечати.ИмяПараметровПечати;
		
		ДокументДляПечати.Очистить();
		ВставлятьРазделительСтраниц = ЛОЖЬ;
		Пока Выборка.Следующий() Цикл
			Если ВставлятьРазделительСтраниц Тогда
				ДокументДляПечати.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьЗаголовок);
			ДокументДляПечати.Вывести(ОбластьЗаголовок);
			Шапка.Параметры.Заполнить(Выборка);
			ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(Шапка);
			ДокументДляПечати.Вывести(Шапка, Выборка.Уровень());
			ДокументДляПечати.Вывести(ОбластьПоляДорожки1Шапка);
			ВыборкаПоляДорожки1 = Выборка.ПоляДорожки1.Выбрать();
			Пока ВыборкаПоляДорожки1.Следующий() Цикл
				ОбластьПоляДорожки1.Параметры.Заполнить(ВыборкаПоляДорожки1);
				ДокументДляПечати.Вывести(ОбластьПоляДорожки1, ВыборкаПоляДорожки1.Уровень());
			КонецЦикла;
			ДокументДляПечати.Вывести(ОбластьПоляДорожки2Шапка);
			ВыборкаПоляДорожки2 = Выборка.ПоляДорожки2.Выбрать();
			Пока ВыборкаПоляДорожки2.Следующий() Цикл
				ОбластьПоляДорожки2.Параметры.Заполнить(ВыборкаПоляДорожки2);
				ДокументДляПечати.Вывести(ОбластьПоляДорожки2, ВыборкаПоляДорожки2.Уровень());
			КонецЦикла;
			ДокументДляПечати.Вывести(ОбластьПоляДорожки3Шапка);
			ВыборкаПоляДорожки3 = Выборка.ПоляДорожки3.Выбрать();
			Пока ВыборкаПоляДорожки3.Следующий() Цикл
				ОбластьПоляДорожки3.Параметры.Заполнить(ВыборкаПоляДорожки3);
				ДокументДляПечати.Вывести(ОбластьПоляДорожки3, ВыборкаПоляДорожки3.Уровень());
			КонецЦикла;
			Подвал.Параметры.Заполнить(Выборка);
			ДокументДляПечати.Вывести(Подвал);
			ВставлятьРазделительСтраниц = ИСТИНА;
		КонецЦикла;
		
	КонецПроцедуры
	
#КонецЕсли