//sza131127-2144  
//sza130909-2145 : 
Процедура Печать(ТабДок, Ссылка) Экспорт
	
	Макет = Документы.Инвентаризации.ПолучитьМакет("Печать");
	Макет.КодЯзыкаМакета = ОбщийМодульПовтор.ПолучитьТекущийЯзыкДокументов();

	Запрос = Новый Запрос;	
	Запрос.Текст = "ВЫБРАТЬ
	|	Инвентаризации.ВыбылоДенег,
	|	Инвентаризации.Дата,
	|	Инвентаризации.Комментарий,
	|	Инвентаризации.ПоступилоДенег,
	|	Инвентаризации.Склад,
	|	Инвентаризации.ТовараВКоличестве,
	|	Инвентаризации.ТовараНаСумму,
	|	Инвентаризации.Товары.(
	|		Номенклатура,
	|		КоличествоУчет,
	|		КоличествоПоФакту,
	|		КоличествоРазница,
	|		Цена,
	|		СуммаРазница,
	|		СерияНоменклатуры
	|	),
	|	Инвентаризации.ВидЦен,
	|	Инвентаризации.Валюта,
	|	Инвентаризации.ХранилищеДенег,
	|	Инвентаризации.Номер
	|ИЗ Документ.Инвентаризации КАК Инвентаризации
	|ГДЕ Инвентаризации.Ссылка В(&Ссылка)";
	
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОбластьЗаголовок 	= Макет.ПолучитьОбласть("Заголовок");
	Шапка 				= Макет.ПолучитьОбласть("Шапка");
	ОбластьТоварыШапка 	= Макет.ПолучитьОбласть("ТоварыШапка");
	ОбластьТовары 		= Макет.ПолучитьОбласть("Товары");
	Подвал 				= Макет.ПолучитьОбласть("Подвал");
	
	ТабДок.Очистить();
	
	ВестиУчетПоСериямНоменклатуры = ОбщийМодульПовтор.ПолучитьПараметрСеанса("ВестиУчетПоСериямНоменклатуры");
	
	ВставлятьРазделительСтраниц = ЛОЖЬ;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ТабДок.Вывести(ОбластьЗаголовок);
		
		Шапка.Параметры.Заполнить(Выборка);
		СтруктураДополнительныПараметровМакета = ОбщийМодульСервер.ПолучитьСтруктуруДополнительныхПараметровМакетаПечати();
		Шапка.Параметры.ТекстВШапкеДокументовПриПечати   = СтруктураДополнительныПараметровМакета.ТекстВШапкеДокументовПриПечати;
		
		ТабДок.Вывести(Шапка, Выборка.Уровень());
		
		ТабДок.Вывести(ОбластьТоварыШапка);
		ВыборкаТовары = Выборка.Товары.Выбрать();
		Пока ВыборкаТовары.Следующий() Цикл
			
			ОбластьТовары.Параметры.Заполнить(ВыборкаТовары);
		    ОбластьТовары.Параметры.НоменклатураНаименование = ОбщийМодульТекстСервер.ПолучитьОбщееНаименование(ВыборкаТовары.Номенклатура);
			
			Если ВестиУчетПоСериямНоменклатуры
				И ЗначениеЗаполнено(ВыборкаТовары.СерияНоменклатуры) Тогда
				
				ОбластьТовары.Параметры.НоменклатураНаименование = ОбластьТовары.Параметры.НоменклатураНаименование + " " + ВыборкаТовары.СерияНоменклатуры;
			КонецЕсли;
			
			ТабДок.Вывести(ОбластьТовары, ВыборкаТовары.Уровень());
		КонецЦикла;
		
		Подвал.Параметры.Заполнить(Выборка);
		Подвал.Параметры.ТекстВПодвалеДокументовПриПечати = СтруктураДополнительныПараметровМакета.ТекстВПодвалеДокументовПриПечати;
		ВалютаОсн = ОбщийМодульПовтор.ЗначениеПредопределенного("Справочники.Валюты.ОсновнаяВалюта");
		Подвал.Параметры.Валюта = ?(ЗначениеЗаполнено(Выборка.Валюта), Выборка.Валюта, ВалютаОсн);
		Подвал.Параметры.ВалютаОсн = ВалютаОсн;
		ТабДок.Вывести(Подвал);
		
		ВставлятьРазделительСтраниц = ИСТИНА;
	КонецЦикла;
	
КонецПроцедуры



