//sza140119-0118
//sza131211-1456 

&НаСервере
Процедура СправочникиПередЗаписью(Источник, Отказ) Экспорт
	
	ПодходящийВидОбъекта = ОбщийМодульПовтор.ВыяснитьПодходящийВидОбъекта(источник.метаданные().имя, 2);		
	
	если не отказ
		и ПодходящийВидОбъекта
		И ОбщийМодульПовтор.ПолучитьПараметрСеанса("ИспользоватьЖурналированиеСобытий") Тогда
		
		Сейчас = ТекущаяДата();
		Если НЕ ЗначениеЗаполнено(Источник.ДатаСоздания) Тогда
			Источник.ДатаСоздания = Сейчас;
		Иначе
			Источник.ДатаРедакции = Сейчас;
		КонецЕсли;
		Источник.Ответственный = ОбщийМодульПовтор.ПолучитьПараметрСеанса("ТекущийПользователь");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СправочникиПриЗаписи(Источник, Отказ) Экспорт
	
	ПодходящийВидОбъекта = ОбщийМодульПовтор.ВыяснитьПодходящийВидОбъекта(источник.метаданные().имя, 2);		
	
	если не отказ тогда		
		
		Если ПодходящийВидОбъекта
			и ОбщийМодульПовтор.ПолучитьПараметрСеанса("ИспользоватьЖурналированиеСобытий") Тогда
			
			Ответственный = ОбщийМодульПовтор.ПолучитьПараметрСеанса("ТекущийПользователь");
			
			ЖурналСобытий = РегистрыСведений.ЖурналСобытий.СоздатьМенеджерЗаписи();
			ЖурналСобытий.Активность 	 = Истина;
			ЖурналСобытий.Ответственный  = Ответственный;
			ЖурналСобытий.Период 		 = ТекущаяДата();
			ЖурналСобытий.СсылкаНаОбъект = Источник.ссылка;
			ЖурналСобытий.Событие 		 = Перечисления.СобытияЖурнала.ЗаписьЭлементаСправочника;
			ЖурналСобытий.Описание 		 = сокрлп(сокрлп(типзнч(Источник)));
			
			Попытка 
				ЖурналСобытий.Записать(Истина);
				
			Исключение 
				если ОбщийМодульПовторВТеченииСервера.ВыводитьСообщенияМожно() тогда
					ОбщийМодульСервисСервер.ДобавитьСообщениеПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ошибка при попытке записи в журнал:") + " " + ЖурналСобытий + " " + ОписаниеОшибки(), , Источник.ссылка);
					//Сообщение = Новый СообщениеПользователю;
					//Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ошибка при попытке записи в журнал:") + " " + ЖурналСобытий + " " + ОписаниеОшибки();
					//Сообщение.Сообщить();                                               	
				КонецЕсли;
				
			КонецПопытки; 
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДокументыПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если ОбщийМодульПовтор.ПолучитьПараметрСеанса("ДействуетЗапретИзмененийПрошлого") Тогда
		
		Отказ = НЕ ОбщийМодульСервер.ПроверитьДоступностьДокументаПрошлого(Источник.Дата, Источник);
		
	КонецЕсли;
	
	Если не отказ 
		и ОбщийМодульПовтор.ПолучитьПараметрСеанса("ИспользоватьЖурналированиеСобытий") Тогда
		
		Сейчас = ТекущаяДата();
		Если НЕ ЗначениеЗаполнено(Источник.ДатаСоздания) Тогда
			Источник.ДатаСоздания = Сейчас;
		Иначе
			Источник.ДатаРедакции = Сейчас;
		КонецЕсли;
		Источник.Ответственный = ОбщийМодульПовтор.ПолучитьПараметрСеанса("ТекущийПользователь");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДокументыПриЗаписи(Источник, Отказ) Экспорт
	
	Если не отказ тогда				
		
		если ОбщийМодульПовтор.ПолучитьПараметрСеанса("ИспользоватьЖурналированиеСобытий") Тогда
			
			Ответственный = ОбщийМодульПовтор.ПолучитьПараметрСеанса("ТекущийПользователь");
			
			ЖурналСобытий = РегистрыСведений.ЖурналСобытий.СоздатьМенеджерЗаписи();
			ЖурналСобытий.Активность 	 = Истина;
			ЖурналСобытий.Ответственный  = Ответственный;
			ЖурналСобытий.Период 		 = ТекущаяДата();
			ЖурналСобытий.СсылкаНаОбъект = Источник.ссылка;
			ЖурналСобытий.Событие 		 = Перечисления.СобытияЖурнала.ЗаписьДокумента;
			ЖурналСобытий.Описание 		 = сокрлп(типзнч(Источник));
			
			Попытка 				
				ЖурналСобытий.Записать(Истина);
				
			Исключение
				если ОбщийМодульПовторВТеченииСервера.ВыводитьСообщенияМожно() тогда
					ОбщийМодульСервисСервер.ДобавитьСообщениеПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ошибка при попытке записи в журнал:") + " " + ЖурналСобытий + " " + ОписаниеОшибки(), , Источник.ссылка);
					//Сообщение = Новый СообщениеПользователю;
					//Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ошибка при попытке записи в журнал:") + " " + ЖурналСобытий + " " + ОписаниеОшибки();
					//Сообщение.Сообщить();                                               	
				КонецЕсли;
				
			КонецПопытки;
		КонецЕсли;
		
		Если ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ПодсистемаИЭИмпортЭкспорт") Тогда
			ОбновитьПовторноИспользуемые = Ложь;
			Дата = Источник.Дата;
			
			ДатаНачалаПериодаДляВыгрузкиРуководителю = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ДатаНачалаПериодаДляВыгрузкиРуководителю", Истина);
			Если ДатаНачалаПериодаДляВыгрузкиРуководителю > Дата Тогда
				Константы.ДатаНачалаПериодаДляВыгрузкиРуководителю.Установить(Дата);
				ОбновитьПовторноИспользуемыеЗначения();
			КонецЕсли;
			
			ДатаОкончанияПериодаДляВыгрузкиРуководителю = константы.ДатаОкончанияПериодаДляВыгрузкиРуководителю.Получить();
			Если ДатаОкончанияПериодаДляВыгрузкиРуководителю < Дата Тогда
				Константы.ДатаОкончанияПериодаДляВыгрузкиРуководителю.Установить(Дата);
			КонецЕсли;
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РегистрСведенийПередЗаписью(Источник, Отказ, Замещение) Экспорт
	
	Если ОбщийМодульПовтор.ПолучитьПараметрСеанса("ДействуетЗапретИзмененийПрошлого") Тогда
		
		Отказ = НЕ Источник.количество() = 0 И НЕ ОбщийМодульСервер.ПроверитьДоступностьДокументаПрошлого(Источник[0].Период, );		
	КонецЕсли;
	
	Если не отказ 
		и ОбщийМодульПовтор.ПолучитьПараметрСеанса("ИспользоватьЖурналированиеСобытий")
		и НЕ Источник.количество() = 0 Тогда
		
		ПодходящийВидОбъекта = ОбщийМодульПовтор.ВыяснитьПодходящийВидОбъекта(источник.метаданные().имя, 3);		
		
		Если ПодходящийВидОбъекта Тогда
			
			Сейчас = ТекущаяДата();
			Ответственный = ОбщийМодульПовтор.ПолучитьПараметрСеанса("ТекущийПользователь");
			Для Каждого Запись Из Источник Цикл
				Если НЕ ЗначениеЗаполнено(Запись.ДатаСоздания) Тогда
					Запись.ДатаСоздания = Сейчас;
				Иначе
					Запись.ДатаРедакции = Сейчас;
				КонецЕсли;
				
				Запись.Ответственный = Ответственный;		      	
				
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РегистрСведенийПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	Если не отказ тогда		
		
		Если ОбщийМодульПовтор.ПолучитьПараметрСеанса("ИспользоватьЖурналированиеСобытий") Тогда
			
			Ответственный = ОбщийМодульПовтор.ПолучитьПараметрСеанса("ТекущийПользователь");
			
			ЖурналСобытий = РегистрыСведений.ЖурналСобытий.СоздатьМенеджерЗаписи();
			ЖурналСобытий.Активность = Истина;
			ЖурналСобытий.Ответственный = Ответственный;
			ЖурналСобытий.Период = ТекущаяДата();
			ЖурналСобытий.Описание = " " + сокрлп(типзнч(Источник));
			ЖурналСобытий.Событие = Перечисления.СобытияЖурнала.ЗаписьРегистраСведений;
			
			Попытка //Записи в регистр сведений 
				//%%10			
				ЖурналСобытий.Записать(Истина);
				
			Исключение //Записи в регистр сведений 
				если ОбщийМодульПовторВТеченииСервера.ВыводитьСообщенияМожно() тогда
					ОбщийМодульСервисСервер.ДобавитьСообщениеПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ошибка при попытке записи в журнал:") + " " + ЖурналСобытий + " " + ОписаниеОшибки(), , );
					//Сообщение = Новый СообщениеПользователю;
					//Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ошибка при попытке записи в журнал:") + " " + ЖурналСобытий + " " + ОписаниеОшибки();
					//Сообщение.Сообщить();                                               	
				КонецЕсли;
				
			КонецПопытки; //Записи в регистр сведений
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РегистрНакопленияПередЗаписью(Источник, Отказ, Замещение) Экспорт
	
	Если ОбщийМодульПовтор.ПолучитьПараметрСеанса("ДействуетЗапретИзмененийПрошлого") Тогда
		
		Отказ = НЕ Источник.количество() = 0 И НЕ ОбщийМодульСервер.ПроверитьДоступностьДокументаПрошлого(Источник[0].Период, );		
	КонецЕсли;
	
	Если НЕ Отказ		
		и ОбщийМодульПовтор.ПолучитьПараметрСеанса("ИспользоватьЖурналированиеСобытий")
		и НЕ Источник.количество() = 0 Тогда
		
		ПодходящийВидОбъекта = ОбщийМодульПовтор.ВыяснитьПодходящийВидОбъекта(источник.метаданные().имя, 1);		
		
		Если ПодходящийВидОбъекта Тогда
			
			Сейчас = ТекущаяДата();
			Ответственный = ОбщийМодульПовтор.ПолучитьПараметрСеанса("ТекущийПользователь");
			Для Каждого Запись Из Источник Цикл
				Если НЕ ЗначениеЗаполнено(Запись.ДатаСоздания) Тогда
					Запись.ДатаСоздания = Сейчас;
				Иначе
					Запись.ДатаРедакции = Сейчас;
				КонецЕсли;
				
				Запись.Ответственный = Ответственный;		
			КонецЦикла;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РегистрНакопленияПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	
КонецПроцедуры

Процедура УдалениеЦеныПриЗаписи(Источник, Отказ, Замещение) Экспорт
	
	Если Источник.Количество() = 0 
		и Замещение Тогда //удаление
		
		ОбщийМодульСервер.УдалитьВсеЗависимыеЦены(Источник.Отбор.номенклатура.Значение, Источник.Отбор.ВидЦен.Значение, Источник.Отбор.Период.Значение);
	КонецЕсли;
	
КонецПроцедуры
