
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	ДокументДляПечати = Новый ТабличныйДокумент;
	Печать(ДокументДляПечати, ПараметрКоманды);
	ДокументДляПечати.ОтображатьСетку = Ложь;
	ДокументДляПечати.Защита = Ложь;
	ДокументДляПечати.ТолькоПросмотр = Ложь;
	ДокументДляПечати.ОтображатьЗаголовки = Ложь;
	ДокументДляПечати.Показать();
	//}}

КонецПроцедуры

&НаСервере
Процедура Печать(ДокументДляПечати, ПараметрКоманды)
	Справочники.ПодпискиНаСобытия.Печать(ДокументДляПечати, ПараметрКоманды);
КонецПроцедуры
