// sza140420-1549
// sza140220-2330

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("001290", , , );

	Если НЕ Отказ Тогда
		ПараметрыФормы = Новый Структура("", );
		ОткрытьФорму("Документ.ОказанияУслугЗаВремя.Форма.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник);// , ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	КонецЕсли;

КонецПроцедуры
