// sza131216-1219  
// sza131212-0306  
&НаКлиенте
Процедура отображатьКартинкуПриИзменении(Элемент)
	
	ЭтаФорма.Элементы.ГруппаСправа.Видимость = отображатьКартинку;
	ЭтаФорма.ОбновитьОтображениеДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЭтаФорма.Элементы.Список.ПодчиненныеЭлементы.ссылкаНаКартинку.Видимость  = отображатьКартинку;
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаСервереБезКонтекста
функция    ПолучитьСтруктуруИзображения(СсылкаНаЭлементИзображение)
	
	Результат = Новый Структура("ИзображениеВБазеДанных", СсылкаНаЭлементИзображение.ИзображениеВБазеДанных);
	Результат.Вставить("подссылку", "");
	
	Если Результат.ИзображениеВБазеДанных Тогда
		
		результат.подссылку = ПолучитьНавигационнуюСсылку(СсылкаНаЭлементИзображение, "ХранилищеИзображения");
		
		РазмерПриОтображении = СсылкаНаЭлементИзображение.РазмерПриОтображении;
		
		Если НЕ ЗначениеЗаполнено(РазмерПриОтображении) 
			ИЛИ РазмерПриОтображении = Перечисления.РазмерыКартинок.АвтоРазмер тогда
			
			результат.Вставить("РазмерПриОтображении", 1);
		ИначеЕсли РазмерПриОтображении = Перечисления.РазмерыКартинок.Пропорционально тогда
			результат.Вставить("РазмерПриОтображении", 2);
		ИначеЕсли РазмерПриОтображении = Перечисления.РазмерыКартинок.Растянуть тогда
			результат.Вставить("РазмерПриОтображении", 3);
		ИначеЕсли РазмерПриОтображении = Перечисления.РазмерыКартинок.РеальныйРазмер тогда
			результат.Вставить("РазмерПриОтображении", 4);
		ИначеЕсли РазмерПриОтображении = Перечисления.РазмерыКартинок.Черепица тогда
			результат.Вставить("РазмерПриОтображении", 5);
		Иначе
			результат.Вставить("РазмерПриОтображении", 1);
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(СсылкаНаЭлементИзображение.ИмяФайлаИзображения) Тогда
		результат.подссылку = "<!DOCTYPE html PUBLIC ""-//W3C//DTD XHTML 1.0 Transitional//EN"" 
		|""http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"">
		|<HTML style=""font-family:arial; font-size:11px;"">
		|<meta http-equiv=""Content-Type"" content=""text/html; charset=utf-8""/>
		|<img src = """ + СсылкаНаЭлементИзображение.ИмяФайлаИзображения + """>
		|</HTML>";
		результат.Вставить("РазмерПриОтображении", 1);
		
	ИначеЕсли ЗначениеЗаполнено(СсылкаНаЭлементИзображение.СсылкаНаИзображение) Тогда
		результат.подссылку = "<!DOCTYPE html PUBLIC ""-//W3C//DTD XHTML 1.0 Transitional//EN"" 
		|""http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd"">
		|<HTML style=""font-family:arial; font-size:11px;"">
		|<meta http-equiv=""Content-Type"" content=""text/html; charset=utf-8""/>
		|<img src = """ + СсылкаНаЭлементИзображение.СсылкаНаИзображение + """>
		|</HTML>";
		результат.Вставить("РазмерПриОтображении", 1);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТекущийЭлементСписка = Элементы.Список.ТекущаяСтрока;
	Если ЗначениеЗаполнено(ТекущийЭлементСписка) Тогда
		СтруктураИзображения = ПолучитьСтруктуруИзображения(ТекущийЭлементСписка);
		ПодСсылку = СтруктураИзображения.ПодСсылку;
		Элементы.СсылкаНаИзображение.Видимость 	  = НЕ СтруктураИзображения.ИзображениеВБазеДанных;
		Элементы.ИзображениеВБазеДанных.Видимость = СтруктураИзображения.ИзображениеВБазеДанных;
		если СтруктураИзображения.РазмерПриОтображении = 1 тогда
			Элементы.ИзображениеВБазеДанных.РазмерКартинки = РазмерКартинки.АвтоРазмер
		иначеесли СтруктураИзображения.РазмерПриОтображении = 2 тогда
			Элементы.ИзображениеВБазеДанных.РазмерКартинки = РазмерКартинки.Пропорционально
		иначеесли СтруктураИзображения.РазмерПриОтображении = 3 тогда
			Элементы.ИзображениеВБазеДанных.РазмерКартинки = РазмерКартинки.Растянуть
		иначеесли СтруктураИзображения.РазмерПриОтображении = 4 тогда
			Элементы.ИзображениеВБазеДанных.РазмерКартинки = РазмерКартинки.РеальныйРазмер
		иначеесли СтруктураИзображения.РазмерПриОтображении = 5 тогда
			Элементы.ИзображениеВБазеДанных.РазмерКартинки = РазмерКартинки.Черепица
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьСобственныйПереводЭлементовИнтерфейса") Тогда
		ОбщийМодульСервер.ПеревестиРеквизитыФормы(ЭтаФорма);	
	КонецЕсли;
	
	ОбщийМодульСервер.ОбеспечитьСписокОтборов(Список);
	
КонецПроцедуры
