//sza140915-0023
Процедура НаПечать(ТабДок, Ссылка) Экспорт
	
	Макет = Справочники.Спецификации.ПолучитьМакет("НаПечать");
	Макет.КодЯзыкаМакета = ОбщийМодульПовтор.ПолучитьТекущийЯзыкДокументов();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Спецификации.ВерсияСпецификации,
	|	Спецификации.Дата,
	|	Спецификации.ДатаРедакции,
	|	Спецификации.ДатаСоздания,
	|	Спецификации.ДополнительныйКоэффициентКСебестоимости,
	|	Спецификации.Код,
	|	Спецификации.Комментарий,
	|	Спецификации.Наименование,
	|	Спецификации.НеАктуальна,
	|	Спецификации.ОбщееВремя,
	|	Спецификации.Ответственный,
	|	Спецификации.ДополнительныеРасходы.(
	|		НомерСтроки,
	|		Статья,
	|		Сумма,
	|		Валюта,
	|		Курс,
	|		НеРаспределятьНаСтоимость,
	|		ОСтроке ),
	|	Спецификации.ЗадействованныеСредства.(
	|		НомерСтроки,
	|		Средство,
	|		ДатаНачала,
	|		ДатаОкончания,
	|		Коэффициент,
	|		ОСтроке ),
	|	Спецификации.Материалы.(
	|		НомерСтроки,
	|		Номенклатура,
	|		Спецификация,
	|		Количество,
	|		ОСтроке ),
	|	Спецификации.Работы.(
	|		НомерСтроки,
	|		Номенклатура,
	|		Количество,
	|		ВремяВыполнения,
	|		ОСтроке ),
	|	Спецификации.Товары.(
	|		НомерСтроки,
	|		Номенклатура,
	|		ЕдиницаИзмерения,
	|		Количество,
	|		ОСтроке )
	|ИЗ Справочник.Спецификации КАК Спецификации
	|ГДЕ Спецификации.Ссылка В (&Ссылка)";
	
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок 					= Макет.ПолучитьОбласть("Заголовок");
	Шапка 								= Макет.ПолучитьОбласть("Шапка");
	ОбластьДополнительныеРасходыШапка 	= Макет.ПолучитьОбласть("ДополнительныеРасходыШапка");
	ОбластьДополнительныеРасходы 		= Макет.ПолучитьОбласть("ДополнительныеРасходы");
	ОбластьЗадействованныеСредстваШапка = Макет.ПолучитьОбласть("ЗадействованныеСредстваШапка");
	ОбластьЗадействованныеСредства 		= Макет.ПолучитьОбласть("ЗадействованныеСредства");
	ОбластьМатериалыШапка 				= Макет.ПолучитьОбласть("МатериалыШапка");
	ОбластьМатериалы 					= Макет.ПолучитьОбласть("Материалы");
	ОбластьРаботыШапка 					= Макет.ПолучитьОбласть("РаботыШапка");
	ОбластьРаботы 						= Макет.ПолучитьОбласть("Работы");
	ОбластьТоварыШапка 					= Макет.ПолучитьОбласть("ТоварыШапка");
	ОбластьТовары 						= Макет.ПолучитьОбласть("Товары");
	Подвал 								= Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = ЛОЖЬ;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьДополнительныеРасходыШапка);
		ВыборкаДополнительныеРасходы = Выборка.ДополнительныеРасходы.Выбрать();
		Пока ВыборкаДополнительныеРасходы.Следующий() Цикл
			ОбластьДополнительныеРасходы.Параметры.Заполнить(ВыборкаДополнительныеРасходы);
			ТабДок.Вывести(ОбластьДополнительныеРасходы, ВыборкаДополнительныеРасходы.Уровень());
		КонецЦикла;

		ТабДок.Вывести(ОбластьЗадействованныеСредстваШапка);
		ВыборкаЗадействованныеСредства = Выборка.ЗадействованныеСредства.Выбрать();
		Пока ВыборкаЗадействованныеСредства.Следующий() Цикл
			ОбластьЗадействованныеСредства.Параметры.Заполнить(ВыборкаЗадействованныеСредства);
			ТабДок.Вывести(ОбластьЗадействованныеСредства, ВыборкаЗадействованныеСредства.Уровень());
		КонецЦикла;

		ТабДок.Вывести(ОбластьМатериалыШапка);
		ВыборкаМатериалы = Выборка.Материалы.Выбрать();
		Пока ВыборкаМатериалы.Следующий() Цикл
			ОбластьМатериалы.Параметры.Заполнить(ВыборкаМатериалы);
			ТабДок.Вывести(ОбластьМатериалы, ВыборкаМатериалы.Уровень());
		КонецЦикла;

		ТабДок.Вывести(ОбластьРаботыШапка);
		ВыборкаРаботы = Выборка.Работы.Выбрать();
		Пока ВыборкаРаботы.Следующий() Цикл
			ОбластьРаботы.Параметры.Заполнить(ВыборкаРаботы);
			ТабДок.Вывести(ОбластьРаботы, ВыборкаРаботы.Уровень());
		КонецЦикла;

		ТабДок.Вывести(ОбластьТоварыШапка);
		ВыборкаТовары = Выборка.Товары.Выбрать();
		Пока ВыборкаТовары.Следующий() Цикл
			ОбластьТовары.Параметры.Заполнить(ВыборкаТовары);
			ТабДок.Вывести(ОбластьТовары, ВыборкаТовары.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = ИСТИНА;
	КонецЦикла;
	//}}
КонецПроцедуры



