// sza140915-0023
Процедура НаПечать(ТабДок, Ссылка) Экспорт
	
	ТабДок.ИмяПараметровПечати  = "Спецификация" + СокрЛП(ИмяКомпьютера());
	ТабДок.КлючПараметровПечати = ТабДок.ИмяПараметровПечати;
	
	ТабДок.Очистить();
	
	СсылкаНаОбъектПечати = Ссылка[0];
	
	РазрядМетаданных = ""; ИмяМетаданных = "";
	ПроизвольнаяПечатнаяФорма = ОбщийМодульТекстСервер.ОпределитьПроизвольнуюПечатнуюФорму(, , СсылкаНаОбъектПечати, РазрядМетаданных, ИмяМетаданных);
	
	Если ЗначениеЗаполнено(ПроизвольнаяПечатнаяФорма) Тогда
		ТабДок = ОбщийМодульТекстСервер.СформироватьДокументПоПроизвольнойФорме(ПроизвольнаяПечатнаяФорма, , ТабДок, СсылкаНаОбъектПечати, РазрядМетаданных, ИмяМетаданных);
		
	Иначе		
		Макет = Справочники.Спецификации.ПолучитьМакет("НаПечать");
		Макет.КодЯзыкаМакета = ОбщийМодульПовтор.ПолучитьТекущийЯзыкДокументов();
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ Спецификации.ВерсияСпецификации,
		|	Спецификации.Дата,
		|	Спецификации.ДатаРедакции,
		|	Спецификации.ДатаСоздания,
		|	Спецификации.ДополнительныйКоэффициентКСебестоимости,
		|	Спецификации.Код,
		|	Спецификации.Комментарий,
		|	Спецификации.Наименование,
		|	Спецификации.НеАктуальна,
		|	Спецификации.ОбщееВремя,
		|	Спецификации.Ответственный,
		|	Спецификации.ДополнительныеРасходы.(
		|		НомерСтроки,
		|		Статья,
		|		Сумма,
		|		Валюта,
		|		Курс,
		|		НеРаспределятьНаСтоимость,
		|		ОСтроке ),
		|	Спецификации.ЗадействованныеСредства.(
		|		НомерСтроки,
		|		Средство,
		|		ДатаНачала,
		|		ДатаОкончания,
		|		Коэффициент,
		|		ОСтроке ),
		|	Спецификации.Материалы.(
		|		НомерСтроки,
		|		Номенклатура,
		|		Спецификация,
		|		Количество,
		|		ОСтроке ),
		|	Спецификации.Работы.(
		|		НомерСтроки,
		|		Номенклатура,
		|		Количество,
		|		ВремяВыполнения,
		|		ОСтроке ),
		|	Спецификации.Товары.(
		|		НомерСтроки,
		|		Номенклатура,
		|		ЕдиницаИзмерения,
		|		Количество,
		|		ОСтроке )
		|ИЗ Справочник.Спецификации КАК Спецификации
		|ГДЕ Спецификации.Ссылка В (&Ссылка)";
		
		Запрос.Параметры.Вставить("Ссылка", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		ОбластьЗаголовок 					= Макет.ПолучитьОбласть("Заголовок");
		Шапка 								= Макет.ПолучитьОбласть("Шапка");
		ОбластьДополнительныеРасходыШапка 	= Макет.ПолучитьОбласть("ДополнительныеРасходыШапка");
		ОбластьДополнительныеРасходы 		= Макет.ПолучитьОбласть("ДополнительныеРасходы");
		ОбластьЗадействованныеСредстваШапка = Макет.ПолучитьОбласть("ЗадействованныеСредстваШапка");
		ОбластьЗадействованныеСредства 		= Макет.ПолучитьОбласть("ЗадействованныеСредства");
		ОбластьМатериалыШапка 				= Макет.ПолучитьОбласть("МатериалыШапка");
		ОбластьМатериалы 					= Макет.ПолучитьОбласть("Материалы");
		ОбластьРаботыШапка 					= Макет.ПолучитьОбласть("РаботыШапка");
		ОбластьРаботы 						= Макет.ПолучитьОбласть("Работы");
		ОбластьТоварыШапка 					= Макет.ПолучитьОбласть("ТоварыШапка");
		ОбластьТовары 						= Макет.ПолучитьОбласть("Товары");
		Подвал 								= Макет.ПолучитьОбласть("Подвал");
		
		ВставлятьРазделительСтраниц = ЛОЖЬ;
		Пока Выборка.Следующий() Цикл
			Если ВставлятьРазделительСтраниц Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьЗаголовок);
			ТабДок.Вывести(ОбластьЗаголовок);
			
			Шапка.Параметры.Заполнить(Выборка);
			ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(Шапка);
			ТабДок.Вывести(Шапка, Выборка.Уровень());
			
			ВыборкаДополнительныеРасходы = Выборка.ДополнительныеРасходы.Выбрать();
			Если НЕ ВыборкаДополнительныеРасходы.Количество() = 0 Тогда
				ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьДополнительныеРасходыШапка);
				ТабДок.Вывести(ОбластьДополнительныеРасходыШапка);
				
				Пока ВыборкаДополнительныеРасходы.Следующий() Цикл
					ОбластьДополнительныеРасходы.Параметры.Заполнить(ВыборкаДополнительныеРасходы);
					ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьДополнительныеРасходы);
					ТабДок.Вывести(ОбластьДополнительныеРасходы, ВыборкаДополнительныеРасходы.Уровень());
				КонецЦикла;	
			КонецЕсли;
			
			ВыборкаЗадействованныеСредства = Выборка.ЗадействованныеСредства.Выбрать();
			Если НЕ ВыборкаЗадействованныеСредства.Количество() = 0 Тогда
				ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьЗадействованныеСредстваШапка);
				ТабДок.Вывести(ОбластьЗадействованныеСредстваШапка);
				
				Пока ВыборкаЗадействованныеСредства.Следующий() Цикл
					ОбластьЗадействованныеСредства.Параметры.Заполнить(ВыборкаЗадействованныеСредства);
					ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьЗадействованныеСредства);
					ТабДок.Вывести(ОбластьЗадействованныеСредства, ВыборкаЗадействованныеСредства.Уровень());
				КонецЦикла;	
			КонецЕсли;
			
			ВыборкаМатериалы = Выборка.Материалы.Выбрать();
			Если НЕ ВыборкаМатериалы.Количество() = 0 Тогда
				ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьМатериалыШапка);
				ТабДок.Вывести(ОбластьМатериалыШапка);
				
				Пока ВыборкаМатериалы.Следующий() Цикл
					ОбластьМатериалы.Параметры.Заполнить(ВыборкаМатериалы);
					ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьМатериалы);
					ТабДок.Вывести(ОбластьМатериалы, ВыборкаМатериалы.Уровень());
				КонецЦикла;	
			КонецЕсли;
			
			ВыборкаРаботы = Выборка.Работы.Выбрать();
			Если НЕ ВыборкаРаботы.Количество() = 0 Тогда
				ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьРаботыШапка);
				ТабДок.Вывести(ОбластьРаботыШапка);
				
				Пока ВыборкаРаботы.Следующий() Цикл
					ОбластьРаботы.Параметры.Заполнить(ВыборкаРаботы);
					ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьРаботы);
					ТабДок.Вывести(ОбластьРаботы, ВыборкаРаботы.Уровень());
				КонецЦикла;	
			КонецЕсли;
			
			ВыборкаТовары = Выборка.Товары.Выбрать();
			Если НЕ ВыборкаТовары.Количество() = 0 Тогда
				ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьТоварыШапка);
				ТабДок.Вывести(ОбластьТоварыШапка);
				
				Пока ВыборкаТовары.Следующий() Цикл
					ОбластьТовары.Параметры.Заполнить(ВыборкаТовары);
					ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьТовары);
					ТабДок.Вывести(ОбластьТовары, ВыборкаТовары.Уровень());
				КонецЦикла;	
			КонецЕсли;
			
			Подвал.Параметры.Заполнить(Выборка);
			ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(Подвал);
			ТабДок.Вывести(Подвал);
			
			ВставлятьРазделительСтраниц = ИСТИНА;
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры
