//sza131114-1910
//sza131025-0443
&НаКлиенте
Процедура ПриЗакрытии()                                                  // ПРИ ЗАКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)                                                               // ПРИ ОТКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(параметры.ШтрихКод) Тогда
		ШтрихКод = параметры.ШтрихКод;
	Иначе
		Элементы.ГруппаШК.Видимость = ЛОЖЬ;
	КонецЕсли;
	
КонецПроцедуры



