// Суров С.В <s_surov@mail.ru>

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТекстСообщения = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Внимание! Выполнение полного обмена может занять длительное время. Продолжить?");
	
	ПараметрыОбмена = новый Структура;
	ПараметрыОбмена.Вставить("УзелОбмена", ПараметрКоманды);
	
	Если НЕ ОбщийМодульСервисСервер.ПолучитьВерсиюПлатформы() < 803040000 Тогда
		Выполнить(" ОписаниеОповещения = Новый ОписаниеОповещения(""ВыполнитьОбменОтмена"", ЭтотОбъект, ПараметрыОбмена); ");
		Выполнить(" ПоказатьВопрос(ОписаниеОповещения, ТекстСообщения, РежимДиалогаВопрос.ДаНет); ");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбменОтмена(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	УзелОбмена = ДопПараметры.УзелОбмена;
	
	СостояниеНачалоОбмена = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	"%1 " + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("начат обмен данными с сайтом"),
	Формат(МенеджерОборудованияКлиентПереопределяемый.ДатаСеанса(), "ДЛФ=DT"));
	
	СостояниеУзелОбмена = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("по узлу обмена") + """%1""...",
	УзелОбмена);
	
	Состояние(СостояниеНачалоОбмена,, СостояниеУзелОбмена);
	
	ОбменВыполненСервер(УзелОбмена);
	
	СостояниеОкончаниеОбмена = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	"%1 ""%2""",
	Формат(МенеджерОборудованияКлиентПереопределяемый.ДатаСеанса(), "ДЛФ=DT"),
	УзелОбмена);
	
	ПоказатьОповещениеПользователя(СостояниеОкончаниеОбмена ,,
	ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Обмен с сайтом завершен"),
	БиблиотекаКартинок.ЗнакИнформацияБольшойОранжевый);
	
	Оповестить("ЗавершенСеансОбменаССайтом");
	
КонецПроцедуры

&НаСервере
Функция ОбменВыполненСервер(УзелОбмена)
	
	Если ОбменССайтомПовтИсп.ПолучитьЭтотУзелПланаОбмена(УзелОбмена) Тогда
		
		Возврат ЛОЖЬ;
		
	КонецЕсли;
	
	ОбменССайтомСобытия.ВыполнитьОбмен(УзелОбмена, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Интерактивный обмен"), ЛОЖЬ);
	
	Возврат ИСТИНА;
	
КонецФункции
