// sza101117-1523
// sza101109-1806       
// sza101109-0025       
// sza101020
// 

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("002700", , , );	
	
	Если НЕ Отказ Тогда
		КвоСтрок = ПодсистемаИЭ.ПараметрКомандыТоварыКоличество(ПараметрКоманды);
		
		Если НЕ КвоСтрок = Неопределено Тогда
			Если (КвоСтрок = 0) Тогда				
				ПродолжениеОбработкиКоманды(ПараметрКоманды);
				
			Иначе
				ПоказатьВопрос(Новый ОписаниеОповещения("ОбработкаКомандыЗавершение", ЭтотОбъект, Новый Структура("ПараметрКоманды", ПараметрКоманды)),  ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Очистить таблицу Товары?"), РежимДиалогаВопрос.ДаНет);
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКомандыЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		ПродолжениеОбработкиКоманды(ДополнительныеПараметры.ПараметрКоманды);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжениеОбработкиКоманды(ПараметрКоманды)
	
	ОбщийМодульКлиент.ДобавитьСобытиеЖурнала(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Загрузил таблицу Товары Из файла"), 2, ПараметрКоманды);
	ПодсистемаИЭКлиент.ИмпортЭкспортОбработкаОбмена(
	ПодсистемаИЭКлиент.СоздатьСтруктуруВызоваИмпЭкспОперации(ПараметрКоманды,, ЛОЖЬ,, "З", "Товары")
	); // Экспорт  (ИСТИНА) /Импорт (ЛОЖЬ), К/С/З - карточка, список, Товары 
	
КонецПроцедуры
