//sza101117-1523
//sza101109-1806       
//sza101109-0025       
//sza101020
//
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("002700", , , );	
	
	Если НЕ Отказ Тогда
	КвоСтрок = ПодсистемаИЭИмпортЭкспортФС.параметркомандыТоварыколичество(ПараметрКоманды);
	
	Если НЕ КвоСтрок = Неопределено 
		И (КвоСтрок = 0 ИЛИ Вопрос(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Очистить таблицу Товары?"), РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да) Тогда
		
		ОбщийМодульКлиент.ДобавитьСобытиеЖурнала(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Загрузил таблицу Товары из файла"), 2, ПараметрКоманды);
		ПодсистемаИЭИмпортЭкспортФСКлиент.ИмпортЭкспортОбработкаОбмена(
			ПодсистемаИЭИмпортЭкспортФСКлиент.СоздатьСтруктуруВызоваИмпЭкспОперации(ПараметрКоманды,, ЛОЖЬ,, "З", "Товары")
		); //Экспорт  (ИСТИНА) /Импорт (ЛОЖЬ), К/С/З - карточка, список, Товары 
		
	КонецЕсли;	
			  КонецЕсли;
	
КонецПроцедуры



