//sza131005-0239 : 

&НаКлиенте
Процедура ПрименитьЭтиОтборыИЗаполнитьНоменклатуруДокумента(Команда)
	ЭтаФорма.Закрыть(ПрименитьЭтиОтборыИЗаполнитьНоменклатуруДокументаНаСервере());
КонецПроцедуры

&НаСервере
Функция ПрименитьЭтиОтборыИЗаполнитьНоменклатуруДокументаНаСервере()
	СтруктураОтбора = Новый Структура;
	
	ГруппыНоменклатуры = Новый СписокЗначений;
	Для Каждого СтрГрН из Объект.ОтборПоГруппамНоменклатуры Цикл
		ГруппыНоменклатуры.Добавить(СтрГрН.ГруппаНоменклатуры);
	КонецЦикла;
	СтруктураОтбора.Вставить("ГруппыНоменклатуры", ГруппыНоменклатуры);
	
	НоменклатурныеГруппы = Новый СписокЗначений;
	Для Каждого СтрГрН из Объект.ОтборПоНоменклатурнымГруппам Цикл
		НоменклатурныеГруппы.Добавить(СтрГрН.НоменклатурнаяГруппа);
	КонецЦикла;
	СтруктураОтбора.Вставить("НоменклатурныеГруппы", НоменклатурныеГруппы);
	
	Производители = Новый СписокЗначений;
	Для Каждого СтрГрН из Объект.ОтборПоПроизводителям Цикл
		Производители.Добавить(СтрГрН.Производитель);
	КонецЦикла;
	СтруктураОтбора.Вставить("Производители", Производители);
	
	Регионы = Новый СписокЗначений;
	Для Каждого СтрГрН из Объект.ОтборПоРегионам Цикл
		Регионы.Добавить(СтрГрН.Регион);
	КонецЦикла;
	СтруктураОтбора.Вставить("Регионы", Регионы);
	
	Возврат СтруктураОтбора;
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)                                                                    // ПРИ ОТКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()                                                  // ПРИ ЗАКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры
