// sza140420-1553
// sza140110-2348 :

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("000200", , , );

	Если НЕ Отказ Тогда
		ПараметрыФормы = Новый Структура("Склад", ПараметрКоманды);
		ОткрытьФорму("ЖурналДокументов.ДокументыДвиженийТовара.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);// , ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	КонецЕсли;

КонецПроцедуры
