//sza140420-1641 SZA: 
//sza131005-0249 : 

&НаКлиенте
Процедура ПриОткрытии(Отказ)                                     // ПРИ ОТКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()                                          // ПРИ ЗАКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("000656", ЭтаФорма, Отказ, );	
	Если НЕ Отказ Тогда
	ОбщийМодульСервисСервер.ОформитьФорматКоличества(Элементы.Количество, , Истина);
		ОбщийМодульСервер.ОбеспечитьСписокОтборов(Список);	
	КонецЕсли;
	
КонецПроцедуры
