// sza151106-2337 

Функция ПолучитьНаименованиеАртикулНоменклатуры(ОписаниеНоменклатуры)
	
	ОтветНоменклатураТип = ФабрикаXDTO.Тип("http://ET.ua", "Номенклатура");
	ОтветНоменклатура = ФабрикаXDTO.Создать(ОтветНоменклатураТип);
	ОтветНоменклатура.Наименование = "NOT FOUND";
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Номенклатура.Ссылка,
	               |	Номенклатура.Артикул,
	               |	Номенклатура.Наименование
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура";
	Если НЕ ПустаяСтрока(ОписаниеНоменклатуры) Тогда
		Запрос.Текст = Запрос.Текст + "
			       |ГДЕ
	               |	Номенклатура.Наименование Подобно &Наименование";
		Запрос.УстановитьПараметр("Наименование", "%" + ОписаниеНоменклатуры + "%");
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ОтветНоменклатура.Наименование = Выборка.Наименование;
		ОтветНоменклатура.Артикул = Выборка.Артикул;;
	КонецЦикла;
	
	Возврат ОтветНоменклатура;
	
КонецФункции
