// sza160221-0217 

Процедура НаПечать(ТабДок, Ссылка) Экспорт
	
	Макет = Справочники.ПозицииДляОказанияУслугЗаВремяНомера.ПолучитьМакет("НаПечать");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПозицииДляОказанияУслугЗаВремяНомера.SKU,
	|	ПозицииДляОказанияУслугЗаВремяНомера.Вес,
	|	ПозицииДляОказанияУслугЗаВремяНомера.ВидЦен,
	|	ПозицииДляОказанияУслугЗаВремяНомера.Виртуальная,
	|	ПозицииДляОказанияУслугЗаВремяНомера.Высота,
	|	ПозицииДляОказанияУслугЗаВремяНомера.ДатаНачала,
	|	ПозицииДляОказанияУслугЗаВремяНомера.ДатаОкончания,
	|	ПозицииДляОказанияУслугЗаВремяНомера.Длина,
	|	ПозицииДляОказанияУслугЗаВремяНомера.КатегорияПозиции,
	|	ПозицииДляОказанияУслугЗаВремяНомера.Код,
	|	ВЫРАЗИТЬ(ПозицииДляОказанияУслугЗаВремяНомера.Комментарий КАК Строка(1000)) КАК Комментарий,
	|	ПозицииДляОказанияУслугЗаВремяНомера.Наименование,
	|	ПозицииДляОказанияУслугЗаВремяНомера.НеАктивно,
	|	ПозицииДляОказанияУслугЗаВремяНомера.ОсновнойШтрихКод,
	|	ПозицииДляОказанияУслугЗаВремяНомера.ПроЗакрепленныеСотрудники,
	|	ПозицииДляОказанияУслугЗаВремяНомера.Секция,
	|	ПозицииДляОказанияУслугЗаВремяНомера.Склад,
	|	ПозицииДляОказанияУслугЗаВремяНомера.Средство,
	|	ПозицииДляОказанияУслугЗаВремяНомера.Ширина,
	|	ПозицииДляОказанияУслугЗаВремяНомера.ЗакрепленныеСотрудники.(
	|		НомерСтроки,
	|		Сотрудник,
	|		РольСотрудника,
	|		ОСтроке
	|	)
	|ИЗ Справочник.ПозицииДляОказанияУслугЗаВремяНомера КАК ПозицииДляОказанияУслугЗаВремяНомера
	|ГДЕ ПозицииДляОказанияУслугЗаВремяНомера.Ссылка В (&Ссылка)";
	
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьЗакрепленныеСотрудникиШапка = Макет.ПолучитьОбласть("ЗакрепленныеСотрудникиШапка");
	ОбластьЗакрепленныеСотрудники = Макет.ПолучитьОбласть("ЗакрепленныеСотрудники");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьЗаголовок);
		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(Шапка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьЗакрепленныеСотрудникиШапка);
		ТабДок.Вывести(ОбластьЗакрепленныеСотрудникиШапка);
		ВыборкаЗакрепленныеСотрудники = Выборка.ЗакрепленныеСотрудники.Выбрать();
		Пока ВыборкаЗакрепленныеСотрудники.Следующий() Цикл
			ОбластьЗакрепленныеСотрудники.Параметры.Заполнить(ВыборкаЗакрепленныеСотрудники);
			ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьЗакрепленныеСотрудники);
			ТабДок.Вывести(ОбластьЗакрепленныеСотрудники, ВыборкаЗакрепленныеСотрудники.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	
КонецПроцедуры
