#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// sza151210-2303 про
// sza151022-2126 Склад
// sza140411-1701 : 
// sza140323-1544  
Процедура ПередЗаписью(Отказ)
	
	Если НЕ Отказ
		И НЕ ЭтоГруппа
		И НЕ ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("МассоваяЗагрузка", ИСТИНА)
		И ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ФормироватьОписаниеТаблицОбъектовДляИхСписков") Тогда
		
		ОбщийМодульСервер.ОформитьОписаниеТаблицы(ЭтотОбъект, "ЗакрепленныеСотрудники", "Сотрудник", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("закрепленных сотрудников"));
	КонецЕсли;
	
КонецПроцедуры
Процедура ПриЗаписи(Отказ)
	
	Если НЕ Отказ 
		И НЕ ПометкаУдаления
		И НЕ ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("МассоваяЗагрузка", ИСТИНА)
		И НЕ ОбменДанными.Загрузка 
		И ЭтоГруппа 
		И Модифицированность() Тогда  // для группы
		
		Если ЗначениеЗаполнено(ВидЦен) Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ ПозицииДляОказанияУслугЗаВремяНомера.Ссылка
			|ИЗ Справочник.ПозицииДляОказанияУслугЗаВремяНомера КАК ПозицииДляОказанияУслугЗаВремяНомера
			|ГДЕ ПозицииДляОказанияУслугЗаВремяНомера.ВидЦен <> &ВидЦен
			|	ПозицииДляОказанияУслугЗаВремяНомера.Склад <> &Склад
			|	И ПозицииДляОказанияУслугЗаВремяНомера.Родитель = &Родитель
			|	И ПозицииДляОказанияУслугЗаВремяНомера.Предопределенный = ЛОЖЬ
			|	И ПозицииДляОказанияУслугЗаВремяНомера.ПометкаУдаления = ЛОЖЬ";
			
			Запрос.УстановитьПараметр("ВидЦен", ВидЦен);
			Запрос.УстановитьПараметр("Склад", Склад);
			Запрос.УстановитьПараметр("Родитель", ссылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			Если НЕ РезультатЗапроса.Пустой() Тогда					
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					
					СледуетЗаписывать = ЛОЖЬ;
					
					ПозицияОбъект = ВыборкаДетальныеЗаписи.ссылка.ПолучитьОбъект();
					ПозицияОбъект.ВидЦен = ВидЦен;	
					ПозицияОбъект.Склад  = Склад;
					ПозицияОбъект.Записать();
					
				КонецЦикла;
				
				Если ОбщийМодульПовторВТеченииСервера.ВыводитьСообщенияМожно() Тогда
					ОбщийМодульСервисСервер.ДобавитьСообщениеПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Обновлены параметры для позиций в группе."), , Ссылка);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
Процедура ПриКопировании(ОбъектКопирования)
	Комментарий = "";
КонецПроцедуры

#КонецЕсли