//sza140411-1701 : 
//sza140323-1544 SZA: 

Процедура ПриКопировании(ОбъектКопирования)
	ЭтотОбъект.комментарий = "";
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если НЕ Отказ 
		И Не ПометкаУдаления 		
		И не ОбменДанными.Загрузка 
		и ЭтоГруппа 
		И Модифицированность() тогда  //для группы
		
		Если ЗначениеЗаполнено(ВидЦен) Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ ПозицииДляОказанияУслугЗаВремяНомера.Ссылка
			|ИЗ Справочник.ПозицииДляОказанияУслугЗаВремяНомера КАК ПозицииДляОказанияУслугЗаВремяНомера
			|ГДЕ ПозицииДляОказанияУслугЗаВремяНомера.ВидЦен <> &ВидЦен
			|	И ПозицииДляОказанияУслугЗаВремяНомера.Родитель = &Родитель
			|	И ПозицииДляОказанияУслугЗаВремяНомера.Предопределенный = ЛОЖЬ
			|	И ПозицииДляОказанияУслугЗаВремяНомера.ПометкаУдаления = ЛОЖЬ";
			
			Запрос.УстановитьПараметр("ВидЦен", ВидЦен);
			Запрос.УстановитьПараметр("Родитель", ссылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			Если НЕ РезультатЗапроса.Пустой() Тогда					
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					
					СледуетЗаписывать = Ложь;
					
					ПозицияОбъект = ВыборкаДетальныеЗаписи.ссылка.ПолучитьОбъект();
					ПозицияОбъект.ВидЦен = ВидЦен;	
					ПозицияОбъект.Записать();
					
				КонецЦикла;
				
				если ОбщийМодульПовторВТеченииСервера.ВыводитьСообщенияМожно() тогда
					ОбщийМодульСервисСервер.ДобавитьСообщениеПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Обновлены параметры для позиций в группе."), , Ссылка);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры
