#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// sza140411-1659 :
// sza140228-0355  

Процедура ПередЗаписью(Отказ)
	
	Если НЕ Отказ 
		И НЕ ПометкаУдаления
		И НЕ ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("МассоваяЗагрузка", ИСТИНА) Тогда
		
		Если ПустаяСтрока(ПрефиксКНомеру) Тогда
			ПрефиксКНомеру = Наименование;
		КонецЕсли;
		
		Отказ = ОбщийМодульСервер.ПроверитьУникальностьЗначенияРеквизита(Отказ, "ВидыСертификатов", Наименование, Ссылка);		
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли