//sza140204-0112 
//sza131008-1738  

&НаКлиенте
Процедура ПриОткрытии(Отказ)            // ПРИ ОТКРЫТИИ
	
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
	
	Если ЗначениеЗаполнено(СтраницаПанели)Тогда
		
		СтраницыПанели  = Элементы.ГруппаСтраниц.ПодчиненныеЭлементы;
		ТекущаяСтраница = СтраницыПанели.получить(СтраницаПанели);
		элементы.ГруппаСтраниц.ТекущаяСтраница = ТекущаяСтраница;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ПоследнийОтчет) Тогда
		этаформа.ТекущийЭлемент = элементы.Найти(ПоследнийОтчет);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()                                                  // ПРИ ЗАКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаКлиенте
Процедура Деньги(Команда)
	
	ФормаОстатоков = ПолучитьФорму("ОбщаяФорма.Деньги");
	ФормаОстатоков.Открыть();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)          // ПРИ СОЗДАНИИ НА СЕРВЕРЕ
	
	ВестиУчетДвиженияДенег 	= ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетДвиженияДенег") ;
	элементы.Декорация3.Видимость = ВестиУчетДвиженияДенег;
	элементы.Декорация1.Видимость = ВестиУчетДвиженияДенег;
	
	ВестиУчетПоПоставщикам 		  = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетПоПоставщикам") ;
	элементы.Декорация7.Видимость = ВестиУчетПоПоставщикам;
	
	ВестиУчетПоКлиентам 		  = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетПоКлиентам") ;
	элементы.Декорация6.Видимость = ВестиУчетПоКлиентам;
	
	ИспользоватьСложныйМеханизмЦен = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ИспользоватьСложныйМеханизмЦен");
	Элементы.ОтчетОстаткиИОборотыОстаткиИОбороты.Видимость = НЕ ИспользоватьСложныйМеханизмЦен;
	
	ВестиУчетОтветственныхЗаСредства = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетЗарплатыСотрудников")
	И ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетСредствПредприятия");
	
	Элементы.Декорация8.Видимость = ВестиУчетОтветственныхЗаСредства;
	Попытка
		Выполнить(" Элементы.ОтчетОбОтветственностиЗаСредстваОткрыть1.Видимость = ВестиУчетОтветственныхЗаСредства; ");
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
		
	ТекущаяСтраница = Элементы.ГруппаСтраниц.ТекущаяСтраница;
	СтраницыПанели  = Элементы.ГруппаСтраниц.ПодчиненныеЭлементы;
	СтраницаПанели  = СтраницыПанели.Индекс(ТекущаяСтраница);
	
	если не этаформа.ТекущийЭлемент = Неопределено тогда
		Попытка
			ПоследнийОтчет = этаформа.ТекущийЭлемент.Имя;       	
		Исключение
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьДнейРождения(Команда)
	ОбщийМодульКлиент.ПечатьДнейРождения(Истина);
КонецПроцедуры
