// sza151218-1356
// sza150623-1727

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура Подтвердить(Команда)

	Контрагент = ОбщийМодульСерверПривилегия.ПроверитьКодовоеСлово(КодовоеСлово, КлиентПредприятия, ПоставщикПредприятия);

	Если ЗначениеЗаполнено(Контрагент) Тогда
		ОбщийМодульСервисСервер.УстановитьЗначениеПараметраСеанса("ОграниченКонтрагент", Контрагент);
		Закрыть(Контрагент);
	Иначе
		ОбщегоНазначения.СообщитьПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ошибка в кодовом слове!"));
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Пользователь = ОбщийМодульСерверПривилегия.ОпределитьПользователя();
	КлиентПредприятия = ЛОЖЬ;
	Выполнить(" КлиентПредприятия = РольДоступна(""КлиентПредприятия""); ");
	ПоставщикПредприятия = ЛОЖЬ;
	Выполнить(" ПоставщикПредприятия = РольДоступна(""ПоставщикПредприятия""); ");
	Элементы.КлиентПредприятия.Видимость 	= КлиентПредприятия;
	Элементы.ПоставщикПредприятия.Видимость = ПоставщикПредприятия;

	ОбщийМодульСервисСервер.ОбработатьНовуюФорму(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура РеакцияНаПрочиеСобытияФормы(КомандаСобытияФормы) Экспорт // Для реакции на события для запрограммированных элементов
	ОбщийМодульКлиент.РеакцияНаПрочиеСобытияФормы(КомандаСобытияФормы, ЭтаФорма);
КонецПроцедуры
