// sza151218-1356 
// sza150623-1727 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Пользователь = ОбщийМодульСерверПривилегия.ОпределитьПользователя();
	
	КлиентПредприятия = ЛОЖЬ;
	Выполнить(" КлиентПредприятия = РольДоступна(""КлиентПредприятия""); ");
	
	ПоставщикПредприятия = ЛОЖЬ;
	Выполнить(" ПоставщикПредприятия = РольДоступна(""ПоставщикПредприятия""); ");
	
	Элементы.КлиентПредприятия.Видимость 	= КлиентПредприятия;
	Элементы.ПоставщикПредприятия.Видимость = ПоставщикПредприятия;
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура Подтвердить(Команда)
	
	Контрагент = ОбщийМодульСерверПривилегия.ПроверитьКодовоеСлово(КодовоеСлово, КлиентПредприятия, ПоставщикПредприятия);
	Если ЗначениеЗаполнено(Контрагент) Тогда
		ОбщийМодульСервисСервер.УстановитьЗначениеПараметраСеанса("ОграниченКонтрагент", Контрагент);
		Закрыть(Контрагент);
	Иначе
		Сообщить(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ошибка в кодовом слове!"));
	КонецЕсли;
	
КонецПроцедуры
