// sza151210-2350 про
// sza151031-1557
Процедура ПриКопировании(ОбъектКопирования)
	Комментарий = "";
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если НЕ Отказ Тогда
		
		ТовараВКоличестве = Товары.Итог("Количество");
		ТовараНаСумму 	  = 0;
		Поставщик = ПредопределенноеЗначение("Справочник.Поставщики.ПустаяСсылка");
		Договор   = ПредопределенноеЗначение("Справочник.Договора.ПустаяСсылка");
		
		Для Каждого СтрокаПредложения Из Предложения Цикл
			Если СтрокаПредложения.Тендер Тогда
				ТовараНаСумму = СтрокаПредложения.Сумма;
				Поставщик = СтрокаПредложения.Поставщик;
				Договор = СтрокаПредложения.Договор;
				Если ДатаПоставки = '00010101000000' Тогда
					ДатаПоставки = СтрокаПредложения.ДатаПоставки;
				КонецЕсли;
				Если НЕ СтатусТендера = ПредопределенноеЗначение("Перечисление.СтатусыТендеров.Состоялся") Тогда
					СтатусТендера = ПредопределенноеЗначение("Перечисление.СтатусыТендеров.Состоялся")
				КонецЕсли;
				
				Прервать;
			КонецЕсли;	
		КонецЦикла;	
		
		Если НЕ Отказ
			И ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ФормироватьОписаниеТаблицОбъектовДляИхСписков") Тогда
			
			ОбщийМодульСервер.ОформитьОписаниеТаблицы(ЭтотОбъект);
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Номенклатура") Тогда
		НаправлениеДеятельности = ДанныеЗаполнения.НаправлениеДеятельности;
		СтрокаТовары = Товары.Добавить();
		СтрокаТовары.Номенклатура = ДанныеЗаполнения.Ссылка;
		СтрокаТовары.Количество = 1;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Поставщики") Тогда
		ВидЦен = ДанныеЗаполнения.ВидЦен;
		НаправлениеДеятельности = ДанныеЗаполнения.НаправлениеДеятельности;
		Склад = ДанныеЗаполнения.Склад;
		СтрокаПредложения = Предложения.Добавить();
		СтрокаПредложения.Поставщик = ДанныеЗаполнения.Ссылка;
		СтрокаПредложения.Валюта = ДанныеЗаполнения.ОсновнаяВалюта;
		СтрокаПредложения.Условия = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("В приоритете");
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВнутренниеЗаказы") Тогда
		Склад = ДанныеЗаполнения.Склад;
		ТовараВКоличестве = ДанныеЗаполнения.ТовараВКоличестве;
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
			НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
			НоваяСтрока.ОСтроке = ТекСтрокаТовары.ОСтроке;
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.События") Тогда		
		ТовараВКоличестве = ДанныеЗаполнения.ТовараВКоличестве;
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
			НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
			НоваяСтрока.ОСтроке = ТекСтрокаТовары.ОСтроке;
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РасходыТовара") Тогда
		
		НаправлениеДеятельности = ДанныеЗаполнения.НаправлениеДеятельности;
		Организация = ДанныеЗаполнения.Организация;
		Склад = ДанныеЗаполнения.Склад;
		Если ДанныеЗаполнения.ЭтоЗаказ Тогда
			ЗаказКлиента = ДанныеЗаполнения.Ссылка;	
		КонецЕсли;
		ТовараВКоличестве = ДанныеЗаполнения.ТовараВКоличестве;
		
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.ЕдиницаИзмерения = ТекСтрокаТовары.ЕдиницаИзмерения;
			НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
			НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
			НоваяСтрока.ОСтроке = ТекСтрокаТовары.ОСтроке;
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Спецификации") Тогда
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.ЕдиницаИзмерения = ТекСтрокаТовары.ЕдиницаИзмерения;
			НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
			НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
			НоваяСтрока.ОСтроке = ТекСтрокаТовары.ОСтроке;
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПланыПродаж") Тогда
		НаправлениеДеятельности = ДанныеЗаполнения.НаправлениеДеятельности;
		Склад = ДанныеЗаполнения.Склад;
		ТовараВКоличестве = ДанныеЗаполнения.ТовараВКоличестве;
		
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
			НоваяСтрока.Номенклатура = ТекСтрокаТовары.НоменклатураИлиГруппа;
			НоваяСтрока.ОСтроке = ТекСтрокаТовары.ОСтроке;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
