// sza110729-1227 
// sza110728-1741 
// sza110721-1709 
// sza110708-1517 
// sza110506-0036 ЦенаСтроки
// sza110413-2110 
// sza110413-1345 код
// sza110327-2044 
// sza110326-1934 
// sza110324-1151 
// sza110323
// sza110322-1905
// sza110322-1652 
// sza110321-2312 
// sza110321-1958 фикс
// sza110321-1640 сообщения
// sza110320-0000 
// sza110319-1841 
// 
Функция   ОкруглитьДо(Знач ЗначениеОкругления, Знач ЗнаковПослеЗапятой = 2) // Экспорт
	
	ЧислоУмножения = 1;
	Счетчик = 1;
	Пока Счетчик <= ЗнаковПослеЗапятой Цикл 	
		ЧислоУмножения = ЧислоУмножения * 10;
		Счетчик = Счетчик + 1;
	КонецЦикла;
	
	Результат = Окр(ЗначениеОкругления * ЧислоУмножения, 0, РежимОкругления.Окр15как20) / ЧислоУмножения; 
	
	Возврат Результат;
	
КонецФункции // ОкруглитьДо(УчастникСебестоимости.СуммаФакт, 6)

Функция   ПолучитьЗначениеРеквизитаОбъектаПоСсылке(СсылкаНаОбъект, НаименованиеРеквизита = "Наименование") Экспорт	
	Возврат СсылкаНаОбъект[ НаименованиеРеквизита ];	
КонецФункции // ПолучитьЗначениеРеквизитаОбъектаПоСсылке

Функция   ПолучитьКартинкуФайла(ФайлКартинки) Экспорт
	
	Если НЕ ФайлКартинки.Пустая() Тогда
		Возврат ПолучитьНавигационнуюСсылку(ФайлКартинки.ТекущаяВерсия, "ФайлХранилище")
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции // ПодсистемаИЭДополнительныеРазработки.ПолучитьКартинкуФайла(ФайлКартинки)
