//sza141108-1410

&НаСервере
Процедура ЗаблокироватьЗапись()
	
	ОбщийМодульСервер.ОбработатьБлокировку(, ЭтаФорма);	
	Элементы.Сегодня.Доступность 		= ЛОЖЬ;
	Элементы.НаНачалоМесяца.Доступность = ЛОЖЬ;
	Элементы.Цена.Доступность 		  	= ЛОЖЬ;
	Элементы.Номенклатура.Доступность 	= ЛОЖЬ;
	Элементы.Период.Доступность 		= ЛОЖЬ;
	
КонецПроцедуры

&НаКлиенте
Процедура НаНачалоМесяца(Команда)
	Запись.Период = НачалоМесяца(Запись.Период);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	глЧислоОбъектов = глЧислоОбъектов + 1; глПроверятьСообщения = ИСТИНА;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()                                               // ПРИ ЗАКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)                                         // ПРИ ОТКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0, Запись.Ответственный, ИСТИНА);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)          // ПРИ СОЗДАНИИ НА СЕРВЕРЕ
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("002350", ЭтаФорма, Отказ, );	
	
	Если НЕ Отказ Тогда
		ОсновнаяВалюта = ПредопределенноеЗначение("Справочник.Валюты.ОсновнаяВалюта");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Сегодня(Команда)
	Запись.Период = ОбщийМодульКлиент.ПользователяТекущаяДата();
КонецПроцедуры
