// sza141228-0510

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	// Процедура добавляет запись в регистр по переданным значениям структуры
	Процедура ДобавитьЗапись(СтруктураЗаписи) Экспорт

		Попытка
			Выполнить(" ОбменДаннымиСервер.ДобавитьЗаписьВРегистрСведений(СтруктураЗаписи, ""СостоянияОбменовДанными""); ");
		Исключение
		КонецПопытки;

	КонецПроцедуры

	Процедура УдалитьЗапись(СтруктураЗаписи) Экспорт

		Попытка
			Выполнить(" ОбменДаннымиСервер.УдалитьНаборЗаписейВРегистреСведений(СтруктураЗаписи, ""СостоянияОбменовДанными""); ");
		Исключение
		КонецПопытки;

	КонецПроцедуры

#КонецЕсли
