//sza140601-2059 SZA: 
//sza130905-1654 : 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)          // ПРИ СОЗДАНИИ НА СЕРВЕРЕ
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("000650", ЭтаФорма, Отказ, );
	
	Если НЕ Отказ Тогда
		ВсегоДолгПоставщиков = ОбновитьВсегоДолгПоставщиков();
		НаименованиеОсновнойВалюты = Справочники.Валюты.ОсновнаяВалюта.Наименование ;
		элементы.ВсегоДолгПоставщиков.Видимость 		= не ВсегоДолгПоставщиков = 0;
		элементы.НаименованиеОсновнойВалюты.Видимость 	= не ВсегоДолгПоставщиков = 0;	
		ОбщийМодульСервер.ОбеспечитьСписокОтборов(Список);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)                                            // ПРИ ОТКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()                                                  // ПРИ ЗАКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаСервереБезКонтекста
Функция   ОбновитьВсегоДолгПоставщиков(Знач ПолучитьОтсроченныеОстатки = Ложь)
	
	ВсегоДолгПоставщиков = 0;
	
	Запрос = Новый Запрос;
	Если ПолучитьОтсроченныеОстатки Тогда
		Запрос.Текст = "ВЫБРАТЬ РасчетыСПоставщикамиОстатки.СуммаОстаток
		|ИЗ РегистрНакопления.РасчетыСПоставщиками.Остатки(&ТекущаяДата, ) КАК РасчетыСПоставщикамиОстатки";	
		
	Иначе
		Запрос.Текст = "ВЫБРАТЬ РасчетыСПоставщикамиОстатки.СуммаОстаток
		|ИЗ РегистрНакопления.РасчетыСПоставщикамиСОтсрочкой.Остатки(&ТекущаяДата, ) КАК РасчетыСПоставщикамиОстатки";	
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ТекущаяДата", ОбщийМодульСервисСервер.ПользователяТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ВсегоДолгПоставщиков = ВсегоДолгПоставщиков + ВыборкаДетальныеЗаписи.суммаОстаток;
		КонецЦикла;	
	КонецЕсли;
	
	Возврат ВсегоДолгПоставщиков;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьПоказательДолга(Команда)
	
	ВсегоДолгПоставщиков = ОбновитьВсегоДолгПоставщиков();
	ВсегоПросрочено		 = ОбновитьВсегоДолгПоставщиков(Истина);
	Элементы.Список.Обновить();
	элементы.ВсегоДолгПоставщиков.Видимость 		= не ВсегоДолгПоставщиков = 0;
	элементы.ВсегоПросрочено.Видимость 				= не ВсегоПросрочено = 0;
	элементы.НаименованиеОсновнойВалюты.Видимость 	= (не ВсегоДолгПоставщиков = 0) или (не ВсегоПросрочено = 0);
	
КонецПроцедуры
