//sza150112-2241
//sza140710-1745  локац
//sza140619-1019  
//sza130905-1654 : 
&НаСервереБезКонтекста
Функция   ОбновитьВсегоДолгПоставщиков(Знач ПолучитьОтсроченныеОстатки = ЛОЖЬ)
	
	ВсегоДолгПоставщиков = 0;
	
	Запрос = Новый Запрос;
	Если НЕ ПолучитьОтсроченныеОстатки Тогда
		Запрос.Текст = "ВЫБРАТЬ РасчетыСПоставщикамиОстатки.СуммаОстаток
		|ИЗ РегистрНакопления.РасчетыСПоставщиками.Остатки(&ТекущаяДата, ) КАК РасчетыСПоставщикамиОстатки";	
		
	Иначе
		Запрос.Текст = "ВЫБРАТЬ РасчетыСПоставщикамиОстатки.СуммаОстаток
		|ИЗ РегистрНакопления.РасчетыСПоставщикамиСОтсрочкой.Остатки(&ТекущаяДата, ) КАК РасчетыСПоставщикамиОстатки";	
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ТекущаяДата", ОбщийМодульСервисСервер.ПользователяТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ВсегоДолгПоставщиков = ВсегоДолгПоставщиков + ВыборкаДетальныеЗаписи.суммаОстаток;
		КонецЦикла;	
	КонецЕсли;
	
	Возврат ВсегоДолгПоставщиков;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьПоказательДолга(Команда)
	
	ВсегоДолгПоставщиков = ОбновитьВсегоДолгПоставщиков();
	ВсегоПросрочено		 = ОбновитьВсегоДолгПоставщиков(ИСТИНА);
	Элементы.Список.Обновить();
	Элементы.ВсегоДолгПоставщиков.Видимость 		= не ВсегоДолгПоставщиков = 0;
	Элементы.ВсегоПросрочено.Видимость 				= не ВсегоПросрочено = 0;
	Элементы.НаименованиеОсновнойВалюты.Видимость 	= (не ВсегоДолгПоставщиков = 0) или (не ВсегоПросрочено = 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()                                              // ПРИ ЗАКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)                                         // ПРИ ОТКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)          // ПРИ СОЗДАНИИ НА СЕРВЕРЕ
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("000650", ЭтаФорма, Отказ, );
	
	Если НЕ Отказ Тогда
		НаименованиеОсновнойВалюты = ПредопределенноеЗначение("Справочник.Валюты.ОсновнаяВалюта").Наименование ;
		ИспользоватьМеханизмОтсрочкиПлатежа = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ИспользоватьМеханизмОтсрочкиПлатежа");
		ВсегоДолгПоставщиков = ОбновитьВсегоДолгПоставщиков();
		ВсегоПросрочено		 = ОбновитьВсегоДолгПоставщиков(ИСТИНА);
		Элементы.ВсегоДолгПоставщиков.Видимость 		= не ВсегоДолгПоставщиков = 0;
		Элементы.ВсегоПросрочено.Видимость 				= не ВсегоПросрочено = 0;
		Элементы.НаименованиеОсновнойВалюты.Видимость 	= (не ВсегоДолгПоставщиков = 0) или (не ВсегоПросрочено = 0);
		ОбщийМодульСервер.ОбеспечитьСписокОтборов(Список);
		
		Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьРегионыДляУчетаСтранАЛокацииГородов") Тогда
			Элементы.Регион.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Страна");
			Элементы.Локация.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Город");
		КонецЕсли;
		
		Элементы.Просрочено.Видимость = ИспользоватьМеханизмОтсрочкиПлатежа;
	КонецЕсли;
	
КонецПроцедуры
