//sza131119-2330 
//sza130905-1654 : 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)          // ПРИ СОЗДАНИИ НА СЕРВЕРЕ
	
	ВсегоДолгПоставщиков = ОбновитьВсегоДолгПоставщиков();
    НаименованиеОсновнойВалюты = Справочники.Валюты.ОсновнаяВалюта.Наименование ;
	элементы.ВсегоДолгПоставщиков.Видимость 		= не ВсегоДолгПоставщиков = 0;
	элементы.НаименованиеОсновнойВалюты.Видимость 	= не ВсегоДолгПоставщиков = 0;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)                                                                    // ПРИ ОТКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()                                                  // ПРИ ЗАКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаСервереБезКонтекста
Функция   ОбновитьВсегоДолгПоставщиков()

	ВсегоДолгПоставщиков = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасчетыСПоставщикамиОстатки.СуммаОстаток
	|ИЗ
	|	РегистрНакопления.РасчетыСПоставщиками.Остатки(&ТекущаяДата, ) КАК РасчетыСПоставщикамиОстатки";
	
	Запрос.УстановитьПараметр("ТекущаяДата", ОбщийМодульСервисСервер.ПользователяТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ВсегоДолгПоставщиков = ВсегоДолгПоставщиков + ВыборкаДетальныеЗаписи.суммаОстаток;
		КонецЦикла;	
	КонецЕсли;
	
	Возврат ВсегоДолгПоставщиков;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьПоказательДолга(Команда)
	
	ВсегоДолгПоставщиков = ОбновитьВсегоДолгПоставщиков();
	Элементы.Список.Обновить();
	элементы.ВсегоДолгПоставщиков.Видимость 		= не ВсегоДолгПоставщиков = 0;
	элементы.НаименованиеОсновнойВалюты.Видимость 	= не ВсегоДолгПоставщиков = 0;
	
КонецПроцедуры
