//sza140119-1433 SZA: 
//sza131130-0059 SZA: 

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)	
	Запись.ДатаУстановки = ТекущаяДата();	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Запись.Настройка) Тогда
		ОчиститьТипЗначенияНастройки();
	КонецЕсли;
	
	Элементы.ДатаУстановки.Видимость = ЗначениеЗаполнено(Запись.ДатаУстановки);

КонецПроцедуры

&НаСервере
процедура ОчиститьТипЗначенияНастройки()
		
		ОсновноеЗначение = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты(ПланыВидовХарактеристик.НастройкиПользователей.ПолучитьИмяПредопределенного(Запись.Настройка), Истина);

    	Элементы.ЗначениеНастройки.ОграничениеТипа = Запись.Настройка.ТипЗначения;
    	Запись.ЗначениеНастройки = Элементы.ЗначениеНастройки.ОграничениеТипа.ПривестиЗначение(Запись.ЗначениеНастройки);
    	Элементы.ЗначениеНастройки.ВыбиратьТип = Ложь;
		
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОбновитьПовторноИспользуемыеЗначения();
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеНастройкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОчиститьТипЗначенияНастройки();
//	Элементы.ЗначениеНастройки.ОграничениеТипа = Запись.Настройка.ТипЗначения;
//  Запись.ЗначениеНастройки = Элементы.ЗначениеНастройки.ОграничениеТипа.ПривестиЗначение(Запись.ЗначениеНастройки);
//  Элементы.ЗначениеНастройки.ВыбиратьТип = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеНастройкиПриИзменении(Элемент)
	ОбщийМодульКлиент.ДобавитьСобытиеЖурнала(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Сменил") + " " + Запись.Настройка, 2);
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеНастройкиОчистка(Элемент, СтандартнаяОбработка)
	ОчиститьТипЗначенияНастройки();
КонецПроцедуры
