// sza160210-1615

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Процедура НаПечать(ДокументДляПечати, Ссылка) Экспорт

	Макет = Справочники.Пользователи.ПолучитьМакет("НаПечать");

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Пользователи.ДатаРегистрации,
	|	Пользователи.ДополнительнаяОбработка,
	|	Пользователи.ЗапускатьМодально,
	|	Пользователи.Код,
	|	ВЫРАЗИТЬ(Пользователи.Комментарий КАК СТРОКА(1000)) КАК Комментарий,
	|	Пользователи.Наименование,
	|	Пользователи.НеПозволятьЗакрыть,
	|	Пользователи.Подпись,
	|	Пользователи.ПриЗапускеОткрывать,
	|	Пользователи.ПрограммаКлиентНаСтарте,
	|	Пользователи.ПрограммаКлиентПриОкончании,
	|	Пользователи.ПрограммаСерверНаСтарте,
	|	Пользователи.ПрограммаСерверПриОкончании,
	|	Пользователи.Сотрудник,
	|	Пользователи.Доступ.(
	|		НомерСтроки,
	|		КодПрава,
	|		ОбъектДоступа,
	|		УровеньДоступа,
	|		УсловиеДоступа,
	|		ОСтроке
	|	),
	|	Пользователи.ПринудительныйОтборДанных.(
	|		НомерСтроки,
	|		ГруппаИли,
	|		ОтборИспользуется,
	|		ОбластьОтбора,
	|		РеквизитОбъекта,
	|		УсловиеОтбора,
	|		ЗначениеУсловия,
	|		УсловиеДляОтбора,
	|		ИмяОбластиОтбора,
	|		ОСтроке
	|	),
	|	Пользователи.СкрытьНастройкиОтчетов.(
	|		НомерСтроки,
	|		НаименованиеОтчета,
	|		СкрытьНастройки,
	|		ОСтроке
	|	)
	|ИЗ Справочник.Пользователи КАК Пользователи
	|ГДЕ Пользователи.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);

	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьДоступШапка = Макет.ПолучитьОбласть("ДоступШапка");
	ОбластьДоступ = Макет.ПолучитьОбласть("Доступ");
	ОбластьПринудительныйОтборДанныхШапка = Макет.ПолучитьОбласть("ПринудительныйОтборДанныхШапка");
	ОбластьПринудительныйОтборДанных = Макет.ПолучитьОбласть("ПринудительныйОтборДанных");
	ОбластьСкрытьНастройкиОтчетовШапка = Макет.ПолучитьОбласть("СкрытьНастройкиОтчетовШапка");
	ОбластьСкрытьНастройкиОтчетов = Макет.ПолучитьОбласть("СкрытьНастройкиОтчетов");
	ДокументДляПечати.Очистить();
	ВставлятьРазделительСтраниц = Ложь;

	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ДокументДляПечати.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьЗаголовок);
		ДокументДляПечати.Вывести(ОбластьЗаголовок);
		Шапка.Параметры.Заполнить(Выборка);
		ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(Шапка);
		ДокументДляПечати.Вывести(Шапка, Выборка.Уровень());
		ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьДоступШапка);
		ДокументДляПечати.Вывести(ОбластьДоступШапка);
		ВыборкаДоступ = Выборка.Доступ.Выбрать();

		Пока ВыборкаДоступ.Следующий() Цикл
			ОбластьДоступ.Параметры.Заполнить(ВыборкаДоступ);
			ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьДоступ);
			ДокументДляПечати.Вывести(ОбластьДоступ, ВыборкаДоступ.Уровень());

		КонецЦикла;

		ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьПринудительныйОтборДанныхШапка);
		ДокументДляПечати.Вывести(ОбластьПринудительныйОтборДанныхШапка);
		ВыборкаПринудительныйОтборДанных = Выборка.ПринудительныйОтборДанных.Выбрать();
		Пока ВыборкаПринудительныйОтборДанных.Следующий() Цикл
			ОбластьПринудительныйОтборДанных.Параметры.Заполнить(ВыборкаПринудительныйОтборДанных);
			ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьПринудительныйОтборДанных);
			ДокументДляПечати.Вывести(ОбластьПринудительныйОтборДанных, ВыборкаПринудительныйОтборДанных.Уровень());

		КонецЦикла;

		ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьСкрытьНастройкиОтчетовШапка);
		ДокументДляПечати.Вывести(ОбластьСкрытьНастройкиОтчетовШапка);
		ВыборкаСкрытьНастройкиОтчетов = Выборка.СкрытьНастройкиОтчетов.Выбрать();
		Пока ВыборкаСкрытьНастройкиОтчетов.Следующий() Цикл
			ОбластьСкрытьНастройкиОтчетов.Параметры.Заполнить(ВыборкаСкрытьНастройкиОтчетов);
			ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьСкрытьНастройкиОтчетов);
			ДокументДляПечати.Вывести(ОбластьСкрытьНастройкиОтчетов, ВыборкаСкрытьНастройкиОтчетов.Уровень());

		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;

КонецПроцедуры

#КонецЕсли
