#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// sza151117-0155
// sza140417-2050  
// sza131203-0157  
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Сотрудники") Тогда
		Комментарий  = ДанныеЗаполнения.Комментарий;
		Наименование = ДанныеЗаполнения.Наименование;
		Сотрудник 	 = ДанныеЗаполнения.Ссылка;
		Подпись 	 = ДанныеЗаполнения.Подпись;
	КонецЕсли;
	
КонецПроцедуры
Процедура ПередЗаписью(Отказ)
	
	Если НЕ ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("МассоваяЗагрузка", ИСТИНА) Тогда
		Отказ = ОбщийМодульСервер.ПроверитьУникальностьЗначенияРеквизита(Отказ, "Пользователи", Наименование, Ссылка);
		Если НЕ Отказ Тогда
			Если НЕ ПустаяСтрока(Подпись) Тогда
				Отказ = ОбщийМодульСервер.ПроверитьУникальностьЗначенияРеквизита(Отказ, "Пользователи", Подпись, Ссылка, , , "Подпись");	
			КонецЕсли;
			ОбновитьПовторноИспользуемыеЗначения();	
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли