//sza140228-0418 SZA: 

Процедура Печать(ТабДок, Ссылка) Экспорт
	
	Макет = Справочники.СертификатыГигиеническиеЗаключения.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СертификатыГигиеническиеЗаключения.АдресОрганизацииЭкспертизы,
	|	СертификатыГигиеническиеЗаключения.АдресХраненияНаДиске,
	|	СертификатыГигиеническиеЗаключения.Активен,
	|	СертификатыГигиеническиеЗаключения.ВидДокумента,
	|	СертификатыГигиеническиеЗаключения.ДанныеКонтрактаОПоствкеПредметаЭкспертизыВУкраину,
	|	СертификатыГигиеническиеЗаключения.ДатаВыдачи,
	|	СертификатыГигиеническиеЗаключения.ДатаОкончанияДействия,
	|	СертификатыГигиеническиеЗаключения.ДатаРегистрации,
	|	СертификатыГигиеническиеЗаключения.ДатаРедакции,
	|	СертификатыГигиеническиеЗаключения.ДатаСоздания,
	|	СертификатыГигиеническиеЗаключения.ДатаЭкспертизы,
	|	СертификатыГигиеническиеЗаключения.ДействуетНаТеритории,
	|	СертификатыГигиеническиеЗаключения.ДополнительныйКод,
	|	СертификатыГигиеническиеЗаключения.Зарегистрировал,
	|	СертификатыГигиеническиеЗаключения.Код,
	|	СертификатыГигиеническиеЗаключения.КодУКТВЭД,
	|	СертификатыГигиеническиеЗаключения.Комментарий,
	|	СертификатыГигиеническиеЗаключения.КонтрагентЗаявительЭкспертизы,
	|	СертификатыГигиеническиеЗаключения.Наименование,
	|	СертификатыГигиеническиеЗаключения.НаименованиеОрганизацииЭкспертизы,
	|	СертификатыГигиеническиеЗаключения.НомерДокумента,
	|	СертификатыГигиеническиеЗаключения.НомерИДатаДоговораОпределяющегоПериодДействияЭкспертизы,
	|	СертификатыГигиеническиеЗаключения.НомерИДатаПротоколаЭкспертизы,
	|	СертификатыГигиеническиеЗаключения.Ответственный,
	|	СертификатыГигиеническиеЗаключения.ПериодДействительностиДанногоЗаключения,
	|	СертификатыГигиеническиеЗаключения.РеквизитыТорговойМаркиПредметаЭкспертизы,
	|	СертификатыГигиеническиеЗаключения.ТелефоныОрганизацииЭкспертизы,
	|	СертификатыГигиеническиеЗаключения.ТорговаяМаркаПредметаЭкспертизы,
	|	СертификатыГигиеническиеЗаключения.ФИОРуководителяЭкспертногоПодразделения,
	|	СертификатыГигиеническиеЗаключения.ФИОУтверждающегоОрганизацииЭкспертизы,
	|	СертификатыГигиеническиеЗаключения.ЧислоДополненийКЭкспертизе,
	|	СертификатыГигиеническиеЗаключения.ЧислоИзображенийСканов,
	|	СертификатыГигиеническиеЗаключения.ЧислоСтрокСостава,
	|	СертификатыГигиеническиеЗаключения.Состав.(
	|		НомерСтроки,
	|		Номенклатура,
	|		КодУКТВЭД,
	|		ПолноеНаименованиеИзДокументаЭкспертизы,
	|		Комментарий
	|	),
	|	СертификатыГигиеническиеЗаключения.Изображения.(
	|		НомерСтроки,
	|		ИзображениеИзБазыДанных,
	|		АдресИзображения,
	|		Комментарий,
	|		ИмяФайла,
	|		РасширениеФайла,
	|		ПутьФайла,
	|		ОриентацияЛандшафт
	|	)
	|ИЗ
	|	Справочник.СертификатыГигиеническиеЗаключения КАК СертификатыГигиеническиеЗаключения
	|ГДЕ
	|	СертификатыГигиеническиеЗаключения.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСоставШапка = Макет.ПолучитьОбласть("СоставШапка");
	ОбластьСостав = Макет.ПолучитьОбласть("Состав");
	ОбластьИзображенияШапка = Макет.ПолучитьОбласть("ИзображенияШапка");
	ОбластьИзображения = Макет.ПолучитьОбласть("Изображения");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьСоставШапка);
		ВыборкаСостав = Выборка.Состав.Выбрать();
		Пока ВыборкаСостав.Следующий() Цикл
			ОбластьСостав.Параметры.Заполнить(ВыборкаСостав);
			ТабДок.Вывести(ОбластьСостав, ВыборкаСостав.Уровень());
		КонецЦикла;

		ТабДок.Вывести(ОбластьИзображенияШапка);
		ВыборкаИзображения = Выборка.Изображения.Выбрать();
		Пока ВыборкаИзображения.Следующий() Цикл
			ОбластьИзображения.Параметры.Заполнить(ВыборкаИзображения);
			ТабДок.Вывести(ОбластьИзображения, ВыборкаИзображения.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	
КонецПроцедуры
