//sza140411-1702 : 
//sza111031-1500 

Процедура ПередЗаписью(Отказ)
	
	Если НЕ Отказ 
		И Не ПометкаУдаления Тогда
		
		если не ЭтотОбъект.ЭтоГруппа тогда
			если ЗначениеЗаполнено(ЭтотОбъект.ВидДокумента) Тогда
				Префикс = ЭтотОбъект.ВидДокумента.ПрефиксКНомеру;
			иначе
				префикс = "";
			конецесли;
			
			Правильноеимя = СокрЛП(Префикс + " " + ЭтотОбъект.НомерДокумента + " " + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("От") + " " + формат(ЭтотОбъект.ДатаВыдачи, "ДФ=dd.MM.yy"));
			Если НЕ ЭтотОбъект.Наименование = Правильноеимя Тогда
				ЭтотОбъект.Наименование = Правильноеимя;
			КонецЕсли;
		конецесли;	
	КонецЕсли;
	
КонецПроцедуры
