// sza151210-2306 про
// sza140411-1702 : 
// sza111031-1500 
Процедура ПередЗаписью(Отказ)
	
	Если НЕ Отказ 
		И НЕ ПометкаУдаления Тогда
		
		Если НЕ ЭтоГруппа тогда
			Если ЗначениеЗаполнено(ВидДокумента) Тогда
				Префикс = ВидДокумента.ПрефиксКНомеру;
			Иначе
				префикс = "";
			КонецЕсли;
			
			Правильноеимя = СокрЛП(Префикс + " " + НомерДокумента + " " + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("От") + " " + формат(ДатаВыдачи, "ДФ=dd.MM.yy"));
			Если НЕ Наименование = Правильноеимя Тогда
				Наименование = Правильноеимя;
			КонецЕсли;
		КонецЕсли;	
		
		Если НЕ ЭтоГруппа
			И ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ФормироватьОписаниеТаблицОбъектовДляИхСписков") Тогда
			
			ОбщийМодульСервер.ОформитьОписаниеТаблицы(ЭтотОбъект);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если НЕ Отказ
		И Модифицированность() Тогда
		
		ОбновитьПовторноИспользуемыеЗначения();
	КонецЕсли;
	
КонецПроцедуры
