//sza140411-1702 : 
//sza111031-1500 
Процедура ПередЗаписью(Отказ)
	
	Если НЕ Отказ 
		И НЕ ПометкаУдаления Тогда
		
		Если НЕ ЭтоГруппа тогда
			Если ЗначениеЗаполнено(ВидДокумента) Тогда
				Префикс = ВидДокумента.ПрефиксКНомеру;
			Иначе
				префикс = "";
			КонецЕсли;
			
			Правильноеимя = СокрЛП(Префикс + " " + НомерДокумента + " " + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("От") + " " + формат(ДатаВыдачи, "ДФ=dd.MM.yy"));
			Если НЕ Наименование = Правильноеимя Тогда
				Наименование = Правильноеимя;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры
