//sza140104-0214 : 
//sza131111-0009 : 

Процедура Печать(ТабДок, Ссылка) Экспорт
	
	Макет = Справочники.ПартииПриобретения.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПартииПриобретения.Дата,
	|	ПартииПриобретения.Комментарий,
	|	ПартииПриобретения.Наименование,
	|	ПартииПриобретения.ОбщаяСтоимостьПартии,
	|	ПартииПриобретения.Поставщик,
	|	ПартииПриобретения.ПроцентНаценки,
	|	ПартииПриобретения.СтоимостьТовара,
	|	ПартииПриобретения.СуммаДополнительнойСтоимости,
	|	ПартииПриобретения.СуммаДопРасходов,
	|	ПартииПриобретения.ПроцентыНаценкиПоПроизводителям.(
	|		НомерСтроки,
	|		Производитель,
	|		ПроцентНаценки,
	|		ОСтроке
	|	),
	|	ПартииПриобретения.ДополнительныеРасходы.(
	|		НомерСтроки,
	|		Статья,
	|		Сумма,
	|		Валюта,
	|		Курс,
	|		ОСтроке
	|	)
	|ИЗ
	|	Справочник.ПартииПриобретения КАК ПартииПриобретения
	|ГДЕ
	|	ПартииПриобретения.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьПроцентыНаценкиПоПроизводителямШапка = Макет.ПолучитьОбласть("ПроцентыНаценкиПоПроизводителямШапка");
	ОбластьПроцентыНаценкиПоПроизводителям = Макет.ПолучитьОбласть("ПроцентыНаценкиПоПроизводителям");
	ОбластьДополнительныеРасходыШапка = Макет.ПолучитьОбласть("ДополнительныеРасходыШапка");
	ОбластьДополнительныеРасходы = Макет.ПолучитьОбласть("ДополнительныеРасходы");
	Подвал = Макет.ПолучитьОбласть("Подвал");
	
	ТабДок.Очистить();
	
	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ТабДок.Вывести(ОбластьЗаголовок);
		
		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());
		
		ВыборкаПроцентыНаценкиПоПроизводителям = Выборка.ПроцентыНаценкиПоПроизводителям.Выбрать();
		если не ВыборкаПроцентыНаценкиПоПроизводителям.количество() = 0 Тогда
			ТабДок.Вывести(ОбластьПроцентыНаценкиПоПроизводителямШапка);
			Пока ВыборкаПроцентыНаценкиПоПроизводителям.Следующий() Цикл
				ОбластьПроцентыНаценкиПоПроизводителям.Параметры.Заполнить(ВыборкаПроцентыНаценкиПоПроизводителям);
				ТабДок.Вывести(ОбластьПроцентыНаценкиПоПроизводителям, ВыборкаПроцентыНаценкиПоПроизводителям.Уровень());
			КонецЦикла;                                                     	
		КонецЕсли;
		
		ВыборкаДополнительныеРасходы = Выборка.ДополнительныеРасходы.Выбрать();
		если не ВыборкаДополнительныеРасходы.Количество() = 0 тогда
			ТабДок.Вывести(ОбластьДополнительныеРасходыШапка);
			Пока ВыборкаДополнительныеРасходы.Следующий() Цикл
				ОбластьДополнительныеРасходы.Параметры.Заполнить(ВыборкаДополнительныеРасходы);
				ТабДок.Вывести(ОбластьДополнительныеРасходы, ВыборкаДополнительныеРасходы.Уровень());
			КонецЦикла;	
		КонецЕсли;
		
		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);
		
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если НЕ ОбщийМодульПовтор.ТекущийЯзыкРусский()
		и ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ПоддерживатьНаименованияНаДругихЯзыкахКромеРусского", Истина) Тогда
		
		ВозможноеПредставление = ОбщийМодульПовтор.получитьПредставлениеНаЯзыке(Данные.ссылка, , Истина);
		Если НЕ ВозможноеПредставление = Неопределено Тогда
			Представление = ВозможноеПредставление;
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
