//sza131226-2115 : 
//sza131110-2019 : 

Процедура ПриЗаписи(Отказ)
	
	Если НЕ Отказ 
		и НЕ ПараметрыСеанса.МногоФункциональныйФлаг
		и не ОбщаяСтоимостьПартии = 0
		И (НЕ ОбщийМодульСерверПривилегия.ЕстьПользователи() 
		ИЛИ РольДоступна("ПолныеПрава")) Тогда 	
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КоррекцияПартииПриобретенияРуководителем.Ссылка
		|ИЗ
		|	Документ.КоррекцияПартииПриобретенияРуководителем КАК КоррекцияПартииПриобретенияРуководителем
		|ГДЕ
		|	КоррекцияПартииПриобретенияРуководителем.ПартияПриобретения = &ПартияПриобретения";
		
		Запрос.УстановитьПараметр("ПартияПриобретения", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		если НЕ РезультатЗапроса.Пустой() Тогда
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			ВыборкаДетальныеЗаписи.Следующий();		
			Коррекция = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();			
			
		Иначе
			Коррекция = Документы.КоррекцияПартииПриобретенияРуководителем.СоздатьДокумент();		
			Коррекция.ПартияПриобретения = ссылка;
			Коррекция.Дата = Дата;
			
		КонецЕсли;
		Коррекция.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЕсли;
	
	ПараметрыСеанса.МногоФункциональныйФлаг = Ложь;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если НЕ Отказ Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КоррекцияПартииПриобретенияРуководителем.Ссылка
		|ИЗ
		|	Документ.КоррекцияПартииПриобретенияРуководителем КАК КоррекцияПартииПриобретенияРуководителем
		|ГДЕ
		|	КоррекцияПартииПриобретенияРуководителем.ПартияПриобретения = &ПартияПриобретения";
		
		Запрос.УстановитьПараметр("ПартияПриобретения", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		если не РезультатЗапроса.Пустой() тогда
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Коррекция = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
				Коррекция.Удалить();
			КонецЦикла;	
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)  	
	Отказ = ОбщийМодульСервер.ПроверитьУникальностьНаименование(Отказ, "ПартииПриобретения", ЭтотОбъект.Наименование, ЭтотОбъект.Ссылка);
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ЭтотОбъект.комментарий = "";
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступленияТовара") Тогда
		// Заполнение шапки
		Валюта = ДанныеЗаполнения.Валюта;
		ВидЦен = ДанныеЗаполнения.ВидЦен;
		Дата = ДанныеЗаполнения.Дата;
		Поставщик = ДанныеЗаполнения.КлиентПоставщик;
		Комментарий = ДанныеЗаполнения.Комментарий;
		Курс = ДанныеЗаполнения.Курс;
		СтоимостьТовара = ДанныеЗаполнения.ТовараНаСумму;
		Для Каждого ТекСтрокаДополнительныеРасходы Из ДанныеЗаполнения.ДополнительныеРасходы Цикл
			НоваяСтрока = ДополнительныеРасходы.Добавить();
			НоваяСтрока.Валюта = ТекСтрокаДополнительныеРасходы.Валюта;
			НоваяСтрока.Курс = ТекСтрокаДополнительныеРасходы.Курс;
			НоваяСтрока.ОСтроке = ТекСтрокаДополнительныеРасходы.ОСтроке;
			НоваяСтрока.Статья = ТекСтрокаДополнительныеРасходы.Статья;
			НоваяСтрока.Сумма = ТекСтрокаДополнительныеРасходы.Сумма;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
