//sza140331-1638 : 
&НаКлиенте
Процедура ВыполнитьСменуОсновнойВалютыУчета(Команда)
	
	Если ЗначениеЗаполнено(СменитьНаВалюту)
		И Вопрос(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Вы готовы к необратимой смене основной валюты учета?"), РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		
		состояние(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Смена валюты учета"), , ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ждите.."));
		ВыполнитьСменуОсновнойВалютыУчетаНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьСменуОсновнойВалютыУчетаНаСервере()
	
	ОсновнаяВалюта = ТекущаяОсновнаяВалюта.ПолучитьОбъект();
	Код = ОсновнаяВалюта.Код;
	ОсновнаяВалюта.Код = СменитьНаВалюту.Код;
	Комментарий = ОсновнаяВалюта.Комментарий;
	ОсновнаяВалюта.Комментарий = СменитьНаВалюту.Комментарий;
	Наименование = ОсновнаяВалюта.Наименование;
	ОсновнаяВалюта.Наименование = СменитьНаВалюту.Наименование;
	ОсновнаяВалюта.Записать();
	ТекущаяОсновнаяВалюта = ОсновнаяВалюта.ссылка;
	
	ОбщийМодульТекстСервер.ПередатьПереводыДругомуОбъекту(ТекущаяОсновнаяВалюта, СменитьНаВалюту);
	
	СменитьНаВалютуОбъект = СменитьНаВалюту.ПолучитьОбъект();
	СменитьНаВалютуОбъект.Код = Код;
	СменитьНаВалютуОбъект.Комментарий = Комментарий;
	СменитьНаВалютуОбъект.Наименование = Наименование;
	СменитьНаВалютуОбъект.Записать();
	
	СменитьНаВалюту = СменитьНаВалютуОбъект.ссылка;
	
	Если НЕ НеПереустанавливатьКурсыВалют Тогда
		Курсы = РегистрыСведений.КурсыВалют.СоздатьНаборЗаписей();
		Курсы.Прочитать();
		
		Для Каждого Курс из Курсы Цикл
			Если НЕ курс.Курс = 0 Тогда
				курс.Курс = 1 / курс.Курс;	
			КонецЕсли;
		КонецЦикла;
		Курсы.Записать(ИСТИНА);
		
	КонецЕсли;
	
	Если НЕ НеПересчитыватьЦеныПоКурсу
		И НЕ СтрогийКурсПересчетаЦен = 0 Тогда	
		
		Цены = РегистрыСведений.Цены.СоздатьНаборЗаписей();
		Цены.Прочитать();
		Для Каждого Цена Из Цены Цикл
			Если НЕ цена.Цена = 0 Тогда
				Цена.цена = Цена.цена / СтрогийКурсПересчетаЦен;
			КонецЕсли;	
		КонецЦикла;
		Цены.записать(ИСТИНА);
		
	КонецЕсли;
	
	Если НЕ НеПереоцениватьВзаиморасчетыСКонтрагентами Тогда
		
		//утопия		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
	Если ЗначениеЗаполнено(СменитьНаВалюту) Тогда
		СменитьНаВалютуПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекущаяОсновнаяВалюта = ПредопределенноеЗначение("Справочник.Валюты.ОсновнаяВалюта").ПолучитьОбъект();
	
КонецПроцедуры

&НаКлиенте
Процедура СменитьНаВалютуПриИзменении(Элемент)
	СменитьНаВалютуПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СменитьНаВалютуПриИзмененииНаСервере()
	СтрогийКурсПересчетаЦен = ОбщийМодульПовтор.ПолучитьТекущийКурс(СменитьНаВалюту, ОбщийМодульСервисСервер.ПользователяТекущаяДата());
КонецПроцедуры



