// sza150112-0220 
// sza140916-0253 печать допреквизитов
// sza140710-1231  локация
// sza140601-2055  
// sza131021-1345 : 
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если ОбщийМодульПовтор.ВывестиНаименованияНаДругомЯзыке() Тогда
		
		ВозможноеПредставление = ОбщийМодульПовтор.ПолучитьПредставлениеНаЯзыке(Данные.Ссылка, , ИСТИНА);
		Если НЕ ВозможноеПредставление = Неопределено Тогда
			Представление = ВозможноеПредставление;
			СтандартнаяОбработка = ЛОЖЬ;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ДляУскоренияРаботыСБазойДанныхНеВыводитьДополнительныхДанных") Тогда
		
		Если ВидФормы = "ФормаВыбора" 
			ИЛИ ВидФормы = "ФормаСписка" Тогда
			
			ВыбраннаяФорма = ВидФормы + "Упрощенная";
			СтандартнаяОбработка = ЛОЖЬ;
		ИначеЕсли ВидФормы = "ФормаОбъекта" Тогда
			
			ВыбраннаяФорма = "ФормаЭлементаУпрощенная";
			СтандартнаяОбработка = ЛОЖЬ;
			
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

Процедура Печать(ТабДок, Знач Ссылка) Экспорт
	
	ТабДок.ИмяПараметровПечати  = "Клиент" + СокрЛП(ИмяКомпьютера());
	ТабДок.КлючПараметровПечати = ТабДок.ИмяПараметровПечати;
	
	ТабДок.Очистить();
	
	ПроизвольнаяПечатнаяФорма = ОбщийМодульТекстСервер.ОпределитьПроизвольнуюПечатнуюФорму(ПредопределенноеЗначение("Перечисление.ВидыПечатныхФорм.КарточкаКлиента"));
	
	Если ЗначениеЗаполнено(ПроизвольнаяПечатнаяФорма) Тогда
		ТабДок = ОбщийМодульТекстСервер.СформироватьДокументПоПроизвольнойФорме(ПроизвольнаяПечатнаяФорма, , ТабДок, Ссылка[0], "Справочники", "Клиенты");
		
	Иначе		
		ЭлементСправочника = Ссылка[0];
		
		ТабДок.Начатьавтогруппировкустрок();
		
		Макет = Справочники.Клиенты.ПолучитьМакет("Печать");
		Макет.КодЯзыкаМакета = ОбщийМодульПовтор.ПолучитьТекущийЯзыкДокументов();
		
		ОбластьПечатиДополнительныхРеквизитов = Макет.ПолучитьОбласть("СДР");
		Шапка = Макет.ПолучитьОбласть("Ш");
		Шапка.параметры.заполнить(ЭлементСправочника);
		
		СтруктураДополнительныПараметровМакета = ОбщийМодульСервер.ПолучитьСтруктуруДополнительныхПараметровМакетаПечати();
		Шапка.Параметры.ТекстВШапкеДокументовПриПечати   = СтруктураДополнительныПараметровМакета.ТекстВШапкеДокументовПриПечати;
		
		Регион  = ОбщийМодульПовтор.ПолучитьПредставлениеНаЯзыке(ЭлементСправочника.Регион, , ИСТИНА, ЭлементСправочника.ЯзыкДокументов);
		Если Регион = Неопределено Тогда
			Регион = СокрЛП(ЭлементСправочника.Регион);
		КонецЕсли;		
		Локация = ОбщийМодульПовтор.ПолучитьПредставлениеНаЯзыке(ЭлементСправочника.Локация, , ИСТИНА, ЭлементСправочника.ЯзыкДокументов);
		Если Локация = Неопределено Тогда
			Локация = СокрЛП(ЭлементСправочника.Локация);
		КонецЕсли;		
		
		ВыборкаАдрес = СокрЛП(ЭлементСправочника.Адрес);
		Если Найти(ВыборкаАдрес, "" + СокрЛП(Регион)) = 0 Тогда
			Адрес = "" + СокрЛП(Регион) + ?(ЗначениеЗаполнено(Локация), ", " + СокрЛП(Локация), "") + ", " + ВыборкаАдрес;
		Иначе
			Адрес = ВыборкаАдрес;
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(ЭлементСправочника.ЮридическийАдрес)
			И НЕ ВыборкаАдрес = СокрЛП(ЭлементСправочника.ЮридическийАдрес) Тогда
			
			Адрес = Адрес + ", " + ЭлементСправочника.ЮридическийАдрес;
		КонецЕсли;
		
		Шапка.Параметры.РегионАдрес = Адрес;
		
		ПолныйНомерТелефона = ОбщийМодульСервер.СоставитьТелефон(ЭлементСправочника, ИСТИНА);
		
		Шапка.Параметры.Телефон = ПолныйНомерТелефона;
		
		Если НЕ ЗначениеЗаполнено(ЭлементСправочника.НаименованиеДляПечати) Тогда
			Шапка.Параметры.НаименованиеДляПечати = ЭлементСправочника.Наименование;
		КонецЕсли;                      		
		
		ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(Шапка);
		ТабДок.Вывести(Шапка);
		
		Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьДополнительныеРеквизитыСправочникаКлиентов") Тогда
			
			Для Счетчик = 1 по 10 Цикл
				
				НаименованиеРеквизита = ОбщийМодульПовтор.ПолучитьПредставлениеНаЯзыке(ПредопределенноеЗначение("Справочник.ДополнительныеРеквизиты.ДополнительныйРеквизитСправочникаКлиентов" + СокрЛП(Счетчик)));
				
				Если ЗначениеЗаполнено(НаименованиеРеквизита) Тогда
					ЗначениеРеквизита = Неопределено;
					Выполнить(" ЗначениеРеквизита = ЭлементСправочника.РеквизитКлиента" + СокрЛП(Счетчик) + ";");
					
					ОбластьПечатиДополнительныхРеквизитов.Параметры.ЗначениеРеквизита = ЗначениеРеквизита;
					ОбластьПечатиДополнительныхРеквизитов.Параметры.НаименованиеРеквизита = НаименованиеРеквизита;
					ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьПечатиДополнительныхРеквизитов);
					ТабДок.Вывести(ОбластьПечатиДополнительныхРеквизитов);		
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ Расчеты.Период КАК ДАТА,
		|	Расчеты.Регистратор,
		|	ВЫБОР КОГДА Расчеты.ВидДвижения = &Приход
		|			ТОГДА Расчеты.Сумма
		|		Иначе 0
		|	КОНЕЦ КАК Сумма,
		|	ВЫБОР КОГДА Расчеты.ВидДвижения = &Приход
		|			ТОГДА 0
		|		Иначе Расчеты.Сумма
		|	КОНЕЦ КАК Оплачено
		|ИЗ РегистрНакопления.Расчеты КАК Расчеты
		|ГДЕ Расчеты.Период <= &Период
		|	И Расчеты.Клиент = &Клиент
		|УПОРЯДОЧИТЬ ПО ДАТА";
		
		Запрос.УстановитьПараметр("Приход", ВидДвиженияНакопления.Приход);	
		Запрос.УстановитьПараметр("Клиент", ЭлементСправочника);
		Запрос.УстановитьПараметр("Период", ОбщийМодульСервисСервер.ПользователяТекущаяДата());
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			Шапка  = Макет.ПолучитьОбласть("ШД");
			Подвал = Макет.ПолучитьОбласть("П");
			Строка = Макет.ПолучитьОбласть("С");
			
			ОсновнаяВалюта = ПредопределенноеЗначение("Справочник.Валюты.ОсновнаяВалюта");
			Шапка.Параметры.ВалютаПрограммы = ОсновнаяВалюта.Наименование;
			
			Шапка.Параметры.текущийдолг = ОбщийМодульСервер.ПолучитьДолгКлиентаПоставщика(ЭлементСправочника, ОбщийМодульСервисСервер.ПользователяТекущаяДата());
			ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(Шапка);
			ТабДок.Вывести(Шапка, 0);
			
			Если  ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетОтдельныхДоговоровСКонтрагентами") Тогда
				Шапка  = Макет.ПолучитьОбласть("ШДК");
				Шапка.Параметры.ПросроченныйДолг = ОбщийМодульСервер.ПолучитьДолгКлиентаПоставщикаСОтсрочкой(ЭлементСправочника, ОбщийМодульСервисСервер.ПользователяТекущаяДата());
				Шапка.Параметры.ВалютаПрограммы  = ОсновнаяВалюта.Наименование;
				ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(Шапка);
				ТабДок.Вывести(Шапка, 0);
			КонецЕсли;
			
			ТаблицаРезультат = РезультатЗапроса.Выгрузить();
			
			ТаблицаРезультат.Свернуть("Регистратор, Дата", "Сумма, Оплачено");
			ТаблицаРезультат.Сортировать("Дата");
			ТаблицаРезультат.Колонки.Добавить("Остаток");
			ТаблицаРезультат.Колонки.Добавить("Количество");
			остаток = 0;
			
			Для Каждого строкарезультата из ТаблицаРезультат Цикл
				остаток = остаток + строкарезультата.сумма - строкарезультата.оплачено;
				строкарезультата.остаток = остаток;
				Если ТипЗнч(строкарезультата.регистратор) = Тип("ДокументСсылка.РасходыТовара") 
					ИЛИ ТипЗнч(строкарезультата.регистратор) = Тип("ДокументСсылка.ПоступленияТовара") Тогда
					
					строкарезультата.количество = строкарезультата.регистратор.товары.итог("количество");
				КонецЕсли;
				строка.Параметры.Заполнить(строкарезультата);
				ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(Строка);
				ТабДок.Вывести(строка, 1);
			КонецЦикла;
			
			Подвал.Параметры.Сумма = ТаблицаРезультат.Итог("Сумма");
			Подвал.Параметры.Количество = ТаблицаРезультат.Итог("Количество");
			Подвал.Параметры.Оплачено = ТаблицаРезультат.Итог("Оплачено");			
			Подвал.Параметры.ТекстВПодвалеДокументовПриПечати = СтруктураДополнительныПараметровМакета.ТекстВПодвалеДокументовПриПечати;
			ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(Подвал);
			ТабДок.Вывести(Подвал, 0);
			
		КонецЕсли;
		
		ТабДок.Закончитьавтогруппировкустрок();
		
		ТабДок.ОтображатьСетку = ЛОЖЬ;
		ТабДок.Защита = ИСТИНА;
		ТабДок.ТолькоПросмотр = ИСТИНА;
		ТабДок.ОтображатьЗаголовки = ЛОЖЬ;	
	КонецЕсли;
	
КонецПроцедуры
