// sza131003-2327 : 
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	#Если ВебКлиент Тогда
		Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Данный функционал работает в режиме тонкого и толстого клиента.");
		ПоказатьПредупреждение(Неопределено, Текст, 10);
	#Иначе
		Результат = МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента();
		Если Результат Тогда
			ОткрытьФорму("Обработка.ТестированиеПодключаемогоОборудования.Форма", , ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
		Иначе
			ОбщегоНазначения.СообщитьПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Предварительно необходимо выбрать рабочее место подключаемого оборудования текущего сеанса."));
		КонецЕсли;
	#КонецЕсли

КонецПроцедуры
