//sza140613-0146 Хозяин: 

Процедура НаПечать(ТабДок, Ссылка) Экспорт
	
	Макет = Документы.ОтчетКомиссионера.ПолучитьМакет("НаПечать");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ОтчетКомиссионера.ВидЦен,
	|	ОтчетКомиссионера.Дата,
	|	ОтчетКомиссионера.ДатаВозврата,
	|	ОтчетКомиссионера.ДатаРедакции,
	|	ОтчетКомиссионера.ДатаСоздания,
	|	ОтчетКомиссионера.Договор,
	|	ОтчетКомиссионера.Клиент,
	|	ОтчетКомиссионера.Комментарий,
	|	ОтчетКомиссионера.Номер,
	|	ОтчетКомиссионера.ОбщийПроцентКомиссионногоВознаграждения,
	|	ОтчетКомиссионера.Ответственный,
	|	ОтчетКомиссионера.Склад,
	|	ОтчетКомиссионера.Сотрудник,
	|	ОтчетКомиссионера.СпособДоставки,
	|	ОтчетКомиссионера.ТалонТрек,
	|	ОтчетКомиссионера.ТовараВКоличестве,
	|	ОтчетКомиссионера.ТовараНаСумму,
	|	ОтчетКомиссионера.Товары.(
	|		НомерСтроки,
	|		Номенклатура,
	|		СерияНоменклатуры,
	|		ЕдиницаИзмерения,
	|		Количество,
	|		Цена,
	|		Сумма,
	|		ЧастныйПроцентКомиссионногоВознаграждения,
	|		СуммаКомиссионногоВознаграждения,
	|		ОСтроке
	|	),
	|	ОтчетКомиссионера.ДеньгиЗаТовар.(
	|		НомерСтроки,
	|		ДатаОплаты,
	|		ХранилищеДенег,
	|		ФормаОплаты,
	|		Сумма,
	|		Валюта,
	|		Курс,
	|		ОСтроке
	|	),
	|	ОтчетКомиссионера.КомиссионноеВознаграждение.(
	|		НомерСтроки,
	|		ДатаОплаты,
	|		ХранилищеДенег,
	|		ФормаОплаты,
	|		Сумма,
	|		Валюта,
	|		Курс,
	|		ОСтроке
	|	),
	|	ОтчетКомиссионера.ВозвратНепроданногоТовара.(
	|		НомерСтроки,
	|		Номенклатура,
	|		СерияНоменклатуры,
	|		ЕдиницаИзмерения,
	|		Количество,
	|		Цена,
	|		Сумма,
	|		ОСтроке
	|	)
	|ИЗ
	|	Документ.ОтчетКомиссионера КАК ОтчетКомиссионера
	|ГДЕ
	|	ОтчетКомиссионера.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТоварыШапка = Макет.ПолучитьОбласть("ТоварыШапка");
	ОбластьТовары = Макет.ПолучитьОбласть("Товары");
	ОбластьДеньгиЗаТоварШапка = Макет.ПолучитьОбласть("ДеньгиЗаТоварШапка");
	ОбластьДеньгиЗаТовар = Макет.ПолучитьОбласть("ДеньгиЗаТовар");
	ОбластьКомиссионноеВознаграждениеШапка = Макет.ПолучитьОбласть("КомиссионноеВознаграждениеШапка");
	ОбластьКомиссионноеВознаграждение = Макет.ПолучитьОбласть("КомиссионноеВознаграждение");
	ОбластьВозвратНепроданногоТовараШапка = Макет.ПолучитьОбласть("ВозвратНепроданногоТовараШапка");
	ОбластьВозвратНепроданногоТовара = Макет.ПолучитьОбласть("ВозвратНепроданногоТовара");
	Подвал = Макет.ПолучитьОбласть("Подвал");
	
	ТабДок.Очистить();
	
	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ТабДок.Вывести(ОбластьЗаголовок);
		
		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());
		
		ВыборкаТовары = Выборка.Товары.Выбрать();
		Если НЕ ВыборкаТовары.Количество() = 0 Тогда
			ТабДок.Вывести(ОбластьТоварыШапка);
			Пока ВыборкаТовары.Следующий() Цикл
				ОбластьТовары.Параметры.Заполнить(ВыборкаТовары);
				ТабДок.Вывести(ОбластьТовары, ВыборкаТовары.Уровень());
			КонецЦикла;                          	
		КонецЕсли;
		
		ВыборкаДеньгиЗаТовар = Выборка.ДеньгиЗаТовар.Выбрать();
		Если НЕ ВыборкаДеньгиЗаТовар.Количество() = 0 Тогда
			ТабДок.Вывести(ОбластьДеньгиЗаТоварШапка);
			Пока ВыборкаДеньгиЗаТовар.Следующий() Цикл
				ОбластьДеньгиЗаТовар.Параметры.Заполнить(ВыборкаДеньгиЗаТовар);
				ТабДок.Вывести(ОбластьДеньгиЗаТовар, ВыборкаДеньгиЗаТовар.Уровень());
			КонецЦикла;                          	
		КонецЕсли;
		
		ВыборкаКомиссионноеВознаграждение = Выборка.КомиссионноеВознаграждение.Выбрать();
		Если НЕ ВыборкаКомиссионноеВознаграждение.Количество() = 0 Тогда
			ТабДок.Вывести(ОбластьКомиссионноеВознаграждениеШапка);
			Пока ВыборкаКомиссионноеВознаграждение.Следующий() Цикл
				ОбластьКомиссионноеВознаграждение.Параметры.Заполнить(ВыборкаКомиссионноеВознаграждение);
				ТабДок.Вывести(ОбластьКомиссионноеВознаграждение, ВыборкаКомиссионноеВознаграждение.Уровень());
			КонецЦикла;	
		КонецЕсли;
		
		ВыборкаВозвратНепроданногоТовара = Выборка.ВозвратНепроданногоТовара.Выбрать();
		Если НЕ ВыборкаВозвратНепроданногоТовара.Количество() = 0 Тогда
			ОбластьВозвратНепроданногоТовара.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(ОбластьВозвратНепроданногоТовараШапка);
			Пока ВыборкаВозвратНепроданногоТовара.Следующий() Цикл
				ОбластьВозвратНепроданногоТовара.Параметры.Заполнить(ВыборкаВозвратНепроданногоТовара);
				ТабДок.Вывести(ОбластьВозвратНепроданногоТовара, ВыборкаВозвратНепроданногоТовара.Уровень());
			КонецЦикла;                                         	
		КонецЕсли;
		
		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);
		
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	
КонецПроцедуры
