// sza151011-0229 функция
// sza150716-1730
// sza150623-1743 глОграниченКонтрагент
// sza150602-2307 окно запуска
// sza150515-0232 программы
// sza150429-1802
// sza140117-2231 :
// sza130901-0137 :

Перем глВэбКамера Экспорт;
Перем глЧислоОбъектов Экспорт;
Перем глВерсияПлатформы Экспорт;
Перем глМассоваяЗагрузка Экспорт;
Перем глФормаЗаданаСтрого Экспорт;
Перем глПроверятьСообщения Экспорт;
Перем глКонфигурацияВРаботе Экспорт;
Перем глОграниченКонтрагент Экспорт;
Перем глТекущийПользователь Экспорт;
Перем глВремяПоследнегоСобытия Экспорт;
Перем глЕдинственнаяФормаЗакрыта Экспорт;
Перем глПодключаемоеОборудование Экспорт;
Перем глВремяНачалаРаботыПользователя Экспорт;
Перем глПараметрыСообщенийПользователя Экспорт;
Перем глМассивФормСПользовательскимПереводом Экспорт;

Процедура ВыполнениеРегламентныхЗаданий() Экспорт
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьМеханизмЗаметокИНапоминаний") Тогда
		МассивНапоминаний 	 = Новый Массив;
		СтруктураНапоминаний = ОбщийМодульСерверПривилегия.ПроверитьНаличиеПропущенныхНапоминаний(ИСТИНА);
		Если СтруктураНапоминаний.Есть Тогда
			Сч = 0;
			НаименованиеФЗ = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Задача на фоне") + " ";
			
			Для Каждого Напоминание Из СтруктураНапоминаний.МассивНапоминаний Цикл
				Состояние(НаименованиеФЗ + СтруктураНапоминаний.МассивНаименований[сч]);
				Напоминание = ОбщийМодульСерверПривилегия.ЗаписатьВыполнениеНапоминания(Напоминание);
				ОбщийМодульСерверПривилегия.ВыполнитьЗадачку(Напоминание);
				
				Сч = Сч + 1;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаВнешнегоСобытия(Источник, Событие, Данные)
	
	ОписаниеСобытия = Новый Структура();
	ОписаниеОшибки  = "";
	ОписаниеСобытия.Вставить("Источник", Источник);
	ОписаниеСобытия.Вставить("Событие",  Событие);
	ОписаниеСобытия.Вставить("Данные",   Данные);
	Результат = МенеджерОборудованияКлиент.ОбработатьСобытиеОтУстройства(ОписаниеСобытия, ОписаниеОшибки);
	
	Если НЕ Результат Тогда
		ОбщегоНазначения.СообщитьПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("При обработке внешнего события от устройства произошла ошибка.") + Символы.ПС + ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОЗавершенииРаботыЕдинственнойФормы() Экспорт
	
	Если глЕдинственнаяФормаЗакрыта Тогда
		ОтключитьОбработчикОжидания("ОЗавершенииРаботыЕдинственнойФормы");
		ЗавершитьРаботуСистемы(ЛОЖЬ, ЛОЖЬ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗавершениемРаботыСистемы(Отказ)
	
	СледуетВыполнитьОперацииПередЗавершением = ОбщийМодульСервисСервер.СледуетВыполнитьОперацииПередЗавершением();
	Если НЕ СледуетВыполнитьОперацииПередЗавершением.количество() = 0 Тогда
		Количество = СледуетВыполнитьОперацииПередЗавершением.Количество();
		Процент = ?(Количество = 0, 100, 100 /Количество);
		ТекущийПроцент = Процент;
		
		Для Каждого ОперацияПередЗавершением Из СледуетВыполнитьОперацииПередЗавершением Цикл
			
			Если ОперацияПередЗавершением = "Восстановление Валовой Прибыли" // НЕ МЕНЯТЬ!
				И Вопрос(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Необходимо восстановить показатели валовой прибыли за счет перепроведения документов по очереди.") +
				
				Символы.ПС + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Восстановить сейчас?"), РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
				
				Состояние(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Операция") + ": " + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке(ОперацияПередЗавершением), Процент, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ждите.."), БиблиотекаКартинок.АнимацияСерая);
				ОбщийМодульСервисСервер.ПередЗавершениемРаботыСистемы(ОперацияПередЗавершением);
			КонецЕсли;
			
			ТекущийПроцент = ТекущийПроцент + Процент;			
		КонецЦикла;
	КонецЕсли;
	
	Если НЕ ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("НеСпрашиватьПодтверждениеПриВыходеИзПрограммы") Тогда
		КомандыВопроса = Новый Массив(3, 4);
		КомандыВопроса[0][0] = "НЕТ";
		КомандыВопроса[0][1] = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Нет");
		КомандыВопроса[0][2] = "Результат = ЛОЖЬ;";
		КомандыВопроса[0][3] = 2;
		КомандыВопроса[1][0] = "ДА";
		КомандыВопроса[1][1] = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Закрыть");
		КомандыВопроса[1][2] = "Результат = ИСТИНА;";
		КомандыВопроса[1][3] = 2;
		КомандыВопроса[2][0] = "БС";
		КомандыВопроса[2][1] = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Закрыть и больше не спрашивать");
		КомандыВопроса[2][2] = "ОбщийМодульСервисСервер.УстановитьЗначениеПараметраИлиКонстанты(""НеСпрашиватьПодтверждениеПриВыходеИзПрограммы"", ИСТИНА); Результат = ИСТИНА;";
		КомандыВопроса[2][3] = 2;
		ПараметрыФормы = Новый Структура("СтруктураКнопокИПоведения", КомандыВопроса);
		ПараметрыФормы.Вставить("ЗаголовокФормы", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Закрыть программу?"));
		ПараметрыФормы.Вставить("ТекстВопроса", "");
		ПараметрыФормы.Вставить("ЭтоВопрос", ИСТИНА);
		ФормаВопроса = ПолучитьФорму("ОбщаяФорма.ФормаВопроса", ПараметрыФормы);
		ОтветПользователя = ФормаВопроса.ОткрытьМодально();
		
		Если НЕ ОтветПользователя = Неопределено Тогда
			Отказ = НЕ ОтветПользователя;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		ОбщийМодульСервисСервер.УстановитьЗначениеКонстанты("ЧислоОбъектов", глЧислоОбъектов, ИСТИНА);
		ПрограммыКВыполнению = ОбщийМодульСерверПривилегия.ОпределитьПрограммыПользователя(глТекущийПользователь, ЛОЖЬ);
		Если НЕ ПустаяСтрока(ПрограммыКВыполнению.Клиент) Тогда
			Попытка
				Выполнить(" " + ПрограммыКВыполнению.Клиент + " ");
			Исключение
				ТекстОписаниеОшибки = ОписаниеОшибки();
				ОбщегоНазначения.СообщитьПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Произошла ошибка исполнения программы пользователя") + " " + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("при завершении работы системы") + " " + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("на клиенте") + ": " + ТекстОписаниеОшибки);
			КонецПопытки;
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(ПрограммыКВыполнению.Сервер) Тогда
			Попытка
				ОбщийМодульСерверПривилегия.ВыполнитьКод(ПрограммыКВыполнению.Сервер, ИСТИНА);
			Исключение
				ТекстОписаниеОшибки = ОписаниеОшибки();
				ОбщегоНазначения.СообщитьПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Произошла ошибка исполнения программы пользователя") + " " + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("при завершении работы системы") + " " + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("на сервере") + ": " + ТекстОписаниеОшибки);
			КонецПопытки;
		КонецЕсли;
		
		// ПодключаемоеОборудование
		МенеджерОборудованияКлиент.ПередЗавершениемРаботыСистемы();
		// Конец ПодключаемоеОборудование
		
		глВремяПоследнегоСобытия = ТекущаяДата();
		Если (глВремяПоследнегоСобытия - глВремяНачалаРаботыПользователя) > 2 Тогда 
			ОбщийМодульСервисСервер.ЗавершитьПериодРаботыПользователя(4, глВремяНачалаРаботыПользователя, глВремяПоследнегоСобытия);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередНачаломРаботыСистемы(Отказ)
	
	Если ОбщийМодульСерверПривилегия.ОпределитьКонтрагентаПредприятия() Тогда
		глОграниченКонтрагент = ОткрытьФормуМодально("ОбщаяФорма.ИдентификацияКонтрагента");
		Если НЕ ЗначениеЗаполнено(глОграниченКонтрагент) Тогда
			Отказ = ИСТИНА;
			ЗавершитьРаботуСистемы(ЛОЖЬ, ЛОЖЬ);
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		ПродолжениеПередНачаломРаботыСистемы();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриНачалеРаботыСистемы()
	
	Если глФормаЗаданаСтрого Тогда
		//ЭтаФорма = АктивноеОкно().Содержимое[0];
		//ЭтаФорма.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьПодключениеОбработчикаОжидания() Экспорт
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьМеханизмЗаметокИНапоминаний") Тогда
		ПодключитьОбработчикОжидания("ВыполнениеРегламентныхЗаданий", 240);
	Иначе
		ОтключитьОбработчикОжидания("ВыполнениеРегламентныхЗаданий");
	КонецЕсли;
	
	глПараметрыСообщенийПользователя = Новый Структура("Пользователь", ОбщийМодульПовтор.ПолучитьПараметрСеанса("ТекущийПользователь"));
	ПодключитьОбработчикОжидания("СообщенияПользователюОтСистемы", 3);
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетРабочегоВремениСотрудников")
		И ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВыводитьЗапросОТомЧтоСотрудникПользовательНаРабочемМесте") Тогда
		
		ПодключитьОбработчикОжидания("ВопросПользовательНаРабочемМесте", 60);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПродолжениеПередНачаломРаботыСистемы()
	
	глТекущийПользователь = ОбщийМодульСерверПривилегия.ОпределитьПользователя();
	глКонфигурацияВРаботе = ИСТИНА;
	ОбщийМодульКлиент.ПриНачалеРаботыПользователяСБазойДанных();
	МенеджерОборудованияКлиент.ПриНачалеРаботыПользователяСБазойДанных();
	ПрограммыКВыполнению = ОбщийМодульСерверПривилегия.ОпределитьПрограммыПользователя(глТекущийПользователь, ИСТИНА);
	
	Если НЕ ПустаяСтрока(ПрограммыКВыполнению.Клиент) Тогда
		Попытка
			Выполнить(" " + ПрограммыКВыполнению.Клиент + " ");
		Исключение
			ТекстОписаниеОшибки = ОписаниеОшибки();
			ОбщегоНазначения.СообщитьПользователю("ERROR with running script at start on Client side: " + ТекстОписаниеОшибки);
		КонецПопытки;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ПрограммыКВыполнению.Сервер) Тогда
		Попытка
			ОбщийМодульСерверПривилегия.ВыполнитьКод(ПрограммыКВыполнению.Сервер, ИСТИНА);
		Исключение
			ТекстОписаниеОшибки = ОписаниеОшибки();
			ОбщегоНазначения.СообщитьПользователю("ERROR with running script at start on Server side: " + ТекстОписаниеОшибки);
		КонецПопытки;
	КонецЕсли;
	
	ПроверитьПодключениеОбработчикаОжидания();
	ДобавитьНапоминанияПриСтартеСистемы();
	глЧислоОбъектов = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ЧислоОбъектов", ИСТИНА);
	ПриЗапуске = ОбщийМодульСерверПривилегия.ОпределитьОкноПриЗапускеПользователя(глТекущийПользователь);
	
	Если НЕ ПустаяСтрока(ПриЗапуске.Форма) Тогда
		ФормаМодально = ПриЗапуске.Модально;
		глФормаЗаданаСтрого = ПриЗапуске.НеПозволятьЗакрыть;
		Если ФормаМодально Тогда
			Если ПриЗапуске.Форма = "ДополнительнаяОбработка" Тогда
				ОбщийМодульКлиент.ОткрытьФункциюОператора(ПриЗапуске.ДополнительнаяОбработка, ИСТИНА);
			Иначе
				ОткрытьФормуМодально(ПриЗапуске.Форма);
			КонецЕсли;
			
			Если глФормаЗаданаСтрого Тогда
				Отказ = ИСТИНА;
				ЗавершитьРаботуСистемы(ЛОЖЬ, ЛОЖЬ);
			КонецЕсли;
		Иначе
			Если ПриЗапуске.Форма = "ДополнительнаяОбработка" Тогда
				
				ОбщийМодульКлиент.ОткрытьФункциюОператора(ПриЗапуске.ДополнительнаяОбработка, ЛОЖЬ);
			Иначе
				ОткрытьФорму(ПриЗапуске.Форма);
			КонецЕсли;
			
			Если глФормаЗаданаСтрого Тогда
				ПодключитьОбработчикОжидания("ОЗавершенииРаботыЕдинственнойФормы", 10);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура СообщенияПользователюОтСистемы() Экспорт
	
	Если глПроверятьСообщения
		ИЛИ (ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьСистемуВнутреннихСообщенийПользователей")
		И ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ПользователямДоставлятьСообщенияНемедленно")) Тогда
		
		ОбщийМодульКлиент.ПроверитьВывестиСообщенияПользователю(глПараметрыСообщенийПользователя);
		глПроверятьСообщения = ЛОЖЬ;
	КонецЕсли;
	
КонецПроцедуры

Процедура ВопросПользовательНаРабочемМесте() Экспорт
	
	ТекущаяДатаСейчас = ТекущаяДата();
	Если НЕ глВремяПоследнегоСобытия = '00010101000000'  Тогда
		
		ПериодМолчания = ТекущаяДатаСейчас - глВремяПоследнегоСобытия;
		ЧислоСекунд    = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ЧислоМинутПослеПоследнейОперацииКоторыеСчитаютсяРабочими") * 60;
		
		Если ПериодМолчания >= (ЧислоСекунд - 40) Тогда
			
			КомандыВопроса = Новый Массив(1, 4);
			КомандыВопроса[0][0] = "ДА";
			КомандыВопроса[0][1] = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Да, я работаю!");
			КомандыВопроса[0][2] = "Результат = ИСТИНА;";
			КомандыВопроса[0][3] = 2;
			ПараметрыФормы = Новый Структура("СтруктураКнопокИПоведения", КомандыВопроса);
			ПараметрыФормы.Вставить("ЗаголовокФормы", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Вы на рабочем месте?"));
			ПараметрыФормы.Вставить("ТекстВопроса", "");
			ПараметрыФормы.Вставить("ЭтоВопрос", ИСТИНА);
			ПараметрыФормы.Вставить("ВремяВопроса", 30);
			ПараметрыФормы.Вставить("ЭтоАвтомат", ИСТИНА);
			
			ФормаВопроса = ПолучитьФорму("ОбщаяФорма.ФормаВопроса", ПараметрыФормы);
			ОтветПользователя = ФормаВопроса.ОткрытьМодально();
			
			Если ОтветПользователя = "99" Тогда
				ОбщийМодульСервисСервер.ЗавершитьПериодРаботыПользователя(5, глВремяНачалаРаботыПользователя, глВремяПоследнегоСобытия + ЧислоСекунд);
				глВремяПоследнегоСобытия = '00010101000000';
			Иначе
				глВремяПоследнегоСобытия = ТекущаяДата();
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

глЧислоОбъектов 	  = 0;
глПроверятьСообщения  = ЛОЖЬ;
глФормаЗаданаСтрого   = ЛОЖЬ;
глМассоваяЗагрузка    = ЛОЖЬ;
глВерсияПлатформы 	  = 803050001;
глЕдинственнаяФормаЗакрыта = ЛОЖЬ;
глОграниченКонтрагент = Неопределено;
глВремяПоследнегоСобытия = '00010101000000';
глМассивФормСПользовательскимПереводом = Новый Соответствие;
глВремяНачалаРаботыПользователя = '00010101000000';
