//sza150111-1956
//sza140117-0131 : 
//sza131003-1850 : 
Перем глЧислоОбъектов Экспорт;
Перем глПодключаемоеОборудование Экспорт;
Перем глКонфигурацияВРаботе Экспорт;
Перем глОтборСтруктура Экспорт;
Перем глПроверятьСообщения Экспорт;
Перем глТекущийПользователь Экспорт;
Перем глВерсияПлатформы Экспорт;

Процедура ВыполнениеРегламентныхЗаданий() Экспорт
	ОбщийМодульСерверПривилегия.ВыполнитьЗадачи();
КонецПроцедуры

Процедура ОбработкаВнешнегоСобытия(Источник, Событие, Данные)
	
	// Подготовить данные
	ОписаниеСобытия = Новый Структура();
	ОписаниеОшибки  = "";
	
	ОписаниеСобытия.Вставить("Источник", Источник);
	ОписаниеСобытия.Вставить("Событие",  Событие);
	ОписаниеСобытия.Вставить("Данные",   Данные);
	
	// Передать на обработку данные
	Результат = МенеджерОборудованияКлиент.ОбработатьСобытиеОтУстройства(ОписаниеСобытия, ОписаниеОшибки);
	Если НЕ Результат Тогда
		ОбщегоНазначения.СообщитьПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("При обработке внешнего события от устройства произошла ошибка.")
		+ Символы.ПС + ОписаниеОшибки);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗавершениемРаботыСистемы(Отказ)
	
	СледуетВыполнитьОперацииПередЗавершением = ОбщийМодульСервисСервер.СледуетВыполнитьОперацииПередЗавершением();
	Если НЕ СледуетВыполнитьОперацииПередЗавершением.количество() = 0 Тогда
		
		Количество = СледуетВыполнитьОперацииПередЗавершением.Количество();
		Для Каждого ОперацияПередЗавершением Из СледуетВыполнитьОперацииПередЗавершением Цикл
			
			Если ОперацияПередЗавершением = "Восстановление Валовой Прибыли" 
				И Вопрос(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Необходимо восстановить показатели валовой прибыли. Восстановить сейчас?"), РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
				Состояние(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Операция") + ": " + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке(ОперацияПередЗавершением));
				ОбщийМодульСервисСервер.ПередЗавершениемРаботыСистемы(ОперацияПередЗавершением);		
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.ПередЗавершениемРаботыСистемы();
	// Конец ПодключаемоеОборудование
	
	ОбщийМодульСервисСервер.УстановитьЗначениеКонстанты("ЧислоОбъектов", глЧислоОбъектов);
	
КонецПроцедуры

Процедура ПриНачалеРаботыСистемы()
	
	глТекущийПользователь = ОбщийМодульСерверПривилегия.ОпределитьПользователя();
	
	глКонфигурацияВРаботе = ИСТИНА;
	глЧислоОбъектов = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ЧислоОбъектов");
	ОбщийМодульКлиент.ПриНачалеРаботыСистемы();
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.ПриНачалеРаботыСистемы();
	// Конец ПодключаемоеОборудование
	
	ПроверитьПодключениеОбработчикаОжидания();
	ДобавитьНапоминанияПриСтартеСистемы();
	
КонецПроцедуры

Процедура ПроверитьПодключениеОбработчикаОжидания() Экспорт
	
	Если Константы.ИспользоватьМеханизмЗаметокИНапоминаний.Получить() Тогда
		ПодключитьОбработчикОжидания("ВыполнениеРегламентныхЗаданий", 60);
	Иначе
		ОтключитьОбработчикОжидания("ВыполнениеРегламентныхЗаданий");
	КонецЕсли; 	
	
КонецПроцедуры

глПроверятьСообщения = ЛОЖЬ;
глВерсияПлатформы = 803050001;
