// sza151218-0129 
&НаКлиенте
Процедура ДополнительныйРеквизитСправочникаКлиентов1ПриИзменении(Элемент)
	ПерерисоватьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура НаименованияДополнительныхРеквизитовСправочникаКлиентовНаДругихЯзыках(Команда)
	
	ПараметрыФормы = Новый Структура("ДляДопРеквизитовКлиентов", ИСТИНА);
	ФормаСпискаЗаписейРегистра = ПолучитьФорму("РегистрСведений.ЗначенияНаДругихЯзыках.ФормаСписка", ПараметрыФормы);
	ФормаСпискаЗаписейРегистра.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура РаспространитьОбновленияЗначенийДополнительныхРеквизитовНаСуществующихКлиентов(Команда)
	РаспространитьОбновленияЗначенийДополнительныхРеквизитовНаСуществующихКлиентовНаСервере();
КонецПроцедуры

&НаСервере
Процедура РаспространитьОбновленияЗначенийДополнительныхРеквизитовНаСуществующихКлиентовНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Клиенты.Ссылка
	|ИЗ Справочник.Клиенты КАК Клиенты
	|ГДЕ Клиенты.ЭтоГруппа = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Счетчик = 1;
		Былизм = ЛОЖЬ;
		КлиентОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		
		НаименованияДополнительныхРеквизитов = ОбщийМодульПовтор.ПолучитьДополнительныеРеквизитыКлиентов();
		Если НЕ НаименованияДополнительныхРеквизитов = Неопределено Тогда
			
			Для Каждого ДопРеквизит Из НаименованияДополнительныхРеквизитов Цикл
				
				Если Счетчик <= 15 Тогда
					
					ДополнительныйРеквизит = ДопРеквизит.ДополнительныйРеквизит;
					НаименованиеДопРеквизита = ОбщийМодульПовтор.получитьПредставлениеНаЯзыке(ДополнительныйРеквизит);
					
					ТипЗначенияРеквизит = ТипЗнч(ВыборкаДетальныеЗаписи.Ссылка["РеквизитКлиента" + СокрЛП(Счетчик)]);
					
					Если НЕ ТипЗначенияРеквизит = типзнч(ДополнительныйРеквизит.ЗначениеПоУмолчанию)  Тогда						
						Выполнить(" КлиентОбъект.РеквизитКлиента" + СокрЛП(Счетчик) + " = ДополнительныйРеквизит.ЗначениеПоУмолчанию;");
						Былизм = ИСТИНА;
					КонецЕсли;	
				КонецЕсли;
				
				Счетчик = Счетчик + 1;
			КонецЦикла;	
		КонецЕсли;
		
		Пока Счетчик <= 15 Цикл
			
			Если НЕ ВыборкаДетальныеЗаписи.Ссылка["РеквизитКлиента" + СокрЛП(Счетчик)] = Неопределено Тогда
				Выполнить(" КлиентОбъект.РеквизитКлиента" + СокрЛП(Счетчик) + " = Неопределено;");
				Былизм = ИСТИНА;
			КонецЕсли;
			
			Счетчик = Счетчик + 1;
		КонецЦикла;
		
		Если Былизм Тогда
			КлиентОбъект.записать();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаименованияИменованныхОбъектов()
	
	Для Счетчик = 1 по 15 Цикл
		Выполнить(" ДополнительныйРеквизитСправочникаКлиентов" + СокрЛП(Счетчик) + " = Справочники.ДополнительныеРеквизиты.ДополнительныйРеквизитСправочникаКлиентов" + СокрЛП(Счетчик) + ";");
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("000950", ЭтаФорма, Отказ, Объект);
	
	Если НЕ Отказ Тогда
		Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьСобственныйПереводЭлементовИнтерфейса") Тогда
			ОбщийМодульСервер.ПеревестиРеквизитыФормы(ЭтаФорма);	
		КонецЕсли;
		
		ЗагрузитьНаименованияИменованныхОбъектов();	
		
		ПерерисоватьВидимость();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

Процедура ПерерисоватьВидимость()
	
	Для Счетчик = 2 По 15 Цикл
		
		Счетчик1 = Счетчик - 1;
		
		ВидимостьЭлемента = ЛОЖЬ;
		Выполнить(" ВидимостьЭлемента = НЕ ПустаяСтрока(ДополнительныйРеквизитСправочникаКлиентов" + Счетчик1 + ".Наименование); ");
		Выполнить(" Элементы.ДополнительныйРеквизитСправочникаКлиентов" + Счетчик + ".Видимость = ВидимостьЭлемента; ");
		Выполнить(" Элементы.ДополнительныйРеквизитСправочникаКлиентов" + Счетчик + "ТипДополнительногоРеквизита.Видимость = ВидимостьЭлемента; ");
		Выполнить(" Элементы.ДополнительныйРеквизитСправочникаКлиентов" + Счетчик + "ЗначениеПоУмолчанию.Видимость = ВидимостьЭлемента; ");
		
	КонецЦикла;
	
	Элементы.ДобавитьРеквизит.Видимость = НЕ Элементы.ДополнительныйРеквизитСправочникаКлиентов15.Видимость;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьРеквизит(Команда)
	ПерерисоватьВидимость();
КонецПроцедуры
