// Суров С.В <s_surov@mail.ru>

// Дополнительная настройка доступности элементов формы узла обмен
// 
// Параметры:
//  ФормаУзла  - УправляемаяФорма - форма узла, для которой настраивается доступность.
//  ОбъектУзла  - ПланОбменаОбъект.ОбменССайтом - план обмен, для формы узла которого настраивается доступность
// 
Процедура УстановитьДоступностьЭлементовФормыУзла(ФормаУзла, ОбъектУзла) Экспорт
	
	// ФормаУзла.Элементы.ГруппаДоступаПартнеров.Доступность = ФормаУзла.ИспользуютсяГруппыДоступаПартнеров 
	//                                                        И (ФормаУзла.ИспользоватьПартнеровКакКонтрагентов
	//                                                          ИЛИ ФормаУзла.СоздаватьПартнеровДляНовыхКонтрагентов);
	ФормаУзла.Элементы.ГруппаДоступаПартнеров.Доступность = ЛОЖЬ;
															  
	
КонецПроцедуры
