//sza140104-0216 : 
//sza131010-1842  
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если ОбщийМодульПовтор.ВывестиНаименованияНаДругомЯзыке() Тогда
		
		ВозможноеПредставление = ОбщийМодульПовтор.получитьПредставлениеНаЯзыке(Данные.ссылка, , ИСТИНА);
		Если НЕ ВозможноеПредставление = Неопределено Тогда
			Представление = ВозможноеПредставление;
			СтандартнаяОбработка = ЛОЖЬ;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура Печать(ТабДок, Ссылка) Экспорт
	
	Макет = Справочники.Сотрудники.ПолучитьМакет("Печать");
	Макет.КодЯзыкаМакета = ОбщийМодульПовтор.ПолучитьТекущийЯзыкДокументов();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Сотрудники.Адрес,
	               |	Сотрудники.ДанныеПаспорта,
	               |	Сотрудники.ДатаРождения,
	               |	Сотрудники.Комментарий,
	               |	Сотрудники.Наименование,
	               |	Сотрудники.Телефон,
	               |	Сотрудники.ЭлектроннаяПочта,
	               |	Сотрудники.РасчетЗарплаты.(
	               |		НомерСтроки,
	               |		ВидНачисления,
	               |		ДатаНачала,
	               |		ДатаОкончания,
	               |		Размер,
	               |		Валюта,
	               |		Количество
	               |	),
	               |	Сотрудники.Должность,
	               |	Сотрудники.Телефон2,
	               |	Сотрудники.Телефон3,
	               |	Сотрудники.Телефон4,
	               |	Сотрудники.ОКПО,
	               |	Сотрудники.ИНН,
	               |	Сотрудники.Телефон5
	               |ИЗ Справочник.Сотрудники КАК Сотрудники
	               |ГДЕ Сотрудники.Ссылка В(&Ссылка)";
	
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ЭлементСправочника = Ссылка;

	ОбластьЗаголовок 			= Макет.ПолучитьОбласть("Заголовок");
	Шапка 						= Макет.ПолучитьОбласть("Шапка");
	ОбластьРасчетЗарплатыШапка 	= Макет.ПолучитьОбласть("РасчетЗарплатыШапка");
	ОбластьРасчетЗарплаты 		= Макет.ПолучитьОбласть("РасчетЗарплаты");
	Подвал 						= Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = ЛОЖЬ;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ТабДок.Вывести(ОбластьЗаголовок);
		
		Шапка.Параметры.Заполнить(Выборка);
		ПолныйНомерТелефона = ОбщийМодульСервер.СоставитьТелефон(ЭлементСправочника, ИСТИНА);
		
		ОКПОТекст = "";
		ОКПОЗначение = "";
		Если НЕ ПустаяСтрока(ЭлементСправочника.ОКПО) Тогда
			ОКПОТекст 	 = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("ОКПО");
			ОКПОЗначение = ЭлементСправочника.ОКПО;
		КонецЕсли;
		Если НЕ ПустаяСтрока(ЭлементСправочника.ИНН) Тогда
			ОКПОТекст 	 = ?(ОКПОТекст = "", "", ", ") + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("ИНН");
			ОКПОЗначение = ?(ОКПОЗначение = "", "", ", ") + ЭлементСправочника.ИНН;
		КонецЕсли;
		Шапка.Параметры.ОКПОТекст = ОКПОТекст;
		Шапка.Параметры.ОКПОЗначение = ОКПОЗначение;
		
		Шапка.Параметры.Телефон = ПолныйНомерТелефона;
		
		ТабДок.Вывести(Шапка, Выборка.Уровень());
		
		ТабДок.Вывести(ОбластьРасчетЗарплатыШапка);
		ВыборкаРасчетЗарплаты = Выборка.РасчетЗарплаты.Выбрать();
		Пока ВыборкаРасчетЗарплаты.Следующий() Цикл
			ОбластьРасчетЗарплаты.Параметры.Заполнить(ВыборкаРасчетЗарплаты);
			ТабДок.Вывести(ОбластьРасчетЗарплаты, ВыборкаРасчетЗарплаты.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = ИСТИНА;
	КонецЦикла;
	
КонецПроцедуры
