//sza140104-0216 : 
//sza131010-1842  

Процедура Печать(ТабДок, Ссылка) Экспорт
	
	Макет = Справочники.Сотрудники.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Сотрудники.Адрес,
	|	Сотрудники.ДанныеПаспорта,
	|	Сотрудники.ДатаРождения,
	|	Сотрудники.Комментарий,
	|	Сотрудники.Наименование,
	|	Сотрудники.Телефон,
	|	Сотрудники.ЭлектроннаяПочта,
	|	Сотрудники.РасчетЗарплаты.(
	|		НомерСтроки,
	|		ВидНачисления,
	|		ДатаНачала,
	|		ДатаОкончания,
	|		Размер,
	|		Валюта,
	|		Количество
	|	),
	|	Сотрудники.Должность
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|ГДЕ
	|	Сотрудники.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьРасчетЗарплатыШапка = Макет.ПолучитьОбласть("РасчетЗарплатыШапка");
	ОбластьРасчетЗарплаты = Макет.ПолучитьОбласть("РасчетЗарплаты");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьРасчетЗарплатыШапка);
		ВыборкаРасчетЗарплаты = Выборка.РасчетЗарплаты.Выбрать();
		Пока ВыборкаРасчетЗарплаты.Следующий() Цикл
			ОбластьРасчетЗарплаты.Параметры.Заполнить(ВыборкаРасчетЗарплаты);
			ТабДок.Вывести(ОбластьРасчетЗарплаты, ВыборкаРасчетЗарплаты.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если НЕ ОбщийМодульПовтор.ТекущийЯзыкРусский()
		и ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ПоддерживатьНаименованияНаДругихЯзыкахКромеРусского", Истина) Тогда
		
		ВозможноеПредставление = ОбщийМодульПовтор.получитьПредставлениеНаЯзыке(Данные.ссылка, , Истина);
		Если НЕ ВозможноеПредставление = Неопределено Тогда
			Представление = ВозможноеПредставление;
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
