// sza140928-1546 
// sza140411-1702 : 
// sza131018-1445
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Склады") Тогда
		Комментарий = ДанныеЗаполнения.Комментарий;
		Наименование = ДанныеЗаполнения.Наименование;
		ХранилищеДенег = ДанныеЗаполнения.ХранилищеДенег;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ХранилищаДенег") Тогда
		Комментарий = ДанныеЗаполнения.Комментарий;
		Наименование = ДанныеЗаполнения.Наименование;
		ХранилищеДенег = ДанныеЗаполнения.Ссылка;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Пользователи") Тогда
		Комментарий = ДанныеЗаполнения.Комментарий;
		Наименование = ДанныеЗаполнения.Наименование;
		Фамилия = ДанныеЗаполнения.Наименование;
		Подпись = ДанныеЗаполнения.Подпись;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если НЕ Отказ 
		И НЕ ПометкаУдаления Тогда
		
		Отказ = ОбщийМодульСервер.ПроверитьУникальностьОКПО(Отказ, "Сотрудники", ОКПО, Ссылка);
		
		Отказ = ОбщийМодульСервер.ПроверитьУникальностьНомераТелефона(Отказ, "Сотрудники", Телефон, Ссылка);
		Если НЕ ПустаяСтрока(Телефон2) Тогда
			Отказ = ОбщийМодульСервер.ПроверитьУникальностьНомераТелефона(Отказ, "Сотрудники", Телефон2, Ссылка);
		КонецЕсли;			
		Если НЕ ПустаяСтрока(Телефон3) Тогда
			Отказ = ОбщийМодульСервер.ПроверитьУникальностьНомераТелефона(Отказ, "Сотрудники", Телефон3, Ссылка);
		КонецЕсли;			
		Если НЕ ПустаяСтрока(Телефон4) Тогда
			Отказ = ОбщийМодульСервер.ПроверитьУникальностьНомераТелефона(Отказ, "Сотрудники", Телефон4, Ссылка);
		КонецЕсли;			
		Если НЕ ПустаяСтрока(Телефон5) Тогда
			Отказ = ОбщийМодульСервер.ПроверитьУникальностьНомераТелефона(Отказ, "Сотрудники", Телефон5, Ссылка);
		КонецЕсли;			
		
		Если НЕ отказ  
			И ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьШтрихКоды")
			И НЕ ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("НеПроверятьУникальностьШтрихКода")
			И НЕ ПустаяСтрока(ОсновнойШтрихКод) тогда
			
			РезультатОбработки = ОбщийМодульТоварСервер.ПолучитьНоменклатуруПоШтрихКоду(ОсновнойШтрихКод);
			
			Если ЗначениеЗаполнено(РезультатОбработки) Тогда
				ОбщегоНазначения.СообщитьПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ошибка! Такой штрих-код найден") + " (" + ОсновнойШтрихКод + "): " + РезультатОбработки.Номенклатура);
				Отказ = ИСТИНА;
				
			Иначе
				РезультатОбработки = ОбщийМодульСервер.ПолучитьСотрудникаПоШтрихКоду(ОсновнойШтрихКод);
				Если ЗначениеЗаполнено(РезультатОбработки)
					И НЕ РезультатОбработки = Ссылка Тогда
					
					ОбщегоНазначения.СообщитьПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Такой штрих код уже указан у сотрудника") + " (" + ОсновнойШтрихКод + "): " + РезультатОбработки);
					Отказ = ИСТИНА;
				КонецЕсли;
				
			КонецЕсли;	
		КонецЕсли;	
		
		Если НЕ Отказ
			И Модифицированность() Тогда
			
			МассивПустыхСтрок = Новый массив;
			Для Каждого СтрокаСоставаНабора из РасчетЗарплаты цикл
				Если НЕ ЗначениеЗаполнено(СтрокаСоставаНабора.ВидНачисления)
					И НЕ ЗначениеЗаполнено(СтрокаСоставаНабора.Размер) Тогда
					МассивПустыхСтрок.Добавить(СтрокаСоставаНабора);
				КонецЕсли;                                    	
			КонецЦикла;
			Для Каждого СтрокаСоставаНабора из МассивПустыхСтрок цикл
				РасчетЗарплаты.Удалить(СтрокаСоставаНабора);	
			КонецЦикла;
			
			МассивПустыхСтрок = Новый массив;
			Для Каждого СтрокаСоставаНабора из склады цикл
				Если НЕ ЗначениеЗаполнено(СтрокаСоставаНабора.Склад) Тогда
					МассивПустыхСтрок.Добавить(СтрокаСоставаНабора);
				КонецЕсли;                                    	
			КонецЦикла;
			Для Каждого СтрокаСоставаНабора из МассивПустыхСтрок цикл
				склады.Удалить(СтрокаСоставаНабора);	
			КонецЦикла;
			
			БылиИзменения = ЛОЖЬ;
			Если НЕ ЗначениеЗаполнено(клиент) Тогда
				клиентОбъект = Справочники.Клиенты.СоздатьЭлемент();
				БылиИзменения = ИСТИНА;
			Иначе
				клиентОбъект = клиент.ПолучитьОбъект();
			КонецЕсли;
			Если ЗначениеЗаполнено(адрес) 
				И НЕ клиентОбъект.Адрес = адрес Тогда		
				БылиИзменения = ИСТИНА;
			КонецЕсли;		
			
			ВидЦен = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВидЦенДляОтпускаТоваровСобственнымСотрудникам"); 
			Если ЗначениеЗаполнено(ВидЦен)
				И НЕ клиентОбъект.ВидЦен = ВидЦен Тогда
				
				клиентОбъект.ВидЦен = ВидЦен;	
				БылиИзменения = ИСТИНА;
			КонецЕсли;
			Если ЗначениеЗаполнено(Комментарий) 
				И НЕ клиентОбъект.Комментарий = Комментарий Тогда		
				
				клиентОбъект.Комментарий = Комментарий;
				БылиИзменения = ИСТИНА;
			КонецЕсли;
			
			РодительКлиент = Справочники.Клиенты.НайтиПоНаименованию(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Собственные Сотрудники"));
			
			Если НЕ ЗначениеЗаполнено(РодительКлиент) Тогда
				
				РодительКлиентОбъект = Справочники.Клиенты.СоздатьГруппу();
				РодительКлиентОбъект.Наименование 	= ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Собственные Сотрудники");
				РодительКлиентОбъект.ВидЦен 		= ВидЦен;
				РодительКлиентОбъект.Записать();
				РодительКлиент = РодительКлиентОбъект.Ссылка;
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(РодительКлиент) 
				И ОбщийМодульПовтор.ЭтоГруппа(РодительКлиент) 
				И НЕ клиентОбъект.Родитель = РодительКлиент Тогда
				
				клиентОбъект.Родитель = РодительКлиент;
				БылиИзменения = ИСТИНА;
			КонецЕсли;
			
			Если НЕ клиентОбъект.Наименование = Наименование тогда
				клиентОбъект.Наименование 			= Наименование;
				клиентОбъект.НаименованиеДляПечати 	= Наименование;    	
				БылиИзменения = ИСТИНА;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ОКПО) 
				И НЕ клиентОбъект.ОКПО = ОКПО Тогда
				
				клиентОбъект.ОКПО = ОКПО;
				БылиИзменения = ИСТИНА;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Телефон) 
				И НЕ клиентОбъект.Телефон = Телефон Тогда
				
				клиентОбъект.Телефон = Телефон;	
				БылиИзменения = ИСТИНА;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ЭлектроннаяПочта) 
				И НЕ клиентОбъект.ЭлектроннаяПочта = ЭлектроннаяПочта Тогда
				
				клиентОбъект.ЭлектроннаяПочта = ЭлектроннаяПочта;
				БылиИзменения = ИСТИНА;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ДатаРождения) 
				И НЕ клиентОбъект.ДатаРождения = ДатаРождения Тогда
				
				клиентОбъект.ДатаРождения = ДатаРождения;
				БылиИзменения = ИСТИНА;
			КонецЕсли;
			
			Если НЕ клиентОбъект.ЭтоСотрудник тогда
				клиентОбъект.ЭтоСотрудник = ИСТИНА;   	
				БылиИзменения = ИСТИНА;
			КонецЕсли;
			
			Если БылиИзменения тогда
				Попытка // Записи клиентОбъект
					
					клиентОбъект.Записать();
					клиент = клиентОбъект.Ссылка;
					
				Исключение // Записи клиентОбъект
					Если ОбщийМодульПовторВТеченииСервера.ВыводитьСообщенияМожно() Тогда
						ТекстОписаниеОшибки = ОписаниеОшибки();
						ОбщийМодульСервисСервер.ДобавитьСообщениеПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ошибка при попытке записи связанного Клиента") + ": " + клиентОбъект + " " + ТекстОписаниеОшибки, , Ссылка);
					КонецЕсли;
				КонецПопытки; // Записи клиентОбъект
				
			КонецЕсли;
			
			БылиИзменения = ЛОЖЬ;
			Если НЕ ЗначениеЗаполнено(Поставщик) Тогда
				ПоставщикОбъект = Справочники.Поставщики.СоздатьЭлемент();
				БылиИзменения = ИСТИНА;
			Иначе
				ПоставщикОбъект = Поставщик.ПолучитьОбъект();
			КонецЕсли;
			
			Если ЗначениеЗаполнено(адрес) 
				И НЕ ПоставщикОбъект.Адрес = адрес Тогда		
				
				БылиИзменения = ИСТИНА;
			КонецЕсли;		
			
			Если ЗначениеЗаполнено(ВидЦен)
				И НЕ ПоставщикОбъект.ВидЦен = ВидЦен Тогда
				
				ПоставщикОбъект.ВидЦен = ВидЦен;	
				БылиИзменения = ИСТИНА;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Комментарий) 
				И НЕ ПоставщикОбъект.Комментарий = Комментарий Тогда		
				
				ПоставщикОбъект.Комментарий = Комментарий;
				БылиИзменения = ИСТИНА;
			КонецЕсли;
			
			РодительПоставщик = Справочники.Поставщики.НайтиПоНаименованию(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Собственные Сотрудники"));
			
			Если НЕ ЗначениеЗаполнено(РодительПоставщик) Тогда
				
				РодительПоставщикОбъект = Справочники.Поставщики.СоздатьГруппу();
				РодительПоставщикОбъект.Наименование = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Собственные Сотрудники");
				РодительПоставщикОбъект.ВидЦен 		 = ВидЦен;
				РодительПоставщикОбъект.Записать();
				
				РодительПоставщик = РодительПоставщикОбъект.Ссылка;
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(РодительПоставщик) 
				И ОбщийМодульПовтор.ЭтоГруппа(РодительПоставщик) 
				И НЕ ПоставщикОбъект.Родитель = РодительПоставщик Тогда
				
				ПоставщикОбъект.Родитель = РодительПоставщик;
				БылиИзменения = ИСТИНА;
			КонецЕсли;
			
			Если НЕ ПоставщикОбъект.Наименование = Наименование тогда
				ПоставщикОбъект.Наименование = Наименование;
				ПоставщикОбъект.НаименованиеДляПечати = Наименование;    	
				БылиИзменения = ИСТИНА;
			КонецЕсли;
			Если ЗначениеЗаполнено(ОКПО) 
				И НЕ ПоставщикОбъект.ОКПО = ОКПО Тогда
				
				ПоставщикОбъект.ОКПО = ОКПО;
				БылиИзменения = ИСТИНА;
			КонецЕсли;
			Если ЗначениеЗаполнено(Телефон) 
				И НЕ ПоставщикОбъект.Телефон = Телефон Тогда
				ПоставщикОбъект.Телефон = Телефон;	
				БылиИзменения = ИСТИНА;
			КонецЕсли;
			Если ЗначениеЗаполнено(ЭлектроннаяПочта) 
				И НЕ ПоставщикОбъект.ЭлектроннаяПочта = ЭлектроннаяПочта Тогда
				
				ПоставщикОбъект.ЭлектроннаяПочта = ЭлектроннаяПочта;
				БылиИзменения = ИСТИНА;
			КонецЕсли;
			
			Если НЕ ПоставщикОбъект.ЭтоСотрудник тогда
				ПоставщикОбъект.ЭтоСотрудник = ИСТИНА;   	
				БылиИзменения = ИСТИНА;
			КонецЕсли;
			
			Если БылиИзменения тогда
				Попытка
					
					ПоставщикОбъект.Записать();
					Поставщик = ПоставщикОбъект.Ссылка;
					
				Исключение 
					Если ОбщийМодульПовторВТеченииСервера.ВыводитьСообщенияМожно() Тогда
						ТекстОписаниеОшибки = ОписаниеОшибки();
						ОбщийМодульСервисСервер.ДобавитьСообщениеПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ошибка при попытке записи связанного Поставщика") + ": " + ПоставщикОбъект + " " + ТекстОписаниеОшибки, , Ссылка);
					КонецЕсли;
				КонецПопытки;
				
			КонецЕсли; 	
			ОбщийМодульСервер.ПроверитьСменуНаименованияНаТекущемЯзыке(Наименование, Ссылка);
			
			Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ФормироватьОписаниеТаблицОбъектовДляИхСписков") Тогда
				ОбщийМодульСервер.ОформитьОписаниеТаблицы(ЭтотОбъект, "Склады", "Склад", "-");
				ОбщийМодульСервер.ОформитьОписаниеТаблицы(ЭтотОбъект, "Регионы", "Регион", "-");
				ОбщийМодульСервер.ОформитьОписаниеТаблицы(ЭтотОбъект, "Категории", "Категория", "-");
			КонецЕсли;
			
	Если НЕ Отказ Тогда
		Если НЕ ПустаяСтрока(Подпись) Тогда
			Отказ = ОбщийМодульСервер.ПроверитьУникальностьЗначенияРеквизита(Отказ, "Сотрудники", Подпись, Ссылка, , , "Подпись");
		КонецЕсли;
	КонецЕсли;
	
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Комментарий = "";
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если НЕ Отказ
		И Модифицированность() Тогда
		
		ОбновитьПовторноИспользуемыеЗначения();
		
	КонецЕсли;
	
КонецПроцедуры
