// sza140428-0258
// sza131211-1523

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)

		Если ОбщийМодульПовтор.ВывестиНаименованияНаДругомЯзыке() Тогда
			ВозможноеПредставление = ОбщийМодульПовтор.ПолучитьПредставлениеНаЯзыке(Данные.Ссылка, , ИСТИНА);
			Если НЕ ВозможноеПредставление = Неопределено Тогда
				Представление = ВозможноеПредставление;
				СтандартнаяОбработка = ЛОЖЬ;
			КонецЕсли;
		КонецЕсли;

	КонецПроцедуры

	Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)

		Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ДляУскоренияРаботыСБазойДанныхНеВыводитьДополнительныхДанных") Тогда
			Если ВидФормы = "ФормаСписка" Тогда
				ВыбраннаяФорма = "ФормаСпискаУпрощенная";
				СтандартнаяОбработка = ЛОЖЬ;
			ИначеЕсли ВидФормы = "ФормаВыбора" Тогда
				ВыбраннаяФорма = "ФормаВыбораУпрощенная";
				СтандартнаяОбработка = ЛОЖЬ;
			Иначе // форма объекта
				ВыбраннаяФорма = "ФормаЭлементаУпрощенная";
				СтандартнаяОбработка = ЛОЖЬ;
			КонецЕсли;
		КонецЕсли;

	КонецПроцедуры

#КонецЕсли
