//sza101117-1510       
//sza101117-0116       
//sza101109-1811       
//sza101025

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОбщийМодульКлиент.ДобавитьСобытиеЖурнала("Выгрузил карточку в файл", 2, ПараметрКоманды);
	ПодсистемаИЭИмпортЭкспортФСКлиент.ИмпортЭкспортОбработкаОбмена(
	ПодсистемаИЭИмпортЭкспортФСКлиент.СоздатьСтруктуруВызоваИмпЭкспОперации(ПараметрКоманды,,Истина,,"К")
	); //Экспорт  (Истина) /Импорт (ложь, К/С/З - карточка, список, Товары
	
КонецПроцедуры

