// sza131119-2322
// sza101115-1652       

&НаКлиенте
Процедура ЗакрытьЭтуФормуВыбора(Команда)
	ЭтаФорма.Закрыть(Элементы.ТипОбъектаОбмена);
КонецПроцедуры

&НаКлиенте
Процедура ОтменаЗакрыть(Команда)
	ТипОбъектаОбмена = "";
	ЭтаФорма.Закрыть(Элементы.ТипОбъектаОбмена);
КонецПроцедуры

&НаСервере
Процедура ПолучитьСписокТипов()
	Элементы.ТипОбъектаОбмена.СписокВыбора.Очистить();
	Для Каждого ТипОбъекта Из Метаданные.Справочники Цикл 	
		Элементы.ТипОбъектаОбмена.СписокВыбора.Добавить("С" + ТипОбъекта.Имя, "Справочники " + ТипОбъекта.Синоним);
	КонецЦикла;
	Для Каждого ТипОбъекта Из Метаданные.Документы Цикл 	
		Элементы.ТипОбъектаОбмена.СписокВыбора.Добавить("Д" + ТипОбъекта.Имя, "Документы " + ТипОбъекта.Синоним);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)                                                                    // ПРИ ОТКРЫТИИ	
	
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
	ПолучитьСписокТипов();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьСобственныйПереводЭлементовИнтерфейса") Тогда
			ОбщийМодульСервер.ПеревестиРеквизитыФормы(ЭтаФорма);	
		КонецЕсли;		
КонецПроцедуры
