//sza131227-0155 : 
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "КАРТОЧКА_ДП";
	ТабДок.КлючПараметровПечати = ТабДок.ИмяПараметровПечати;
	
	Печать(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = ЛОЖЬ;
	ТабДок.Защита = ЛОЖЬ;
	ТабДок.ТолькоПросмотр = ЛОЖЬ;
	ТабДок.ОтображатьЗаголовки = ЛОЖЬ;
	ТабДок.Показать();
	
КонецПроцедуры

&НаСервере
Процедура Печать(ТабДок, ПараметрКоманды)
	Справочники.ПодсистемаИЭИмпортЭкспортФСДополнительноеПоведение.Печать(ТабДок, ПараметрКоманды);
КонецПроцедуры



