// sza160210-1608

&НаСервере
Процедура НаПечать(ДокументДляПечати, ПараметрКоманды)
	Справочники.Пользователи.НаПечать(ДокументДляПечати, ПараметрКоманды);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОбъектПечати", ПараметрКоманды[0]);
	ПараметрыФормы.Вставить("Контрагент", ПараметрКоманды[0]);
	ПараметрыФормы.Вставить("НаименованиеДокумента", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Карточка"));
	ФормаПечати = ПолучитьФорму("ОбщаяФорма.ФормаПечати", ПараметрыФормы);
	
	НаПечать(ФормаПечати.Результат, ПараметрКоманды);
	ФормаПечати.Результат.ОтображатьСетку 	= ЛОЖЬ;
	ФормаПечати.Результат.Защита 			= ИСТИНА;
	ФормаПечати.Результат.ТолькоПросмотр 	= ИСТИНА;
	ФормаПечати.Результат.ОтображатьЗаголовки = ЛОЖЬ;
	ФормаПечати.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("печать: карточка пользователя");
	ФормаПечати.Открыть();	
	
КонецПроцедуры
