// sza131120-2208 :

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура("ЭлементЗаметок", ПараметрыВыполненияКоманды.Источник.Объект.Ссылка);
	Если ОбщийМодульСервисСервер.ПолучитьВерсиюПлатформы() < 803040000 Тогда
		ОткрытьФорму("Справочник.ЗаметкиИНапоминания.Форма.ЗаметкиОбъекта", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	Иначе
		Выполнить(" ОткрытьФорму(""Справочник.ЗаметкиИНапоминания.Форма.ЗаметкиОбъекта"", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка); ");	
	КонецЕсли;
	
КонецПроцедуры
