// sza160218-0017 

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура НаПечать(ТабДок, Ссылка) Экспорт
	
	Макет = Справочники.Ваучеры.ПолучитьМакет("НаПечать");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Ваучеры.Валюта,
	|	Ваучеры.ДатаНачала,
	|	Ваучеры.ДатаОкончания,
	|	Ваучеры.ДатаРегистрации,
	|	Ваучеры.ДатаРедакции,
	|	Ваучеры.ДатаСоздания,
	|	Ваучеры.Код,
	|	ВЫРАЗИТЬ(Ваучеры.Комментарий КАК СТРОКА(1000)) КАК Комментарий,
	|	Ваучеры.Контрагент,
	|	Ваучеры.Наименование,
	|	Ваучеры.Номенклатура,
	|	Ваучеры.НоминалПроцент,
	|	Ваучеры.Организация,
	|	Ваучеры.Ответственный,
	|	Ваучеры.Отключен,
	|	Ваучеры.ПроДляНоменклатурныхГрупп,
	|	Ваучеры.ПроДляНоменклатурыИЕеГрупп,
	|	Ваучеры.СкладРегистрации,
	|	Ваучеры.Сотрудник,
	|	Ваучеры.ТипВаучера,
	|	Ваучеры.ШтрихКод,
	|	Ваучеры.Эмитент,
	|	Ваучеры.ДляНоменклатурныхГрупп.(
	|		НомерСтроки,
	|		НоменклатурнаяГруппа,
	|		ПроцентСкидки,
	|		НеНакапливать,
	|		ОСтроке
	|	),
	|	Ваучеры.ДляНоменклатурыИЕеГрупп.(
	|		НомерСтроки,
	|		Номенклатура,
	|		ПроцентСкидки,
	|		НеНакапливать,
	|		ОСтроке
	|	),
	|	Ваучеры.ДляСкладов.(
	|		НомерСтроки,
	|		Склад,
	|		ПроцентСкидки,
	|		НеНакапливать,
	|		ОСтроке
	|	)
	|ИЗ Справочник.Ваучеры КАК Ваучеры
	|ГДЕ Ваучеры.Ссылка В (&Ссылка)";
	
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьДляНоменклатурныхГруппШапка = Макет.ПолучитьОбласть("ДляНоменклатурныхГруппШапка");
	ОбластьДляНоменклатурныхГрупп = Макет.ПолучитьОбласть("ДляНоменклатурныхГрупп");
	ОбластьДляНоменклатурыИЕеГруппШапка = Макет.ПолучитьОбласть("ДляНоменклатурыИЕеГруппШапка");
	ОбластьДляНоменклатурыИЕеГрупп = Макет.ПолучитьОбласть("ДляНоменклатурыИЕеГрупп");
	ОбластьДляСкладовШапка = Макет.ПолучитьОбласть("ДляСкладовШапка");
	ОбластьДляСкладов = Макет.ПолучитьОбласть("ДляСкладов");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьЗаголовок);
		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(Шапка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьДляНоменклатурныхГруппШапка);
		ТабДок.Вывести(ОбластьДляНоменклатурныхГруппШапка);
		ВыборкаДляНоменклатурныхГрупп = Выборка.ДляНоменклатурныхГрупп.Выбрать();
		Пока ВыборкаДляНоменклатурныхГрупп.Следующий() Цикл
			ОбластьДляНоменклатурныхГрупп.Параметры.Заполнить(ВыборкаДляНоменклатурныхГрупп);
			ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьДляНоменклатурныхГрупп);
			ТабДок.Вывести(ОбластьДляНоменклатурныхГрупп, ВыборкаДляНоменклатурныхГрупп.Уровень());
		КонецЦикла;

		ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьДляНоменклатурыИЕеГруппШапка);
		ТабДок.Вывести(ОбластьДляНоменклатурыИЕеГруппШапка);
		ВыборкаДляНоменклатурыИЕеГрупп = Выборка.ДляНоменклатурыИЕеГрупп.Выбрать();
		Пока ВыборкаДляНоменклатурыИЕеГрупп.Следующий() Цикл			
			ОбластьДляНоменклатурыИЕеГрупп.Параметры.Заполнить(ВыборкаДляНоменклатурыИЕеГрупп);
			ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьДляНоменклатурыИЕеГрупп);
			ТабДок.Вывести(ОбластьДляНоменклатурыИЕеГрупп, ВыборкаДляНоменклатурыИЕеГрупп.Уровень());
		КонецЦикла;

		ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьДляСкладовШапка);
		ТабДок.Вывести(ОбластьДляСкладовШапка);
		ВыборкаДляСкладов = Выборка.ДляСкладов.Выбрать();
		Пока ВыборкаДляСкладов.Следующий() Цикл
			ОбластьДляСкладов.Параметры.Заполнить(ВыборкаДляСкладов);
			ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьДляСкладов);
			ТабДок.Вывести(ОбластьДляСкладов, ВыборкаДляСкладов.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
