//sza140509-0141 SZA: 
//sza130905-1654 : 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)          // ПРИ СОЗДАНИИ НА СЕРВЕРЕ
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("000500", ЭтаФорма, Отказ, );
	
	Если НЕ Отказ Тогда
		ИспользоватьМагнитныеКартыКлиентов 		= ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ИспользоватьМагнитныеКартыКлиентов");
		ИспользоватьПодключаемоеОборудование 	= ПодключаемоеОборудованиеДСервер.ИспользоватьПодключаемоеОборудование();
		
		ВсегоДолгКлиентов = ОбновитьВсегоДолгКлиентов();
		НаименованиеОсновнойВалюты 				= Справочники.Валюты.ОсновнаяВалюта.Наименование ;
		элементы.ВсегоДолгКлиентов.Видимость 	= не ВсегоДолгКлиентов = 0;
		элементы.НаименованиеОсновнойВалюты.Видимость = не ВсегоДолгКлиентов = 0;
		ОбщийМодульСервер.ОбеспечитьСписокОтборов(Список);		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)                                                                    // ПРИ ОТКРЫТИИ	
	
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
	
	Если ИспользоватьПодключаемоеОборудование 
		и ИспользоватьМагнитныеКартыКлиентов
		И МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда
		
		ОписаниеОшибки = "" ;
		ПоддерживаемыеТипыВО = Новый Массив();
		ПоддерживаемыеТипыВО.Добавить( "СчитывательМагнитныхКарт");
		
		Если Не МенеджерОборудованияКлиент.ПодключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО, ОписаниеОшибки) Тогда
			ТекстСообщения = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке( "При подключении оборудования произошла ошибка:
			|""%ОписаниеОшибки%""." );
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ОписаниеОшибки%", ОписаниеОшибки);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	
	Элементы.ПроцентСкидки.Видимость = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВключитьВозможностьУказыватьПроцентСкидкиДляКлиентов");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()                                                  // ПРИ ЗАКРЫТИИ   	
	
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
	
	Если ИспользоватьПодключаемоеОборудование 
		и ИспользоватьМагнитныеКартыКлиентов Тогда
		
		ПоддерживаемыеТипыВО = Новый Массив ();
		ПоддерживаемыеТипыВО.Добавить("СчитывательМагнитныхКарт");
		МенеджерОборудованияКлиент.ОтключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИспользоватьМагнитныеКартыКлиентов
		и Источник = "ПодключаемоеОборудование"
		И ВводДоступен ()
		и ИмяСобытия = "TracksData" Тогда
		
		ПолученКодИзСМК(Параметр);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолученКодИзСМК(Параметр)
	
	Если Параметр[1][3] <> Неопределено Тогда
		МКод = Параметр[1][3][0].ДанныеДорожек[0].ЗначениеПоля;
	Иначе
		МКод = Параметр[0];
	КонецЕсли;
	
	ПолучитьКлиента(МКод);
	
КонецПроцедуры

&НаКлиенте
ПРоцедура ПолучитьКлиента(МКод);
	
	Клиент = ПолучитьКлиентаНаСервере(МКод);	
	
	Если ЗначениеЗаполнено(клиент) Тогда
		ПараметрыОткрытия = Новый Структура("Ключ", Клиент);
		ОткрытьФорму("Справочник.Клиенты.Форма.ФормаЭлемента", ПараметрыОткрытия);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция   ПолучитьКлиентаНаСервере(Знач МКод)
	
	Клиент = ПодключаемоеОборудованиеДСервер.НайтиКлиентаПоМК(МКод);
	Если Клиент <> Неопределено Тогда
		Возврат Клиент;
		
	Иначе
		ТекстСообщения = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Карта не найдена.");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция  ОбновитьВсегоДолгКлиентов(Знач ПолучитьОтсроченныеОстатки = Ложь)
	
	ВсегоДолгКлиентов = 0;
	
	Запрос = Новый Запрос;
	Если ПолучитьОтсроченныеОстатки Тогда
		Запрос.Текст = "ВЫБРАТЬ Расчеты.СуммаОстаток
		|ИЗ РегистрНакопления.Расчеты.Остатки(&ТекущаяДата, ) КАК Расчеты";	
		
	Иначе
		Запрос.Текст = "ВЫБРАТЬ Расчеты.СуммаОстаток
		|ИЗ РегистрНакопления.РасчетыСОтсрочкой.Остатки(&ТекущаяДата, ) КАК Расчеты";	
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ТекущаяДата", ОбщийМодульСервисСервер.ПользователяТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ВсегоДолгКлиентов = ВсегоДолгКлиентов + ВыборкаДетальныеЗаписи.суммаОстаток;
		КонецЦикла;                        	
	КонецЕсли;
	
	Возврат ВсегоДолгКлиентов;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьПоказательДолга(Команда)
	
	ВсегоДолгКлиентов = ОбновитьВсегоДолгКлиентов();
	ВсегоПросрочено	  = ОбновитьВсегоДолгКлиентов(Истина);
	Элементы.Список.Обновить();
	элементы.ВсегоДолгКлиентов.Видимость 			= не ВсегоДолгКлиентов = 0;
	элементы.ВсегоПросрочено.Видимость 				= не ВсегоПросрочено = 0;
	элементы.НаименованиеОсновнойВалюты.Видимость 	= (не ВсегоДолгКлиентов = 0) или (не ВсегоПросрочено = 0);
	
КонецПроцедуры
