//sza130923-1639 : 

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ФормаПечати = получитьформу("ОбщаяФорма.ФормаПечати");
	Печать(ФормаПечати.Результат, ПараметрКоманды);

	ФормаПечати.Результат.ОтображатьСетку = Ложь;
	ФормаПечати.Результат.Защита = Истина;
	ФормаПечати.Результат.ТолькоПросмотр = Истина;
	ФормаПечати.Результат.ОтображатьЗаголовки = Ложь;
	ФормаПечати.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("печать: Инвентаризация");
	ФормаПечати.открыть();	
КонецПроцедуры

&НаСервере
Процедура Печать(ТабДок, ПараметрКоманды) 
	ОбщийМодульСервер.ДобавитьСобытиеЖурналаНаСервере(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Напечатал документ. "), 2);
	Документы.Инвентаризации.Печать(ТабДок, ПараметрКоманды);
КонецПроцедуры
