// sza140107-0334 :

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)

		Если ОбщийМодульПовтор.ВывестиНаименованияНаДругомЯзыке() Тогда
			ВозможноеПредставление = ОбщийМодульПовтор.получитьПредставлениеНаЯзыке(Данные.ссылка, , ИСТИНА);
			Если НЕ ВозможноеПредставление = Неопределено Тогда
				Представление = ВозможноеПредставление;
				СтандартнаяОбработка = ЛОЖЬ;
			КонецЕсли;
		КонецЕсли;

	КонецПроцедуры

#КонецЕсли
