// sza140420-1554  
// sza131023-1650 : 
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("000500", , , );	
	
	Если НЕ Отказ Тогда
		ПараметрыФормы = Новый Структура("Клиент", ПараметрКоманды);
		ОткрытьФорму("ЖурналДокументов.ДокументыКлиента.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);// , ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	КонецЕсли;
	
КонецПроцедуры



