//sza140508-1607  
//sza131003-0342 : 
&НаКлиенте
Процедура ПриЗакрытии()                                      // ПРИ ЗАКРЫТИИ   
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)                                 // ПРИ ОТКРЫТИИ	
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("000400", ЭтаФорма, Отказ,);
	Если НЕ Отказ Тогда
		ОбщийМодульСервер.ОбеспечитьСписокОтборов(Список);
	КонецЕсли;
	
КонецПроцедуры
