// sza141117-1314 фикс
// sza140717-0222  доб документов
// sza140506-1011  
// sza130915-2214

Функция   ВыгрузитьДанныеВФайл(Знач ИмяФайлаTxt)	
	
	Попытка 
		
		Каталог = КаталогВременныхФайлов();
		Попытка 
			УдалитьФайлы(Каталог + ИмяФайлаTxt);
		Исключение 	
		КонецПопытки;
		
		ТекДок.Записать(Каталог + ИмяФайлаTxt);
		
		Возврат ИСТИНА;
		
	Исключение 	
		ТекстОписаниеОшибки = ОписаниеОшибки();
		ОбщегоНазначения.СообщитьПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ошибка при записи файла") + ": " + ТекстОписаниеОшибки);
		
		Возврат ЛОЖЬ;		
	КонецПопытки;
	
КонецФункции

&НаКлиенте
Процедура ВыгрузитьДанныеРуководителю(Команда)
	
	АвтоПериодДляВыгрузкиРуководителю = Неопределено;
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ВыгрузитьДанныеРуководителюЗавершение", ЭтаФорма), ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Вы согласны, чтобы программа установила период выгрузки автоматически?") + Символы.ПС + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("(Если прошлый пакет руководителем получен.)"), РежимДиалогаВопрос.ДаНет); 
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьДанныеРуководителюЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	АвтоПериодДляВыгрузкиРуководителю = РезультатВопроса = КодВозвратаДиалога.Да;
	
	РуководительПодтвердилПрошлуюВыгрузку = ЛОЖЬ;
	
	Если АвтоПериодДляВыгрузкиРуководителю Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("ВыгрузитьДанныеРуководителюЗавершениеЗавершение", ЭтаФорма, Новый Структура("АвтоПериодДляВыгрузкиРуководителю", АвтоПериодДляВыгрузкиРуководителю)), ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Руководитель удачно загрузил прошлый пакет выгрузки?"), РежимДиалогаВопрос.ДаНет);
        Возврат;
	  КонецЕсли; 
	
	ВыгрузитьДанныеРуководителюЗавершениеФрагмент(АвтоПериодДляВыгрузкиРуководителю, РуководительПодтвердилПрошлуюВыгрузку);
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьДанныеРуководителюЗавершениеЗавершение(РезультатВопроса1, ДополнительныеПараметры1) Экспорт
	
	АвтоПериодДляВыгрузкиРуководителю = ДополнительныеПараметры1.АвтоПериодДляВыгрузкиРуководителю;	
	
	Если РезультатВопроса1 = КодВозвратаДиалога.Да Тогда			
		РуководительПодтвердилПрошлуюВыгрузку = ИСТИНА;
	КонецЕсли;
	
	ВыгрузитьДанныеРуководителюЗавершениеФрагмент(АвтоПериодДляВыгрузкиРуководителю, РуководительПодтвердилПрошлуюВыгрузку);
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьДанныеРуководителюЗавершениеФрагмент(Знач АвтоПериодДляВыгрузкиРуководителю, Знач РуководительПодтвердилПрошлуюВыгрузку)
	
	Перем АдресФайла, ДиалогДляВыбораФайла, ДиалогРасширение, ДиалогФильтр, ИмяФайлаTxt, ТекстОжидания;
	
	АдресФайла = ПолучитьОтносительныйАдресНаСервере();
	
	ДиалогФильтр	 = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Файл архива") + " (*.zip)|*.zip";
	ДиалогРасширение = "zip";
	ДиалогДляВыбораФайла 	 = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогДляВыбораФайла.Заголовок				= ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Выберите имя архива для экспорта (выгрузки)") + ": ";
	ДиалогДляВыбораФайла.ПолноеИмяФайла			= АдресФайла; 
	ДиалогДляВыбораФайла.Фильтр					= ДиалогФильтр;
	ДиалогДляВыбораФайла.Расширение				= ДиалогРасширение;
	ДиалогДляВыбораФайла.МножественныйВыбор		= ЛОЖЬ;
	ДиалогДляВыбораФайла.ПредварительныйПросмотр	= ЛОЖЬ;
	ДиалогДляВыбораФайла.ИндексФильтра			= 0;
	
	Если ДиалогДляВыбораФайла.Выбрать() Тогда
		АдресФайла = ДиалогДляВыбораФайла.ПолноеИмяФайла;
		
		ТекстОжидания = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Идет выгрузка данных руководителю.");
		Состояние(ТекстОжидания, 50, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ждите.."));
		
		Если Формирование(АвтоПериодДляВыгрузкиРуководителю, РуководительПодтвердилПрошлуюВыгрузку) Тогда
			
			Состояние(ТекстОжидания, 75);			
			ИмяФайлаTxt = "/data_out.tmp";
			
			Если ВыгрузитьДанныеВФайл(ИмяФайлаTxt) Тогда
				Состояние(ТекстОжидания, 90); 				
				САрхивировать(АдресФайла, ИмяФайлаTxt);
			КонецЕсли;
		КонецЕсли;
		
		ОбщийМодульСервер.ДобавитьСобытиеЖурналаНаСервере(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Выгрузил данные руководителю в файл") + ": " + АдресФайла, 2);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьДеньгиТоваровИВзаиморасчетов(Команда)
	
	АдресФайла = ПолучитьОтносительныйАдресНаСервере();
	
	ДиалогФильтр	 = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Файл архива") + " (*.zip)|*.zip";
	ДиалогРасширение = "zip";
	ДиалогДляВыбораФайла 	 = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогДляВыбораФайла.Заголовок				= ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Выберите имя архива для экспорта (выгрузки)") + ": ";
	ДиалогДляВыбораФайла.ПолноеИмяФайла			= АдресФайла; // АДРЕС
	ДиалогДляВыбораФайла.Фильтр					= ДиалогФильтр;
	ДиалогДляВыбораФайла.Расширение				= ДиалогРасширение;
	ДиалогДляВыбораФайла.МножественныйВыбор		= ЛОЖЬ;
	ДиалогДляВыбораФайла.ПредварительныйПросмотр	= ЛОЖЬ;
	ДиалогДляВыбораФайла.ИндексФильтра			= 0;
	
	Если ДиалогДляВыбораФайла.Выбрать() Тогда
		АдресФайла = ДиалогДляВыбораФайла.ПолноеИмяФайла;
		
		ТекстОжидания = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Идет выгрузка данных об остатках.");
		Состояние(ТекстОжидания, 50, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ждите.."));
		
		Если ВыгрузитьДеньгиТоваровИВзаиморасчетовНаСервере() Тогда
			Состояние(ТекстОжидания, 75);
			ИмяФайлаTxt = "/data_now_out.tmp";
			
			Если ВыгрузитьДанныеВФайл(ИмяФайлаTxt) Тогда
				Состояние(ТекстОжидания, 90); 				
				САрхивировать(АдресФайла, ИмяФайлаTxt);	
			КонецЕсли;
		КонецЕсли;
		
		ОбщийМодульСервер.ДобавитьСобытиеЖурналаНаСервере(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Выгрузил данные об остатках в файл") + ": " + АдресФайла, 2);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция   ВыгрузитьДеньгиТоваровИВзаиморасчетовНаСервере()
	
	Отказ = ЛОЖЬ;
	
	ПодготовитьСпискиОтбора();	
	ЧтоВыгружено.Очистить();
	
	ТекДок.Очистить();
	ТекДок.ДобавитьСтроку(СокрЛП(Метаданные.Версия));
	ТекДок.ДобавитьСтроку(формат(КонецДня(Объект.ДатаОкончания), "ДФ=ггггММддЧЧммсс"));
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ ДеньгиОстатки.Валюта, ДеньгиОстатки.ФормаОплаты,
	|	ДеньгиОстатки.СуммаОстаток, ДеньгиОстатки.СуммаВВалютеОстаток,
	|	ДеньгиОстатки.ХранилищеДенег
	|ИЗ РегистрНакопления.Деньги.Остатки(&ДатаОкончания, ) КАК ДеньгиОстатки";
	
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Объект.ДатаОкончания));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДанных = РезультатЗапроса.Выбрать();
		СчетчикСтрок = 0;
		
		Пока ВыборкаДанных.Следующий() Цикл		
			СчетчикСтрок = СчетчикСтрок + 1;
			
			ТекДок.ДобавитьСтроку("ДЕНЬГИ");
			
			ЗначениеТут = ВыборкаДанных.Валюта;		
			РеквизитЭлементаТип = "СправочникСсылка.Валюты";
			ВыгрузитьРеквизит(ЗначениеТут, РеквизитЭлементаТип);
			
			ЗначениеТут = ВыборкаДанных.ФормаОплаты;		
			РеквизитЭлементаТип = "ПеречислениеСсылка.ФормыОплаты";
			ВыгрузитьРеквизит(ЗначениеТут, РеквизитЭлементаТип);
			
			ЗначениеТут = ВыборкаДанных.ХранилищеДенег;		
			РеквизитЭлементаТип = "СправочникСсылка.ХранилищаДенег";
			ВыгрузитьРеквизит(ЗначениеТут, РеквизитЭлементаТип);
			
			ЗначениеТут = ВыборкаДанных.СуммаОстаток;		
			РеквизитЭлементаТип = "Число";
			ВыгрузитьРеквизит(ЗначениеТут, РеквизитЭлементаТип);
			
			ЗначениеТут = ВыборкаДанных.СуммаВВалютеОстаток;		
			РеквизитЭлементаТип = "Число";
			ВыгрузитьРеквизит(ЗначениеТут, РеквизитЭлементаТип);
			
		КонецЦикла; 		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РасчетыОстатки.Клиент, РасчетыОстатки.СуммаОстаток КАК СуммаОстаток
	|ИЗ РегистрНакопления.Расчеты.Остатки(&ДатаОкончания, ) КАК РасчетыОстатки
	|ГДЕ РасчетыОстатки.СуммаОстаток <> 0 %%1 "   ;
	
	Если ВестиУчетРегионов
		И НЕ Объект.ОтборПоРегионам.Количество() = 0 Тогда
		
		Запрос.Текст = стрзаменить(Запрос.Текст, "%%1", " И ЕстьNull(РасчетыОстатки.Клиент.Регион, &ПустойРегион) В (&Регионы) ");
		Запрос.УстановитьПараметр("Регионы", СписокРегионов);
		Запрос.УстановитьПараметр("ПустойРегион", Справочники.Регионы.ПустаяСсылка());		
	КонецЕсли;
	
	Запрос.Текст = стрзаменить(Запрос.Текст, "%%1", "");	
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Объект.ДатаОкончания));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДанных = РезультатЗапроса.Выбрать();
		СчетчикСтрок = 0;
		
		Пока ВыборкаДанных.Следующий() Цикл		
			СчетчикСтрок = СчетчикСтрок + 1;
			
			ТекДок.ДобавитьСтроку("РАСЧЕТЫ");
			ЗначениеТут = ВыборкаДанных.Клиент;		
			РеквизитЭлементаТип = "СправочникСсылка.Клиенты";
			ВыгрузитьРеквизит(ЗначениеТут, РеквизитЭлементаТип);
			
			ЗначениеТут = ВыборкаДанных.СуммаОстаток;		
			РеквизитЭлементаТип = "Число";
			ВыгрузитьРеквизит(ЗначениеТут, РеквизитЭлементаТип);
			
		КонецЦикла;		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РасчетыСПоставщикамиОстатки.СуммаОстаток КАК СуммаОстаток,
	|	РасчетыСПоставщикамиОстатки.Поставщик
	|ИЗ РегистрНакопления.РасчетыСПоставщиками.Остатки(&ДатаОкончания, ) КАК РасчетыСПоставщикамиОстатки
	|ГДЕ РасчетыСПоставщикамиОстатки.СуммаОстаток <> 0 %%1 ";
	
	Если ВестиУчетРегионов
		И НЕ Объект.ОтборПоРегионам.Количество() = 0 Тогда
		
		Запрос.Текст = стрзаменить(Запрос.Текст, "%%1", " И ЕстьNull(РасчетыСПоставщикамиОстатки.Поставщик.Регион, &ПустойРегион) В (&Регионы) ");
		Запрос.УстановитьПараметр("Регионы", СписокРегионов);
		Запрос.УстановитьПараметр("ПустойРегион", Справочники.Регионы.ПустаяСсылка());		
	КонецЕсли;
	
	Запрос.Текст = стрзаменить(Запрос.Текст, "%%1", "");	
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Объект.ДатаОкончания));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДанных = РезультатЗапроса.Выбрать();
		СчетчикСтрок = 0;
		
		Пока ВыборкаДанных.Следующий() Цикл		
			СчетчикСтрок = СчетчикСтрок + 1;
			
			ТекДок.ДобавитьСтроку("РасчетыСПОСТАВЩИКАМИ");
			ЗначениеТут = ВыборкаДанных.Поставщик;		
			РеквизитЭлементаТип = "СправочникСсылка.Поставщики";
			ВыгрузитьРеквизит(ЗначениеТут, РеквизитЭлементаТип);
			
			ЗначениеТут = ВыборкаДанных.СуммаОстаток;		
			РеквизитЭлементаТип = "Число";
			ВыгрузитьРеквизит(ЗначениеТут, РеквизитЭлементаТип);
			
		КонецЦикла;		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ЗарплатаОстатки.Сотрудник,
	|	ЗарплатаОстатки.ВидНачисления, ЗарплатаОстатки.СуммаОстаток,
	|	ЗарплатаОстатки.СуммаВВалютеОстаток
	|ИЗ РегистрНакопления.Зарплата.Остатки(&ДатаОкончания, ) КАК ЗарплатаОстатки" ;
	
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Объект.ДатаОкончания));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДанных = РезультатЗапроса.Выбрать();
		СчетчикСтрок = 0;
		
		Пока ВыборкаДанных.Следующий() Цикл		
			СчетчикСтрок = СчетчикСтрок + 1;
			
			ТекДок.ДобавитьСтроку("ЗАРПЛАТА");
			ЗначениеТут = ВыборкаДанных.Сотрудник;		
			РеквизитЭлементаТип = "СправочникСсылка.Сотрудники";
			ВыгрузитьРеквизит(ЗначениеТут, РеквизитЭлементаТип);
			
			ЗначениеТут = ВыборкаДанных.ВидНачисления;		
			РеквизитЭлементаТип = "ПеречислениеСсылка.ВидыНачислений";
			ВыгрузитьРеквизит(ЗначениеТут, РеквизитЭлементаТип);
			
			ЗначениеТут = ВыборкаДанных.СуммаОстаток;		
			РеквизитЭлементаТип = "Число";
			ВыгрузитьРеквизит(ЗначениеТут, РеквизитЭлементаТип);
			
			ЗначениеТут = ВыборкаДанных.СуммаВВалютеОстаток;		
			РеквизитЭлементаТип = "Число";
			ВыгрузитьРеквизит(ЗначениеТут, РеквизитЭлементаТип);
			
		КонецЦикла; 		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТоварыОстатки.Номенклатура,
	|	ЕСТЬNULL(ТоварыОстатки.СерияНоменклатуры, ""NULL"") КАК СерияНоменклатуры,
	|	ТоварыОстатки.Склад,
	|	ТоварыОстатки.КоличествоОстаток,
	|	ТоварыОстатки.СуммаОстаток
	|ИЗ РегистрНакопления.Товары.Остатки(&ДатаОкончания, ) КАК ТоварыОстатки
	|ГДЕ ТоварыОстатки.СуммаОстаток <> 0 %%1 %%2 %%3 " ;
	
	Если ВестиУчетПроизводителейНоменклатуры
		И НЕ Объект.ОтборПоПроизводителям.Количество() = 0 Тогда
		
		Запрос.Текст = стрзаменить(Запрос.Текст, "%%2", " И ЕСТЬNULL(ТоварыОстатки.Номенклатура.Производитель, &ПустойПроизводитель) В(&СписокПроизводителей) ");		
		Запрос.УстановитьПараметр("СписокПроизводителей", СписокПроизводителей);
		Запрос.УстановитьПараметр("ПустойПроизводитель", Справочники.Производители.ПустаяСсылка());
		
	КонецЕсли;
	
	Если ВестиУчетНоменклатурыВРазрезеНоменклатурныхГрупп
		И НЕ Объект.ОтборПоНоменклатурнымГруппам.Количество() = 0 Тогда
		
		Запрос.Текст = стрзаменить(Запрос.Текст, "%%3", " И ЕСТЬNULL(ТоварыОстатки.Номенклатура.НоменклатурнаяГруппа, &ПустаяНоменклатурнаяГруппа) В(&СписокНоменклатурныхГрупп) ");		
		Запрос.УстановитьПараметр("СписокНоменклатурныхГрупп", СписокНоменклатурныхГрупп);
		Запрос.УстановитьПараметр("ПустаяНоменклатурнаяГруппа", Справочники.НоменклатурныеГруппы.ПустаяСсылка());
		
	КонецЕсли;
	
	Если ВестиУчетПоСкладам
		И НЕ Объект.ОтборПоСкладам.Количество() = 0 Тогда
		
		Запрос.Текст = стрзаменить(Запрос.Текст, "%%1", " И ТоварыОстатки.Склад В(&Склады) ");		
		Запрос.УстановитьПараметр("Склады", СписокСкладов);		
	КонецЕсли;
	Запрос.Текст = стрзаменить(Запрос.Текст, "%%1", "");
	Запрос.Текст = стрзаменить(Запрос.Текст, "%%2", "");
	Запрос.Текст = стрзаменить(Запрос.Текст, "%%3", "");
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Объект.ДатаОкончания));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДанных = РезультатЗапроса.Выбрать();
		СчетчикСтрок = 0;
		
		Пока ВыборкаДанных.Следующий() Цикл		
			СчетчикСтрок = СчетчикСтрок + 1;
			
			ТекДок.ДобавитьСтроку("ТОВАРЫ");
			ЗначениеТут = ВыборкаДанных.Номенклатура;		
			РеквизитЭлементаТип = "СправочникСсылка.Номенклатура";
			ВыгрузитьРеквизит(ЗначениеТут, РеквизитЭлементаТип);
			
			ЗначениеТут = ВыборкаДанных.СерияНоменклатуры;		
			РеквизитЭлементаТип = "СправочникСсылка.СерииНоменклатуры";
			ВыгрузитьРеквизит(ЗначениеТут, РеквизитЭлементаТип);
			
			ЗначениеТут = ВыборкаДанных.Склад;		
			РеквизитЭлементаТип = "СправочникСсылка.Склады";
			ВыгрузитьРеквизит(ЗначениеТут, РеквизитЭлементаТип);
			
			ЗначениеТут = ВыборкаДанных.КоличествоОстаток;		
			РеквизитЭлементаТип = "Число";
			ВыгрузитьРеквизит(ЗначениеТут, РеквизитЭлементаТип);
			
			ЗначениеТут = ВыборкаДанных.СуммаОстаток;		
			РеквизитЭлементаТип = "Число";
			ВыгрузитьРеквизит(ЗначениеТут, РеквизитЭлементаТип);
			
			Если ИспользоватьСложныйМеханизмЦен Тогда
				ВыгрузитьЦены(ВыборкаДанных.Номенклатура);         	
			КонецЕсли;
			
		КонецЦикла;		
	КонецЕсли;
	
	Возврат не Отказ;
	
КонецФункции

Функция   ВыгрузитьДокумент(Знач Ссылка, Знач ТипДокумента, МассивЭлементов)
	
	Отказ = ЛОЖЬ;	
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		ТекДок.ДобавитьСтроку("NULL");
		
	Иначе
		ТипДокумента = СтрЗаменить(ТипДокумента, "ДокументСсылка.", "");
		
		ТекДок.ДобавитьСтроку(ТипДокумента);
		ТекДок.ДобавитьСтроку(Ссылка.Номер);
		Попытка 
			ТекДок.ДобавитьСтроку(?(Ссылка.Проведен, "Проведен", "НеПроведен"));
		Исключение 	
			ТекДок.ДобавитьСтроку("");
		КонецПопытки;
		ТекДок.ДобавитьСтроку(Формат(Ссылка.Дата, "ДФ=ггггММддЧЧммсс"));
		
		МетаДок  = метаданные.Документы[ТипДокумента];
		РеквизитыЭлемента 	 = МетаДок.Реквизиты;
		ТабЧасти = МетаДок.ТабличныеЧасти;
		
		Для Каждого РеквизитЭлемента Из РеквизитыЭлемента Цикл
			
			РеквизитЭлементаТип = ОбщийМодульТекстСервер.СтрокаТипаРеквизита(Ссылка, РеквизитЭлемента.имя);
			
			Отказ = ВыгрузитьРеквизит(Ссылка[РеквизитЭлемента.Имя], РеквизитЭлементаТип, МассивЭлементов);
			Если отказ Тогда	
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
		Если НЕ Отказ Тогда
			Для Каждого ТабЧасть Из ТабЧасти Цикл
				
				РеквыТабЧасти = ТабЧасть.Реквизиты;
				ТекДок.ДобавитьСтроку(формат(Ссылка[ТабЧасть.Имя].Количество(), "ЧН=; ЧГ=0"));
				
				Для Каждого СтрокаДок Из Ссылка[ТабЧасть.Имя] Цикл
					
					Для Каждого РеквизитЭлемента Из РеквыТабЧасти Цикл
						
						РеквизитЭлементаТип = ОбщийМодульТекстСервер.СтрокаТипаРеквизита(СтрокаДок, РеквизитЭлемента.имя);
						
						Отказ = ВыгрузитьРеквизит(СтрокаДок[РеквизитЭлемента.Имя], РеквизитЭлементаТип, МассивЭлементов);
						Если отказ Тогда	
							Прервать;
						КонецЕсли;	
						
					КонецЦикла;    				
				КонецЦикла;  			
			КонецЦикла;
			
		КонецЕсли;  	
	КонецЕсли;  	
	
	Возврат Отказ;
	
КонецФункции

&НаКлиенте
Процедура ВыгрузитьЕжедневныеДанныеОРозничнойРеализацииЗаПериодВБухгалтерияПредприятия2(Команда)
	
	ПараметрыДляФормы = Новый Структура("РеализацияДляБП", ИСТИНА);
	ОткрытьФормуМодально("Обработка.ВыгрузкаИЗагрузкаДанных_Обмен.Форма.ВыборДокументовИзСписка", ПараметрыДляФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьКартотекуНоменклатуры(Команда)
	
	АдресФайла = ПолучитьОтносительныйАдресНаСервере();
	
	ДиалогФильтр	 = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Файл архива") + " (*.zip)|*.zip";
	ДиалогРасширение = "zip";
	ДиалогДляВыбораФайла 	 = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогДляВыбораФайла.Заголовок				= ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Выберите имя архива для экспорта (выгрузки)") + ": ";
	ДиалогДляВыбораФайла.ПолноеИмяФайла			= АдресФайла;
	ДиалогДляВыбораФайла.Фильтр					= ДиалогФильтр;
	ДиалогДляВыбораФайла.Расширение				= ДиалогРасширение;
	ДиалогДляВыбораФайла.МножественныйВыбор		= ЛОЖЬ;
	ДиалогДляВыбораФайла.ПредварительныйПросмотр	= ЛОЖЬ;
	ДиалогДляВыбораФайла.ИндексФильтра			= 0;
	
	Если ДиалогДляВыбораФайла.Выбрать() Тогда
		АдресФайла = ДиалогДляВыбораФайла.ПолноеИмяФайла;
		
		ТекстОжидания = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Идет выгрузка картотеки номенклатуры..");
		Состояние(ТекстОжидания, 50, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ждите.."));
		
		Если ВыгрузитьКартотекуНоменклатурыНаСервере() Тогда
			Состояние(ТекстОжидания, 75, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ждите.."));
			ИмяФайлаTxt = "/data_nom_out.tmp";
			
			Если ВыгрузитьДанныеВФайл(ИмяФайлаTxt) Тогда
				Состояние(ТекстОжидания, 90, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ждите.."));	
				САрхивировать(АдресФайла, ИмяФайлаTxt);	
			КонецЕсли;
		КонецЕсли;
		
		ОбщийМодульСервер.ДобавитьСобытиеЖурналаНаСервере(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Выгрузил картотеку номенклатуры в файл") + ": " + АдресФайла, 2);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция   ВыгрузитьКартотекуНоменклатурыНаСервере()
	
	Отказ = ЛОЖЬ;
	
	ПодготовитьСпискиОтбора();
	
	ЧтоВыгружено.Очистить();
	
	ТекДок.Очистить();
	ТекДок.ДобавитьСтроку(СокрЛП(Метаданные.Версия));
	ТекДок.ДобавитьСтроку(формат(КонецДня(Объект.ДатаОкончания), "ДФ=ггггММддЧЧммсс"));
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ШтрихКоды.Номенклатура,
	|	ШтрихКоды.СерияНоменклатуры,
	|	ШтрихКоды.ШтрихКод
	|ИЗ РегистрСведений.ШтрихКоды КАК ШтрихКоды
	|ГДЕ ШтрихКоды.Номенклатура.ПометкаУдаления = ЛОЖЬ  %%1 %%2 " ;
	
	Если ВестиУчетПроизводителейНоменклатуры
		И НЕ Объект.ОтборПоПроизводителям.Количество() = 0 Тогда
		
		Запрос.Текст = стрзаменить(Запрос.Текст, "%%1", " И ЕСТЬNULL(ШтрихКоды.Номенклатура.Производитель, &ПустойПроизводитель) В(&СписокПроизводителей) ");		
		Запрос.УстановитьПараметр("СписокПроизводителей", СписокПроизводителей);
		Запрос.УстановитьПараметр("ПустойПроизводитель", Справочники.Производители.ПустаяСсылка());
		
	КонецЕсли;
	
	Если ВестиУчетНоменклатурыВРазрезеНоменклатурныхГрупп
		И НЕ Объект.ОтборПоНоменклатурнымГруппам.Количество() = 0 Тогда
		
		Запрос.Текст = стрзаменить(Запрос.Текст, "%%2", " И ЕСТЬNULL(ШтрихКоды.Номенклатура.НоменклатурнаяГруппа, &ПустаяНоменклатурнаяГруппа) В(&СписокНоменклатурныхГрупп) ");		
		Запрос.УстановитьПараметр("СписокНоменклатурныхГрупп", СписокНоменклатурныхГрупп);
		Запрос.УстановитьПараметр("ПустаяНоменклатурнаяГруппа", Справочники.НоменклатурныеГруппы.ПустаяСсылка());
		
	КонецЕсли;
	
	Запрос.Текст = стрзаменить(Запрос.Текст, "%%1", "");
	Запрос.Текст = стрзаменить(Запрос.Текст, "%%2", "");
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДанных = РезультатЗапроса.Выбрать();
		СчетчикСтрок = 0;
		
		Пока ВыборкаДанных.Следующий() Цикл		
			СчетчикСтрок = СчетчикСтрок + 1;
			
			ЗначениеТут = ВыборкаДанных.ШтрихКод;
			РеквизитЭлементаТип = "Строка";
			ВыгрузитьРеквизит(ЗначениеТут, РеквизитЭлементаТип);
			
			ЗначениеТут = ВыборкаДанных.Номенклатура;		
			РеквизитЭлементаТип = "СправочникСсылка.Номенклатура";
			ВыгрузитьРеквизит(ЗначениеТут, РеквизитЭлементаТип);
			
			ЗначениеТут = ВыборкаДанных.СерияНоменклатуры;		
			РеквизитЭлементаТип = "СправочникСсылка.СерииНоменклатуры";
			ВыгрузитьРеквизит(ЗначениеТут, РеквизитЭлементаТип);
			
			Если ЗначениеЗаполнено(ВидЦенДляКартотеки) Тогда
				ЗначениеТут = ОбщийМодульСервер.ПолучитьСложнуюЦену(ВыборкаДанных.Номенклатура, ВидЦенДляКартотеки, Объект.ДатаОкончания);
			Иначе
				ЗначениеТут = ВыборкаДанных.Номенклатура.Цена;
			КонецЕсли;
			РеквизитЭлементаТип = "Число";
			ВыгрузитьРеквизит(ЗначениеТут, РеквизитЭлементаТип);
			
		КонецЦикла;		
	КонецЕсли;
	
	Возврат не Отказ;
	
КонецФункции

&НаКлиенте
Процедура ВыгрузитьНастройкиПрограммы(Команда)
	
	АдресФайла = ПолучитьОтносительныйАдресНаСервере();
	
	ДиалогФильтр	 = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Файл настроек") + " (*.ini)|*.ini";
	ДиалогРасширение = "ini";
	ДиалогДляВыбораФайла 	 = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогДляВыбораФайла.Заголовок				= ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Выберите имя файла для экспорта (выгрузки) настроек") + ": ";
	ДиалогДляВыбораФайла.ПолноеИмяФайла			= АдресФайла;
	ДиалогДляВыбораФайла.Фильтр					= ДиалогФильтр;
	ДиалогДляВыбораФайла.Расширение				= ДиалогРасширение;
	ДиалогДляВыбораФайла.МножественныйВыбор		= ЛОЖЬ;
	ДиалогДляВыбораФайла.ПредварительныйПросмотр	= ЛОЖЬ;
	ДиалогДляВыбораФайла.ИндексФильтра			= 0;
	
	Если ДиалогДляВыбораФайла.Выбрать() Тогда
		АдресФайла 		= ДиалогДляВыбораФайла.ПолноеИмяФайла;
		
		ТекстОжидания 	= ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Идет выгрузка настроек программы.");
		Состояние(ТекстОжидания, , ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ждите.."));
		
		ВыгрузитьНастройкиПрограммыНаСервере(АдресФайла);
		
		ОбщийМодульСервер.ДобавитьСобытиеЖурналаНаСервере(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Выгрузил настройки в файл") + ": " + АдресФайла, 2);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьНастройкиПрограммыНаСервере(АдресФайла)
	
	ТекДок.Очистить();
	ТекДок.ДобавитьСтроку(СокрЛП(Метаданные.Версия));
	
	Для Каждого Константа Из метаданные.Константы Цикл
		
		ЗначениеКонстанты = Константы[Константа.Имя].Получить();		
		
		ТипТут = ТипЗнч(ЗначениеКонстанты);
		
		Если ТипТут = Тип("Строка") Тогда
			РеквизитЭлементаТип = "Строка";	
			
		ИначеЕсли ТипТут = Тип("Булево") Тогда
			РеквизитЭлементаТип = "Булево";	
			
		ИначеЕсли ТипТут = Тип("Число") Тогда
			РеквизитЭлементаТип = "Число";        		
			
		ИначеЕсли ТипТут = Тип("Дата") Тогда
			РеквизитЭлементаТип = "Дата";
			
		Иначе
			НайденыМета = Метаданные.НайтиПоТипу(ТипТут);
			Если НЕ НайденыМета = Неопределено Тогда
				РеквизитЭлементаТип = СтрЗаменить(НайденыМета.ПолноеИмя(), ".", "Ссылка.");
			Иначе
				РеквизитЭлементаТип = "NULL";
			КонецЕсли;                
			
		КонецЕсли;
		
		ВыгрузитьРеквизит(ЗначениеКонстанты, РеквизитЭлементаТип);
		
	КонецЦикла;
	
	ТекДок.Записать(АдресФайла);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьРеализациюЗаПериод(Команда)
	
	АдресФайла = ПолучитьОтносительныйАдресНаСервере();
	
	ДиалогФильтр	 = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Файл архива") + " (*.zip)|*.zip";
	ДиалогРасширение = "zip";
	ДиалогДляВыбораФайла 	 = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогДляВыбораФайла.Заголовок				=	ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Выберите имя архива для экспорта (выгрузки)") + ": ";
	ДиалогДляВыбораФайла.ПолноеИмяФайла			=	АдресФайла; // АДРЕС
	ДиалогДляВыбораФайла.Фильтр					=	ДиалогФильтр;
	ДиалогДляВыбораФайла.Расширение				=	ДиалогРасширение;
	ДиалогДляВыбораФайла.МножественныйВыбор		=	ЛОЖЬ;
	ДиалогДляВыбораФайла.ПредварительныйПросмотр	=	ЛОЖЬ;
	ДиалогДляВыбораФайла.ИндексФильтра			=	0;
	
	Если ДиалогДляВыбораФайла.Выбрать() Тогда
		АдресФайла = ДиалогДляВыбораФайла.ПолноеИмяФайла;
		Состояние(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Идет Выгрузка данных.."), , ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ждите.."));
		
		ВыгрузитьРеализациюЗаПериодНаСервере(АдресФайла);
		
		ОбщийМодульСервер.ДобавитьСобытиеЖурналаНаСервере(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Выгрузил данные в файл") + ": " + АдресФайла, 2);
	КонецЕсли; // когда файл АдресФайла выбран
	
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьРеализациюЗаПериодНаСервере(Знач АдресФайла)
	
	ПодготовитьСпискиОтбора();
	Константы.ПодсистемаИЭИмпортЭкспортОтносительныйАдресФайлов.Установить(АдресФайла);
	
	ФайлВыгрузки 		= Новый ЗаписьТекста;
	Каталог 			= КаталогВременныхФайлов();
	ИмяВременногоФайла 	= Каталог + "/tmp_outdata.tmp";
	Попытка 
		УдалитьФайлы(ИмяВременногоФайла);
	Исключение 	
	КонецПопытки;
	ФайлВыгрузки.Открыть(ИмяВременногоФайла);
	
	Запрос = Новый Запрос;
	
	Если ПараметрыСеанса.ИспользоватьСложныйМеханизмЦенПС Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Продажи.Период КАК Период,
		|	Продажи.Регистратор,
		| NULL,
		|	Продажи.Номенклатура,
		|	Продажи.Количество,
		|	Продажи.Сумма,
		|	ЕСТЬNULL(Продажи.Регистратор.КлиентПоставщик, &ПустойКлиент) КАК Клиент,
		|	Продажи.Номенклатура.Артикул,
		|	Продажи.Номенклатура.ОсновнойШтрихКод,
		|	Продажи.Номенклатура.Производитель,
		|	Продажи.Номенклатура.НоменклатурнаяГруппа,
		|	Продажи.Номенклатура.ПроцентСкидки,
		|	Продажи.Номенклатура.Наименование КАК Наименование,
		|	NULL КАК СерияНоменклатуры,
		|	ЕСТЬNULL(Продажи.Регистратор.Склад, &ПустойСклад) КАК Склад,
		|	ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0) КАК НоменклатураЦена,
		|	1 КАК ТипРегистра
		|ИЗ
		|	РегистрНакопления.Продажи КАК Продажи
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Цены.СрезПоследних(&ДатаОкончания, ВидЦен = &ВидЦен) КАК ЦеныСрезПоследних
		|		ПО Продажи.Номенклатура = ЦеныСрезПоследних.Номенклатура
		|ГДЕ
		|	Продажи.Период МЕЖДУ &ДатаНачала И &ДатаОкончания    %%1 %%2 %%3 %%4   
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Товары.Период,
		|	Товары.Регистратор,
		|	Товары.ВидДвижения,
		|	Товары.Номенклатура,
		|	Товары.Количество,
		|	Товары.Сумма,
		|	ЕСТЬNULL(Товары.Регистратор.КлиентПоставщик, &ПустойКлиент),
		|	Товары.Номенклатура.Артикул,
		|	Товары.Номенклатура.ОсновнойШтрихКод,
		|	Товары.Номенклатура.Производитель,
		|	Товары.Номенклатура.НоменклатурнаяГруппа,
		|	Товары.Номенклатура.ПроцентСкидки,
		|	Товары.Номенклатура.Наименование,
		|   Товары.СерияНоменклатуры,
		|	Товары.Склад,
		|	ЕСТЬNULL(ЦеныСрезПоследних.Цена, 0),
		|	2
		|ИЗ
		|	РегистрНакопления.Товары КАК Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Цены.СрезПоследних(&ДатаОкончания, ВидЦен = &ВидЦен) КАК ЦеныСрезПоследних
		|		ПО Товары.Номенклатура = ЦеныСрезПоследних.Номенклатура
		|ГДЕ
		|	Товары.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И Товары.ВидДвижения = &ВидДвиженияРасход
		|	И Товары.СписаниеИлиОприходование = ИСТИНА    %%1 %%2 %%3 %%4   ";
		
		Запрос.УстановитьПараметр("ВидЦен", ПредопределенноеЗначение("Справочник.ВидыЦен.ГлавныйВидЦен"));
		
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Продажи.Период КАК Период,
		|	Продажи.Регистратор,
		| NULL,
		|	Продажи.Номенклатура,
		|	Продажи.Количество,
		|	Продажи.Сумма,
		|	ЕСТЬNULL(Продажи.Регистратор.КлиентПоставщик, &ПустойКлиент) КАК Клиент,
		|	Продажи.Номенклатура.Артикул,
		|	Продажи.Номенклатура.ОсновнойШтрихКод,
		|	Продажи.Номенклатура.Производитель,
		|	Продажи.Номенклатура.НоменклатурнаяГруппа,
		|	Продажи.Номенклатура.Цена,
		|	Продажи.Номенклатура.ПроцентСкидки,
		|	Продажи.Номенклатура.Наименование КАК Наименование,
		|	NULL КАК СерияНоменклатуры,
		|	ЕСТЬNULL(Продажи.Регистратор.Склад, &ПустойСклад) КАК Склад,
		|	1 КАК ТипРегистра
		|ИЗ
		|	РегистрНакопления.Продажи КАК Продажи
		|ГДЕ
		|	Продажи.Период МЕЖДУ &ДатаНачала И &ДатаОкончания  %%1 %%2 %%3 %%4   
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Товары.Период,
		|	Товары.Регистратор,
		|	Товары.ВидДвижения,
		|	Товары.Номенклатура,
		|	Товары.Количество,
		|	Товары.Сумма,
		|	&ПустойКлиент,
		|	Товары.Номенклатура.Артикул,
		|	Товары.Номенклатура.ОсновнойШтрихКод,
		|	Товары.Номенклатура.Производитель,
		|	Товары.Номенклатура.НоменклатурнаяГруппа,
		|	Товары.Номенклатура.Цена,
		|	Товары.Номенклатура.ПроцентСкидки,
		|	Товары.Номенклатура.Наименование,
		|   Товары.СерияНоменклатуры,
		|	Товары.Склад,
		|	2
		|ИЗ
		|	РегистрНакопления.Товары КАК Товары
		|ГДЕ
		|	Товары.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И Товары.ВидДвижения = &ВидДвиженияРасход
		|	И Товары.СписаниеИлиОприходование = ИСТИНА   %%1 %%2 %%3 %%4 ";
		
	КонецЕсли;
	
	Если ВестиУчетПоСкладам
		И НЕ Объект.ОтборПоСкладам.Количество() = 0 Тогда
		
		Запрос.Текст = стрзаменить(Запрос.Текст, "%%1", " И естьnull(продажи.Регистратор.Склад, &ПустойСклад) В(&Склады) ");		
		Запрос.УстановитьПараметр("Склады", СписокСкладов);
	КонецЕсли;
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетПроизводителейНоменклатуры")
		И НЕ Объект.ОтборПоПроизводителям.Количество() = 0 Тогда
		
		Запрос.Текст = стрзаменить(Запрос.Текст, "%%2", " И продажи.Номенклатура.Производитель В(&Производители) ");
		Запрос.УстановитьПараметр("Производители", СписокПроизводителей);
	КонецЕсли;
	
	Если ПараметрыСеанса.ВестиУчетНоменклатурыВРазрезеНоменклатурныхГруппПС
		И НЕ Объект.ОтборПоНоменклатурнымГруппам.Количество() = 0 Тогда
		
		Запрос.Текст = стрзаменить(Запрос.Текст, "%%3", " И продажи.Номенклатура.НоменклатурнаяГруппа В(&НоменклатурныеГруппы) ");
		Запрос.УстановитьПараметр("НоменклатурныеГруппы", СписокНоменклатурныхГрупп);
	КонецЕсли;
	
	Если ВестиУчетРегионов
		И НЕ Объект.ОтборПоРегионам.Количество() = 0 Тогда
		
		Запрос.Текст = стрзаменить(Запрос.Текст, "%%4", " И (естьNull(продажи.Регистратор.КлиентПоставщик.Регион, &ПустойРегион) В (&Регионы) ИЛИ естьNull(продажи.Номенклатура.Производитель.Регион, &ПустойРегион) В (&Регионы) ");
		Запрос.УстановитьПараметр("Регионы", СписокРегионов);
		Запрос.УстановитьПараметр("ПустойРегион", Справочники.Регионы.ПустаяСсылка());
	КонецЕсли;
	
	Запрос.Текст = стрзаменить(Запрос.Текст, "%%1", "");
	Запрос.Текст = стрзаменить(Запрос.Текст, "%%2", "");
	Запрос.Текст = стрзаменить(Запрос.Текст, "%%3", "");
	Запрос.Текст = стрзаменить(Запрос.Текст, "%%4", "");
	
	Запрос.Текст = Запрос.Текст + "	УПОРЯДОЧИТЬ ПО Период ";
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(Объект.ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Объект.ДатаОкончания));
	Запрос.УстановитьПараметр("ПустойКлиент", ПредопределенноеЗначение("Справочник.Клиенты.ПустаяСсылка"));
	Запрос.УстановитьПараметр("ПустойСклад", ПредопределенноеЗначение("Справочник.Склады.ПустаяСсылка"));
	Запрос.УстановитьПараметр("ВидДвиженияРасход", ВидДвиженияНакопления.Расход);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДанных = РезультатЗапроса.Выбрать();
		СчетчикСтрок = 0;
		ОтправитьВФайл(ФайлВыгрузки, СокрЛП(Метаданные.Версия));
		
		Пока ВыборкаДанных.Следующий() Цикл
			СчетчикСтрок = СчетчикСтрок + 1;
			
			Если ВыборкаДанных.ТипРегистра = 1 Тогда
				Если НЕ ВыборкаДанных.Сумма > 0 Тогда // не продажа - возврат
					ОтправитьВФайл(ФайлВыгрузки, "ПРИХОД");
				Иначе
					ОтправитьВФайл(ФайлВыгрузки, "РАСХОД");
				КонецЕсли;
				
			Иначе
				Если НЕ ВыборкаДанных.Сумма > 0 Тогда // дооприх
					ОтправитьВФайл(ФайлВыгрузки, "ОПРИХОД");
				Иначе
					ОтправитьВФайл(ФайлВыгрузки, "СПИСАНИЕ");
				КонецЕсли;
				
			КонецЕсли;
			
			ОтправитьВФайл(ФайлВыгрузки, Формат(ВыборкаДанных.Период, "ДФ=ггггММддЧЧммсс"));
			ОтправитьВФайл(ФайлВыгрузки, ВыборкаДанных.Наименование); 		
			НоменклатураОсновнойШтрихКод = ВыборкаДанных.НоменклатураОсновнойШтрихКод;
			Если НЕ ЗначениеЗаполнено(НоменклатураОсновнойШтрихКод) Тогда
				НоменклатураОсновнойШтрихКод = ОбщийМодульТоварСервер.ПолучитьШтрихКодНоменклатурыСерии(ВыборкаДанных.Номенклатура, ВыборкаДанных.СерияНоменклатуры);
			КонецЕсли;
			ОтправитьВФайл(ФайлВыгрузки, НоменклатураОсновнойШтрихКод);
			ОтправитьВФайл(ФайлВыгрузки, ВыборкаДанных.НоменклатураАртикул);
			ОтправитьВФайл(ФайлВыгрузки, ВыборкаДанных.НоменклатураПроизводитель);
			ОтправитьВФайл(ФайлВыгрузки, ВыборкаДанных.НоменклатураНоменклатурнаяГруппа);
			
			Если СкрытьДанныеОЦенахИСуммеРеализации Тогда
				ОтправитьВФайл(ФайлВыгрузки, "0"); 	
			Иначе
				ОтправитьВФайл(ФайлВыгрузки, Формат(ВыборкаДанных.НоменклатураЦена, "ЧЦ=15; ЧДЦ=0; ЧГ=0")); 	
			КонецЕсли;
			ОтправитьВФайл(ФайлВыгрузки, ВыборкаДанных.НоменклатураПроцентСкидки);
			ОтправитьВФайл(ФайлВыгрузки, ВыборкаДанных.СерияНоменклатуры); 
			ОтправитьВФайл(ФайлВыгрузки, ВыборкаДанных.Склад);
			ОтправитьВФайл(ФайлВыгрузки, ?(ЗначениеЗаполнено(ВыборкаДанных.Клиент), ВыборкаДанных.Клиент, ""));
			
			Если ЗначениеЗаполнено(ВыборкаДанных.Клиент) Тогда
				ОтправитьВФайл(ФайлВыгрузки, ВыборкаДанных.Клиент.ОКПО); 
			Иначе
				ОтправитьВФайл(ФайлВыгрузки, ""); 
			КонецЕсли;
			
			ОтправитьВФайл(ФайлВыгрузки, Формат(ВыборкаДанных.Количество, "ЧЦ=15; ЧДЦ=0; ЧГ=0")); 
			Если СкрытьДанныеОЦенахИСуммеРеализации Тогда
				ОтправитьВФайл(ФайлВыгрузки, "0"); 	
			Иначе
				ОтправитьВФайл(ФайлВыгрузки, Формат(ВыборкаДанных.Сумма, "ЧЦ=15; ЧДЦ=2; ЧГ=0")); 	
			КонецЕсли;     		
			
		КонецЦикла;	
	КонецЕсли;
	
	Попытка 
		ФайлВыгрузки.Закрыть();
		
		ЗаписьZIP = Новый ЗаписьZipФайла(АдресФайла);     
		ЗаписьZIP.Добавить(ИмяВременногоФайла);
		ЗаписьZIP.Записать();
		
		ПодсистемаИЭ.ЗаписатьВЖурналИмпортноЭкспортныхОпераций(АдресФайла, , ВыборкаДанных.Количество(), ИСТИНА, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Выгрузка реализаций, списания за период") + " " + Формат(Объект.ДатаНачала, "ДФ=dd.MM.yyyy") + " - " + Формат(Объект.ДатаОкончания, "ДФ=dd.MM.yyyy"));
		
		ОбщегоНазначения.СообщитьПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Данные выгружены. Всего строк") + ": " + СчетчикСтрок);
		
	Исключение 	
		ТекстОписаниеОшибки = ОписаниеОшибки();
		ОбщегоНазначения.СообщитьПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Произошла ошибка при записи файла") + ": " + ТекстОписаниеОшибки);
	КонецПопытки;
	
КонецПроцедуры

Функция   ВыгрузитьРеквизит(ЗначениеРеквизита, ТипРеквизита, МассивЭлементов = Неопределено);
	
	Отказ = ЛОЖЬ;
	
	Если ТипРеквизита = "Булево" Тогда
		ТекДок.ДобавитьСтроку(Формат(ЗначениеРеквизита, "БЛ=FALSE; БИ=TRUE"));
		
	ИначеЕсли ТипРеквизита = "Строка" Тогда
		ТекДок.ДобавитьСтроку(Стрзаменить(ЗначениеРеквизита, Символы.ПС, "ПЕРЕНОССТРОКИ"));
		
	ИначеЕсли ТипРеквизита = "Число" Тогда
		Если ЗначениеРеквизита = 0 Тогда
			ТекДок.ДобавитьСтроку("0");
		ИначеЕсли ЗначениеРеквизита = 1 Тогда
			ТекДок.ДобавитьСтроку("1");
		Иначе
			ТекДок.ДобавитьСтроку(Формат(ЗначениеРеквизита, "ЧЦ=15; ЧДЦ=4; ЧРД=.; ЧН=; ЧГ=0"));	
		КонецЕсли;
		
	ИначеЕсли ТипРеквизита = "Дата" Тогда
		Если НЕ ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
			ТекДок.ДобавитьСтроку("00010101000000");
		Иначе
			ТекДок.ДобавитьСтроку(Формат(ЗначениеРеквизита, "ДФ=ггггММддЧЧммсс"));
		КонецЕсли;		
		
	ИначеЕсли ВРег(ТипРеквизита) = "NULL" Тогда
		ТекДок.ДобавитьСтроку("NULL");		
		Если ЗначениеРеквизита = Неопределено Тогда
			ТекДок.ДобавитьСтроку("NULL");
		Иначе
			ТекДок.ДобавитьСтроку(ТипЗнч(ЗначениеРеквизита));		
		КонецЕсли;		
		ТекДок.ДобавитьСтроку(ЗначениеРеквизита);
		
	ИначеЕсли НЕ Найти(ТипРеквизита, "СправочникСсылка") = 0 Тогда
		ВыгрузитьЭлементСправочника(ЗначениеРеквизита, ТипРеквизита, МассивЭлементов);
		
	ИначеЕсли НЕ Найти(ТипРеквизита, "ДокументСсылка") = 0 Тогда
		ВыгрузитьДокумент(ЗначениеРеквизита, ТипРеквизита, МассивЭлементов);
		
	ИначеЕсли НЕ Найти(ТипРеквизита, "ПеречислениеСсылка") = 0 Тогда
		
		Если НЕ ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
			ТекДок.ДобавитьСтроку("ПУСТО");
		Иначе
			ТекДок.ДобавитьСтроку(СокрЛП(Перечисления[стрзаменить(ТипРеквизита, "ПеречислениеСсылка.", "")].Индекс(ЗначениеРеквизита)));
		КонецЕсли;		
		
	Иначе
		ТекДок.ДобавитьСтроку(Стрзаменить(ЗначениеРеквизита, Символы.ПС, "ПЕРЕНОССТРОКИ"));
		
	КонецЕсли;
	
	Возврат Отказ;
	
КонецФункции

&НаСервере
Процедура ВыгрузитьЦены(Номенклатура)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ЦеныСрезПоследних.ВидЦен, ЦеныСрезПоследних.Цена, ВЫРАЗИТЬ(ЦеныСрезПоследних.Комментарий КАК СТРОКА(1000)) КАК Комментарий
	|ИЗ РегистрСведений.Цены.СрезПоследних(&ДатаОкончания, Номенклатура = &Номенклатура) КАК ЦеныСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Объект.ДатаОкончания));
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДанных= РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДанных.Следующий() Цикл
			
			ТекДок.ДобавитьСтроку("ЦЕНЫ");
			РеквизитЭлементаТип = "СправочникСсылка.Номенклатура";
			ВыгрузитьРеквизит(Номенклатура, РеквизитЭлементаТип);
			
			ЗначениеТут = ВыборкаДанных.ВидЦен;
			РеквизитЭлементаТип = "СправочникСсылка.ВидыЦен";
			ВыгрузитьРеквизит(ЗначениеТут, РеквизитЭлементаТип);
			
			ЗначениеТут = ВыборкаДанных.Цена;		
			РеквизитЭлементаТип = "Число";
			ВыгрузитьРеквизит(ЗначениеТут, РеквизитЭлементаТип);
			
			ЗначениеТут = ВыборкаДанных.Комментарий;		
			РеквизитЭлементаТип = "Строка";
			ВыгрузитьРеквизит(ЗначениеТут, РеквизитЭлементаТип);
			
		КонецЦикла;		
	КонецЕсли;
	
КонецПроцедуры

Функция   ВыгрузитьЭлементСправочника(Знач Ссылка, Знач ТипСправочника, МассивЭлементов);
	
	Отказ = ЛОЖЬ;
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		ТекДок.ДобавитьСтроку("ПУСТО");
		
	ИначеЕсли НЕ ЧтоВыгружено.НайтиПоЗначению(ссылка) = Неопределено Тогда
		ТипСправочника = СтрЗаменить(ТипСправочника, "СправочникСсылка.", "");
		ТекДок.ДобавитьСтроку(ТипСправочника);			
		
		ТекДок.ДобавитьСтроку("БЫЛ");
		
		ТекДок.ДобавитьСтроку(Ссылка.Код);
		Если ОбщийМодульПовтор.СпецСправочник(ТипСправочника) Тогда
			ТекДок.ДобавитьСтроку(СпецКод(ТипСправочника, Ссылка));
		КонецЕсли;
		ТекДок.ДобавитьСтроку(Ссылка.Наименование);
		
	Иначе
		Пропустить	= ПроверитьЭлемент(Ссылка, ТипСправочника);
		
		Если НЕ Пропустить Тогда  		
			ЧтоВыгружено.Добавить(ссылка);
			
			ТипСправочника = СтрЗаменить(ТипСправочника, "СправочникСсылка.", "");
			ТекДок.ДобавитьСтроку(ТипСправочника);			
			
			ТекДок.ДобавитьСтроку("НОВ");
			ТекДок.ДобавитьСтроку(Ссылка.Код);
			Если ОбщийМодульПовтор.СпецСправочник(ТипСправочника) Тогда
				ТекДок.ДобавитьСтроку(СпецКод(ТипСправочника, Ссылка));
			КонецЕсли;
			ТекДок.ДобавитьСтроку(Ссылка.Наименование);
			
			МетаДок 	= метаданные.Справочники[ТипСправочника];
			РеквизитыЭлемента 		= МетаДок.Реквизиты;
			ТабЧасти 	= МетаДок.ТабличныеЧасти;
			
			Для Каждого РеквизитЭлемента Из РеквизитыЭлемента Цикл
				
				РеквизитЭлементаТип = ОбщийМодульТекстСервер.СтрокаТипаРеквизита(Ссылка, РеквизитЭлемента.имя);
				Попытка
					ЗначениеРеквизита = Ссылка[РеквизитЭлемента.Имя];
					Отказ = ВыгрузитьРеквизит(ЗначениеРеквизита, РеквизитЭлементаТип);
					Если отказ Тогда	
						Прервать;
					КонецЕсли;
				Исключение // напр только для групп
					
				КонецПопытки;
				
			КонецЦикла;
			
			Если НЕ Отказ Тогда
				Для Каждого ТабЧасть Из ТабЧасти Цикл
					
					РеквыТабЧасти = ТабЧасть.Реквизиты;
					
					ТекДок.ДобавитьСтроку(формат(Ссылка[ТабЧасть.Имя].Количество(), "ЧН=; ЧГ=0"));
					
					Для Каждого СтрокаДок Из Ссылка[ТабЧасть.Имя] Цикл
						
						Для Каждого РеквизитЭлемента Из РеквыТабЧасти Цикл
							
							РеквизитЭлементаТип = ОбщийМодульТекстСервер.СтрокаТипаРеквизита(СтрокаДок, РеквизитЭлемента.имя);
							
							Отказ = ВыгрузитьРеквизит(СтрокаДок[РеквизитЭлемента.Имя], РеквизитЭлементаТип);
							Если отказ Тогда	
								Прервать;
							КонецЕсли;	
							
						КонецЦикла;    				
					КонецЦикла;  			
				КонецЦикла;	
			КонецЕсли;  		
			
		Иначе
			ТекДок.ДобавитьСтроку("ПРОП");
			
		КонецЕсли;	
	КонецЕсли;
	
	Возврат Отказ;
	
КонецФункции

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	
	Объект.Период.ДатаНачала = Объект.ДатаНачала;
	Если Объект.ДатаОкончания < Объект.ДатаНачала Тогда
		Объект.ДатаОкончания 		= Объект.ДатаНачала;
		Объект.Период.ДатаОкончания = Объект.ДатаОкончания;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	
	Объект.Период.ДатаОкончания = Объект.ДатаОкончания;
	Если Объект.ДатаОкончания < Объект.ДатаНачала Тогда
		Объект.ДатаНачала 			= Объект.ДатаОкончания;
		Объект.Период.ДатаНачала 	= Объект.ДатаНачала;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеОбОстатках(Команда)
	
	АдресФайла = ПолучитьОтносительныйАдресНаСервере();	
	
	ДиалогФильтр	 = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Файл архив") + " (*.zip)|*.zip";
	ДиалогРасширение = "zip";
	ДиалогДляВыбораФайла 	 = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогДляВыбораФайла.Заголовок				= ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Выберите файл архива для импорта(загрузки)") + ": ";
	ДиалогДляВыбораФайла.ПолноеИмяФайла			= АдресФайла;
	ДиалогДляВыбораФайла.Фильтр					= ДиалогФильтр;
	ДиалогДляВыбораФайла.Расширение				= ДиалогРасширение;
	ДиалогДляВыбораФайла.МножественныйВыбор		= ЛОЖЬ;
	ДиалогДляВыбораФайла.ПредварительныйПросмотр	= ЛОЖЬ;
	ДиалогДляВыбораФайла.ИндексФильтра			= 0;
	ДиалогДляВыбораФайла.ПроверятьСуществованиеФайла	=	ИСТИНА;
	
	Если ДиалогДляВыбораФайла.Выбрать() Тогда
		
		АдресФайла = ДиалогДляВыбораФайла.ПолноеИмяФайла;
		Состояние(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Идет Загрузка остатков.."), , ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ждите.."));
		ЗагрузитьДанныеОбОстаткахНаСервере(АдресФайла);
		ОбщийМодульСервер.ДобавитьСобытиеЖурналаНаСервере(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Загрузил остатки Из файла") + ": " + АдресФайла, 2);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеОбОстаткахНаСервере(АдресФайла)
	
	ПараметрыСеанса.НеВыводитьСообщений = ИСТИНА;
	
	Каталог 	= КаталогВременныхФайлов();
	
	ИмяФайлаTxt = "/data_now_out.tmp";
	ИмяВременногоФайла = Каталог + ИмяФайлаTxt;
	Попытка 
		УдалитьФайлы(ИмяВременногоФайла);
	Исключение 	
	КонецПопытки;
	
	ФайлАрхива = Новый ЧтениеZIPФайла(АдресФайла); 
	ФайлАрхива.ИзвлечьВсе(Каталог, РежимВосстановленияПутейФайловZIP.Восстанавливать); 
	ФайлАрхива.Закрыть();     
	
	Объект.СозданныеДокументы.Очистить();
	ПодготовитьСпискиОтбора();
	Константы.ПодсистемаИЭИмпортЭкспортОтносительныйАдресФайлов.Установить(АдресФайла);
	
	ТекДок.Очистить();
	ТекДок.Прочитать(Каталог + ИмяФайлаTxt);
	
	КоличествоСтрок = ТекДок.КоличествоСтрок();
	СчетчикСтрок = 1;
	ВерсияВФайле = СтрЗаменить(СокрЛП(ТекДок.ПолучитьСтроку(СчетчикСтрок)), "F", "");	
	СчетчикСтрок = СчетчикСтрок + 1;
	
	ВерсияЗдесь  = СтрЗаменить(СокрЛП(Метаданные.Версия), "F", "");
	
	Если НЕ ВерсияВФайле = ВерсияЗдесь Тогда
		ОбщегоНазначения.СообщитьПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Версия файла") + ": " + ВерсияВФайле + " " + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("не совпадает с версией конфигурации") + ": " + ВерсияЗдесь);
		Возврат;
	КонецЕсли;
	
	ДокКорр = документы.КорректировкиИРегистрацияОстатков.СоздатьДокумент();
	ДокКорр.Дата = Дата(ТекДок.ПолучитьСтроку(СчетчикСтрок));	
	ДокКорр.Комментарий = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("По данным Из файла") + ": " + АдресФайла;
	СчетчикСтрок = СчетчикСтрок + 1;
	
	ОсновнаяВалюта = Справочники.Валюты.ОсновнаяВалюта ;
	
	пока СчетчикСтрок < КоличествоСтрок Цикл
		
		пропустить = ЛОЖЬ;
		
		ТипТаблицы = ТекДок.ПолучитьСтроку(СчетчикСтрок);
		СчетчикСтрок = СчетчикСтрок + 1;
		
		СтрокаТаблицы = ДокКорр[ТипТаблицы].Добавить();
		Если ТипТаблицы = "ДЕНЬГИ" Тогда
			ЗагрузитьРеквизит(СтрокаТаблицы.Валюта, "СправочникСсылка.Валюты", СчетчикСтрок, Пропустить, ТипТаблицы); 
			ЗагрузитьРеквизит(СтрокаТаблицы.ФормаОплаты, "ПеречислениеСсылка.ФормыОплаты", СчетчикСтрок, Пропустить, ТипТаблицы); 
			ЗагрузитьРеквизит(СтрокаТаблицы.ХранилищеДенег, "СправочникСсылка.ХранилищаДенег", СчетчикСтрок, Пропустить, ТипТаблицы);
			СчетчикСтрок = СчетчикСтрок + 1;// пропускаем просто сумму
			ЗагрузитьРеквизит(СтрокаТаблицы.ОстатокДенег, "Число", СчетчикСтрок, Пропустить, ТипТаблицы); 
			
		ИначеЕсли ТипТаблицы = "РАСЧЕТЫ" Тогда
			ЗагрузитьРеквизит(СтрокаТаблицы.Клиент, "СправочникСсылка.Клиенты", СчетчикСтрок, Пропустить, ТипТаблицы); 
			ЗагрузитьРеквизит(СтрокаТаблицы.Сумма, "Число", СчетчикСтрок, Пропустить, ТипТаблицы); 
			
		ИначеЕсли ТипТаблицы = "РасчетыСПОСТАВЩИКАМИ" Тогда
			ЗагрузитьРеквизит(СтрокаТаблицы.Поставщик, "СправочникСсылка.Поставщики", СчетчикСтрок, Пропустить, ТипТаблицы); 
			ЗагрузитьРеквизит(СтрокаТаблицы.Сумма, "Число", СчетчикСтрок, Пропустить, ТипТаблицы); 
			
		ИначеЕсли ТипТаблицы = "ЗАРПЛАТА" Тогда
			
			ЗагрузитьРеквизит(СтрокаТаблицы.Сотрудник, "СправочникСсылка.Сотрудники", СчетчикСтрок, Пропустить, ТипТаблицы); 
			ЗагрузитьРеквизит(СтрокаТаблицы.ВидНачисления, "ПеречислениеСсылка.ВидыНачислений", СчетчикСтрок, Пропустить, ТипТаблицы); 
			ЗагрузитьРеквизит(СтрокаТаблицы.Сумма, "Число", СчетчикСтрок, Пропустить, ТипТаблицы); 
			СчетчикСтрок = СчетчикСтрок + 1;// пропускаем сумму в валюте
			СтрокаТаблицы.Валюта = ОсновнаяВалюта;
			
		ИначеЕсли ТипТаблицы = "ТОВАРЫ" Тогда
			
			ЗагрузитьРеквизит(СтрокаТаблицы.Номенклатура, "СправочникСсылка.Номенклатура", СчетчикСтрок, Пропустить, ТипТаблицы); 
			ЗагрузитьРеквизит(СтрокаТаблицы.СерияНоменклатуры, "СправочникСсылка.СерииНоменклатуры", СчетчикСтрок, Пропустить, ТипТаблицы); 
			ЗагрузитьРеквизит(СтрокаТаблицы.Склад, "СправочникСсылка.Склады", СчетчикСтрок, Пропустить, ТипТаблицы); 
			ЗагрузитьРеквизит(СтрокаТаблицы.Количество, "Число", СчетчикСтрок, Пропустить, ТипТаблицы); 
			ЗагрузитьРеквизит(СтрокаТаблицы.Сумма, "Число", СчетчикСтрок, Пропустить, ТипТаблицы); 
			Если НЕ СтрокаТаблицы.Количество = 0 Тогда
				СтрокаТаблицы.Цена = СтрокаТаблицы.Сумма / СтрокаТаблицы.Количество;
			КонецЕсли;
			
		ИначеЕсли ТипТаблицы = "ЦЕНЫ" Тогда
			ЗагрузитьРеквизит(СтрокаТаблицы.Номенклатура, "СправочникСсылка.Номенклатура", СчетчикСтрок, Пропустить, ТипТаблицы); 
			ЗагрузитьРеквизит(СтрокаТаблицы.ВидЦен, "СправочникСсылка.ВидыЦен", СчетчикСтрок, Пропустить, ТипТаблицы); 
			ЗагрузитьРеквизит(СтрокаТаблицы.Цена, "Число", СчетчикСтрок, Пропустить, ТипТаблицы); 
			ЗагрузитьРеквизит(СтрокаТаблицы.ОСтроке, "Строка", СчетчикСтрок, Пропустить, ТипТаблицы); 
			
		КонецЕсли;	
		
	КонецЦикла;
	
	ПараметрыСеанса.НеВыводитьСообщений = ЛОЖЬ;
	
	Попытка 
		ДокКорр.Записать(РежимЗаписиДокумента.Проведение);
		СозданныеДокументыСтрока 			= Объект.СозданныеДокументы.Добавить();
		СозданныеДокументыСтрока.Документ 	= ДокКорр.Ссылка;
		
	Исключение 	
		ТекстОписаниеОшибки = ОписаниеОшибки();
		
		Попытка 
			ДокКорр.Записать(РежимЗаписиДокумента.Запись);
			СозданныеДокументыСтрока 			= Объект.СозданныеДокументы.Добавить();
			СозданныеДокументыСтрока.Документ 	= ДокКорр.Ссылка;			
		Исключение 				
		КонецПопытки;
		
		ОбщегоНазначения.СообщитьПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Произошла ошибка при проведении документа") + ": " + ТекстОписаниеОшибки);
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеРуководителя(Команда)
	
	АдресФайла = ПолучитьОтносительныйАдресНаСервере();	
	
	ДиалогФильтр	 = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Файл архива") + " (*.zip)|*.zip";
	ДиалогРасширение = "zip";
	ДиалогДляВыбораФайла 	 = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогДляВыбораФайла.Заголовок				=	ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Выберите файл архива для импорта(загрузки)") + ": ";
	ДиалогДляВыбораФайла.ПолноеИмяФайла			=	АдресФайла; // АДРЕС
	ДиалогДляВыбораФайла.Фильтр					=	ДиалогФильтр;
	ДиалогДляВыбораФайла.Расширение				=	ДиалогРасширение;
	ДиалогДляВыбораФайла.МножественныйВыбор		=	ЛОЖЬ;
	ДиалогДляВыбораФайла.ПредварительныйПросмотр	=	ЛОЖЬ;
	ДиалогДляВыбораФайла.ИндексФильтра			=	0;
	ДиалогДляВыбораФайла.ПроверятьСуществованиеФайла	=	ИСТИНА;
	
	Если ДиалогДляВыбораФайла.Выбрать() Тогда
		
		АдресФайла = ДиалогДляВыбораФайла.ПолноеИмяФайла;
		Состояние(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Идет Загрузка данных.."), , ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ждите.."));
		ЗагрузитьДанныеРуководителяНаСервере(АдресФайла);
		ОбщийМодульСервер.ДобавитьСобытиеЖурналаНаСервере(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Загрузил данные Из файла") + ": " + АдресФайла, 2);
		
	КонецЕсли; // когда файл АдресФайла выбран	
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеРуководителяНаСервере(АдресФайла)
	
	Попытка 
		УстановитьМонопольныйРежим(ИСТИНА);
	Исключение 	
	КонецПопытки;
	
	Если НеВыводитьСообщенияИПредупрежденияПриЗагрузке Тогда
		СостояниеПараметраСеансаНеВыводитьСообщений = ПараметрыСеанса.НеВыводитьСообщений;
		ПараметрыСеанса.НеВыводитьСообщений = ИСТИНА;
	КонецЕсли;
	
	Каталог = КаталогВременныхФайлов();
	
	ИмяВременногоФайла = Каталог + "/data_out.tmp";
	Попытка 
		УдалитьФайлы(ИмяВременногоФайла);
	Исключение 	
	КонецПопытки;
	
	ФайлАрхива = Новый ЧтениеZIPФайла(АдресФайла); 
	ФайлАрхива.ИзвлечьВсе(Каталог, РежимВосстановленияПутейФайловZIP.Восстанавливать); 
	ФайлАрхива.Закрыть();     
	
	Объект.СозданныеДокументы.Очистить();
	ПодготовитьСпискиОтбора();
	Константы.ПодсистемаИЭИмпортЭкспортОтносительныйАдресФайлов.Установить(АдресФайла);
	
	ТекДок.Очистить();
	ТекДок.Прочитать(Каталог + "/data_out.tmp");
	
	КоличествоСтрок = ТекДок.КоличествоСтрок();
	СчетчикСтрок = 1;
	ВерсияВФайле = СтрЗаменить(СокрЛП(ТекДок.ПолучитьСтроку(СчетчикСтрок)), "F", "");	
	СчетчикСтрок = СчетчикСтрок + 1;	
	ВерсияЗдесь  = СтрЗаменить(СокрЛП(Метаданные.Версия), "F", "");
	
	Если НЕ ВерсияВФайле = ВерсияЗдесь Тогда
		ОбщегоНазначения.СообщитьПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Версия файла") + ": " + ВерсияВФайле + " " + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("не совпадает с версией конфигурации") + ": " + ВерсияЗдесь);
		
		Возврат;
	КонецЕсли;
	
	Пока СчетчикСтрок < КоличествоСтрок Цикл		
		Пропустить = ЛОЖЬ;
		
		ТипДокумента = ТекДок.ПолучитьСтроку(СчетчикСтрок);
		СчетчикСтрок = СчетчикСтрок + 1;
		
		Отказ = ЗагрузитьДокумент(, ТипДокумента, СчетчикСтрок, Пропустить);
		Если Отказ Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если НеВыводитьСообщенияИПредупрежденияПриЗагрузке Тогда
		ПараметрыСеанса.НеВыводитьСообщений = СостояниеПараметраСеансаНеВыводитьСообщений;
	КонецЕсли;
	
	Попытка 
		УстановитьМонопольныйРежим(ЛОЖЬ);
	Исключение 	
	КонецПопытки;
	
КонецПроцедуры

Функция   ЗагрузитьДокумент(ВозвращатьЗначение = ЛОЖЬ, Знач ТипДокумента, сч, пропустить, ОпределенныйЭлемент =  Неопределено)
	
	Если ВозвращатьЗначение Тогда
		ЗначениеТип = ТекДок.ПолучитьСтроку(сч);
		сч = сч + 1;
		
	Иначе
		ЗначениеТип = ТипДокумента;
	КонецЕсли;      	
	
	Отказ = ЛОЖЬ;
	Если НЕ ВРег(ЗначениеТип) = "NULL" Тогда
		
		Попытка
			НомерДокумента = ТекДок.ПолучитьСтроку(сч);
			сч = сч + 1;
			
			СтрокаПроводить = ТекДок.ПолучитьСтроку(сч);
			Проводить = СтрокаПроводить = "Проведен";
			сч = сч + 1;
			
			ДатаДокумента = дата(ТекДок.ПолучитьСтроку(сч));
			сч = сч + 1;
			
			Если НЕ ОпределенныйЭлемент = Неопределено
				И НЕ ОпределенныйЭлемент = ЛОЖЬ Тогда
				
				Пропустить = ЛОЖЬ;
				ОбъектД = ОпределенныйЭлемент.ПолучитьОбъект();
				
			Иначе
				
				Если Объект.ОграничитьПериодЗагрузкиДокументов
					И ДатаДокумента >= НачалоДня(Объект.ДатаНачала)
					И ДатаДокумента <= КонецДня(Объект.ДатаОкончания) Тогда
					
					Пропустить = ИСТИНА;
					ОбъектД = документы[ТипДокумента].СоздатьДокумент();
					
				Иначе
					Запрос = Новый Запрос;
					Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 Д.Ссылка Из Документ." + ТипДокумента + " КАК Д ГДЕ Д.Номер = &Номер "; // И Д.Дата = &Дата";
					
					Запрос.УстановитьПараметр("Номер", НомерДокумента);
					
					Пропустить = ЛОЖЬ;
					
					РезультатЗапроса = Запрос.Выполнить();
					Если РезультатЗапроса.Пустой() Тогда
						ОбъектД = документы[ТипДокумента].СоздатьДокумент();
						ОбъектД.Номер 	= НомерДокумента;
						ОбъектД.Дата 	= ДатаДокумента;
						
					ИначеЕсли Объект.ЗаменитьВсеДанныеВСуществующихДокументах Тогда
						ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
						
						ВыборкаДетальныеЗаписи.Следующий();
						ОбъектД = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
						ОбъектД.Дата 	= ДатаДокумента;
						
					Иначе
						пропустить = ИСТИНА;
						ОбъектД = документы[ТипДокумента].СоздатьДокумент();
					КонецЕсли;	
				КонецЕсли;
			КонецЕсли;
			
			МетаДок  = метаданные.Документы[ТипДокумента];								
			РеквизитыЭлемента 	 = МетаДок.Реквизиты;
			ТабЧасти = МетаДок.ТабличныеЧасти;
			
			Для Каждого РеквизитЭлемента Из РеквизитыЭлемента Цикл
				
				РеквизитЭлементаТип = ОбщийМодульТекстСервер.СтрокаТипаРеквизита(ОбъектД.ссылка, РеквизитЭлемента.имя);
				
				Отказ = ЗагрузитьРеквизит(ОбъектД[РеквизитЭлемента.Имя], РеквизитЭлементаТип, сч, пропустить, ЗначениеТип);
				Если отказ Тогда	
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
			Если НЕ Отказ Тогда
				Для Каждого ТабЧасть Из ТабЧасти Цикл
					
					РеквыТабЧасти = ТабЧасть.Реквизиты;
					
					ЧислоСтрок =  Число(ТекДок.ПолучитьСтроку(сч));
					сч = сч + 1;
					
					Для СчетчикСтрок = 1 по ЧислоСтрок Цикл   						
						СтрокаДок = ОбъектД[ТабЧасть.Имя].Добавить();
						
						Для Каждого РеквизитЭлемента Из РеквыТабЧасти Цикл
							
							РеквизитЭлементаТип = ОбщийМодульТекстСервер.СтрокаТипаРеквизита(СтрокаДок, РеквизитЭлемента.имя);
							
							Отказ = ЗагрузитьРеквизит(СтрокаДок[РеквизитЭлемента.Имя], РеквизитЭлементаТип, сч, пропустить, ЗначениеТип);
							Если отказ Тогда	
								Прервать;
							КонецЕсли;	
							
						КонецЦикла;    				
					КонецЦикла;  			
				КонецЦикла;	
			КонецЕсли; 
			
			Если НЕ отказ
				И НЕ пропустить Тогда
				
				попытка
					ОбъектД.Записать(?(Проводить, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
				исключение
					ТекстОписаниеОшибки = ОписаниеОшибки();
					попытка
						ОбъектД.Записать(РежимЗаписиДокумента.Запись);	
						
						ОбщегоНазначения.СообщитьПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Провести документ не удалось") + ": " + ОбъектД + " " + ТекстОписаниеОшибки);
						
					Исключение
						ТекстОписаниеОшибки = ОписаниеОшибки();
						ОбщегоНазначения.СообщитьПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Записать документ не удалось") + ": " + ОбъектД + " " + ТекстОписаниеОшибки);
						
						Пропустить = ИСТИНА;
					КонецПопытки;
				КонецПопытки;
				
				Если НЕ пропустить Тогда
					СтрДок = Объект.СозданныеДокументы.Добавить();
					СтрДок.Документ = ОбъектД.Ссылка;
					
					Если ВозвращатьЗначение Тогда
						Возврат ОбъектД.ссылка;
					КонецЕсли;
				КонецЕсли;          	
			КонецЕсли;
			
		Исключение
			ТекстОписаниеОшибки = ОписаниеОшибки();
			ОбщегоНазначения.СообщитьПользователю("" + сч + " " + ТекстОписаниеОшибки);
			
			Отказ = ИСТИНА;
		КонецПопытки;
		
	КонецЕсли;	
	
	Возврат Отказ;
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьКартотекуНоменклатуры(Команда)
	
	АдресФайла = ПолучитьОтносительныйАдресНаСервере();	
	
	ДиалогФильтр	 = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Файл архив") + " (*.zip)|*.zip";
	ДиалогРасширение = "zip";
	ДиалогДляВыбораФайла 	 = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогДляВыбораФайла.Заголовок				= ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Выберите файл архива для импорта(загрузки)") + ": ";
	ДиалогДляВыбораФайла.ПолноеИмяФайла			= АдресФайла;
	ДиалогДляВыбораФайла.Фильтр					= ДиалогФильтр;
	ДиалогДляВыбораФайла.Расширение				= ДиалогРасширение;
	ДиалогДляВыбораФайла.МножественныйВыбор		= ЛОЖЬ;
	ДиалогДляВыбораФайла.ПредварительныйПросмотр	= ЛОЖЬ;
	ДиалогДляВыбораФайла.ИндексФильтра			= 0;
	ДиалогДляВыбораФайла.ПроверятьСуществованиеФайла	=	ИСТИНА;
	
	Если ДиалогДляВыбораФайла.Выбрать() Тогда
		
		АдресФайла = ДиалогДляВыбораФайла.ПолноеИмяФайла;
		Состояние(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Идет Загрузка картотеки номенклатуры.."), , ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ждите.."));
		ЗагрузитьКартотекуНоменклатурыНаСервере(АдресФайла);
		ОбщийМодульСервер.ДобавитьСобытиеЖурналаНаСервере(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Загрузил картотеку номенклатуры Из файла") + ": " + АдресФайла, 2);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьКартотекуНоменклатурыНаСервере(Знач АдресФайла)
	
	ПараметрыСеанса.НеВыводитьСообщений = ИСТИНА;
	
	Каталог 	= КаталогВременныхФайлов();
	
	ИмяФайлаTxt = "/data_nom_out.tmp";
	ИмяВременногоФайла = Каталог + ИмяФайлаTxt;
	Попытка 
		УдалитьФайлы(ИмяВременногоФайла);
	Исключение 	
	КонецПопытки;
	
	ФайлАрхива = Новый ЧтениеZIPФайла(АдресФайла); 
	ФайлАрхива.ИзвлечьВсе(Каталог, РежимВосстановленияПутейФайловZIP.Восстанавливать); 
	ФайлАрхива.Закрыть();     
	
	Объект.СозданныеДокументы.Очистить();
	ПодготовитьСпискиОтбора();
	Константы.ПодсистемаИЭИмпортЭкспортОтносительныйАдресФайлов.Установить(АдресФайла);
	
	ТекДок.Очистить();
	ТекДок.Прочитать(Каталог + ИмяФайлаTxt);
	
	КоличествоСтрок = ТекДок.КоличествоСтрок();
	СчетчикСтрок = 1;
	ВерсияВФайле = СтрЗаменить(СокрЛП(ТекДок.ПолучитьСтроку(СчетчикСтрок)), "F", "");	
	СчетчикСтрок = СчетчикСтрок + 1;
	
	ВерсияЗдесь  = СтрЗаменить(СокрЛП(Метаданные.Версия), "F", "");
	
	Если НЕ ВерсияВФайле = ВерсияЗдесь Тогда
		ОбщегоНазначения.СообщитьПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Версия файла") + ": " + ВерсияВФайле + " " + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("не совпадает с версией конфигурации") + ": " + ВерсияЗдесь);
		
		Возврат;
	КонецЕсли;
	
	ДокКорр = документы.КорректировкиИРегистрацияОстатков.СоздатьДокумент();
	ДокКорр.Дата = Дата(ТекДок.ПолучитьСтроку(СчетчикСтрок));	
	ДокКорр.Комментарий = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("По данным Из файла") + ": " + АдресФайла;
	СчетчикСтрок = СчетчикСтрок + 1;
	
	ОсновнаяВалюта = ПредопределенноеЗначение("Справочник.Валюты.ОсновнаяВалюта");
	
	ТипТаблицы = "Цены";
	СерияНоменклатурыПустая = Справочники.СерииНоменклатуры.СоздатьЭлемент();
	ТипШтрихКода = ПланыВидовХарактеристик.ТипыШтрихКодов.CODE128;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ШтрихКоды.Номенклатура,
	|	ШтрихКоды.СерияНоменклатуры,
	|	ШтрихКоды.ШтрихКод
	|ИЗ РегистрСведений.ШтрихКоды КАК ШтрихКоды";
	
	ТаблицаШК = Запрос.Выполнить().Выгрузить();
	
	пока СчетчикСтрок < КоличествоСтрок Цикл
		
		пропустить = ЛОЖЬ;
		
		СтрокаТаблицы = ДокКорр.Цены.Добавить();
		
		ШтрихКод = "";
		ЗагрузитьРеквизит(ШтрихКод, "Строка", СчетчикСтрок, Пропустить, ТипТаблицы); 
		
		СтрокаТакая = ТаблицаШК.Найти(ШтрихКод, "ШтрихКод");
		Если СтрокаТакая = Неопределено Тогда
			ЗагрузитьРеквизит(СтрокаТаблицы.Номенклатура, "СправочникСсылка.Номенклатура", СчетчикСтрок, Пропустить, ТипТаблицы); 
			ЗагрузитьРеквизит(СерияНоменклатурыПустая, "СправочникСсылка.СерииНоменклатуры", СчетчикСтрок, Пропустить, ТипТаблицы); 
			
			Если ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
				
				ШК = РегистрыСведений.ШтрихКоды.СоздатьМенеджерЗаписи();
				ШК.Активность   = ИСТИНА;
				ШК.Номенклатура = СтрокаТаблицы.Номенклатура;
				ШК.ТипШтрихКода = ТипШтрихКода;
				ШК.ШтрихКод 	= ШтрихКод;
				ШК.СерияНоменклатуры = СерияНоменклатурыПустая;
				
				Попытка 
					ШК.Записать(ИСТИНА);
				Исключение 
				КонецПопытки;
			КонецЕсли;
			
		Иначе
			ЗагрузитьРеквизит(СтрокаТаблицы.Номенклатура, "СправочникСсылка.Номенклатура", СчетчикСтрок, Пропустить, ТипТаблицы, СтрокаТакая.Номенклатура); 			
			ЗагрузитьРеквизит(СерияНоменклатурыПустая, "СправочникСсылка.СерииНоменклатуры", СчетчикСтрок, Пропустить, ТипТаблицы, СтрокаТакая.СерияНоменклатуры); 
		КонецЕсли;			
		
		ЗагрузитьРеквизит(СтрокаТаблицы.Цена, "Число", СчетчикСтрок, Пропустить, ТипТаблицы); 
	КонецЦикла;
	
	ПараметрыСеанса.НеВыводитьСообщений = ЛОЖЬ;
	
	Попытка 
		ДокКорр.Записать(РежимЗаписиДокумента.Проведение);
		СозданныеДокументыСтрока 			= Объект.СозданныеДокументы.Добавить();
		СозданныеДокументыСтрока.Документ 	= ДокКорр.Ссылка;
		
	Исключение 	
		ТекстОписаниеОшибки = ОписаниеОшибки();
		ОбщегоНазначения.СообщитьПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Произошла ошибка при проведении документа") + ": " + ТекстОписаниеОшибки);
		
		Попытка 
			ДокКорр.Записать(РежимЗаписиДокумента.Запись);
			СозданныеДокументыСтрока 			= Объект.СозданныеДокументы.Добавить();
			СозданныеДокументыСтрока.Документ 	= ДокКорр.Ссылка;
			
		Исключение 	
		КонецПопытки;
		
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройкиПрограммы(Команда)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗагрузитьНастройкиПрограммыЗавершение", ЭтаФорма), ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Вы готовы заменить ВСЕ настройки программы на данные Из файла?"), РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройкиПрограммыЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		АдресФайла = ПолучитьОтносительныйАдресНаСервере();	
		
		ДиалогФильтр	 = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Файл настроек") + " (*.ini)|*.ini";
		ДиалогРасширение = "ini";
		ДиалогДляВыбораФайла 	 = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		ДиалогДляВыбораФайла.Заголовок				=	ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Выберите файл настроек для импорта(загрузки)") + ": ";
		ДиалогДляВыбораФайла.ПолноеИмяФайла			=	АдресФайла; 
		ДиалогДляВыбораФайла.Фильтр					=	ДиалогФильтр;
		ДиалогДляВыбораФайла.Расширение				=	ДиалогРасширение;
		ДиалогДляВыбораФайла.МножественныйВыбор		=	ЛОЖЬ;
		ДиалогДляВыбораФайла.ПредварительныйПросмотр	=	ЛОЖЬ;
		ДиалогДляВыбораФайла.ИндексФильтра			=	0;
		ДиалогДляВыбораФайла.ПроверятьСуществованиеФайла	=	ИСТИНА;
		
		Если ДиалогДляВыбораФайла.Выбрать() Тогда
			
			АдресФайла = ДиалогДляВыбораФайла.ПолноеИмяФайла;
			Состояние(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Идет Загрузка настроек программы.."), , ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ждите.."));
			ЗагрузитьНастройкиПрограммыНаСервере(АдресФайла);
			ОбщийМодульСервер.ДобавитьСобытиеЖурналаНаСервере(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Загрузил данные Из файла") + ": " + АдресФайла, 2);
			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНастройкиПрограммыНаСервере(Знач АдресФайла)
	
	Попытка 
		// /УстановитьМонопольныйРежим(ИСТИНА);
	Исключение 	
	КонецПопытки;
	
	ТекДок.Очистить();
	Попытка
		ТекДок.Прочитать(АдресФайла);
		СчетчикСтрок = 1;
		
		ВерсияВФайле = СтрЗаменить(СокрЛП(ТекДок.ПолучитьСтроку(СчетчикСтрок)), "F", "");	
		СчетчикСтрок = СчетчикСтрок + 1;
		
		ВерсияЗдесь  = СтрЗаменить(СокрЛП(Метаданные.Версия), "F", "");
		Если НЕ ВерсияВФайле = ВерсияЗдесь Тогда
			ОбщегоНазначения.СообщитьПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Версия файла") + ": " + ВерсияВФайле + " " + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("не совпадает с версией конфигурации") + ": " + ВерсияЗдесь);
			
			Возврат;
		КонецЕсли;
		
		МассиваКонстант = Новый Массив;
		Для Каждого Константа Из метаданные.Константы Цикл
			МассиваКонстант.Добавить(Константа.Имя);
		КонецЦикла;
		
		Для Каждого КонстантаИмя Из МассиваКонстант Цикл
			
			ТипТут = ТипЗнч(Константы[КонстантаИмя].Получить());
			
			Если ТипТут = тип("Строка") Тогда
				РеквизитЭлементаТип = "Строка";	
				
			ИначеЕсли ТипТут = тип("Булево") Тогда
				РеквизитЭлементаТип = "Булево";	
				
			ИначеЕсли ТипТут = тип("Число") Тогда
				РеквизитЭлементаТип = "Число";        		
				
			ИначеЕсли ТипТут = тип("Дата") Тогда
				РеквизитЭлементаТип = "Дата";
				
			Иначе
				НайденыМета = Метаданные.НайтиПоТипу(ТипТут);
				Если НЕ НайденыМета = Неопределено Тогда
					РеквизитЭлементаТип = СтрЗаменить(НайденыМета.ПолноеИмя(), ".", "Ссылка.");
				Иначе
					РеквизитЭлементаТип = "NULL";
				КонецЕсли;                
				
			КонецЕсли;
			
			к = Константы[КонстантаИмя].Получить();
			ЗагрузитьРеквизит(к, РеквизитЭлементаТип, СчетчикСтрок, ЛОЖЬ, "Константа");
			
			Если НЕ КонстантаИмя = "ВерсияПрограммы" 
				И НЕ КонстантаИмя = "ИспользоватьНаборыТоваров"
				И НЕ КонстантаИмя = "ДатаНачалаПериодаДляВыгрузкиРуководителю"
				И НЕ КонстантаИмя = "ДатаНачалаПериодаПодтвержденнаяРуководителем"
				И НЕ КонстантаИмя = "ЗаконченаПервоначальнаяНастройка"
				И НЕ КонстантаИмя = "ДатаОкончанияПериодаДляВыгрузкиРуководителю"
				И НЕ КонстантаИмя = "ДатаОкончанияПериодаПодтвержденнаяРуководителем" Тогда
				
				Константы[КонстантаИмя].Установить(к);   	
			КонецЕсли;
			
		КонецЦикла;	
		
		Константы.ЗаконченаПервоначальнаяНастройка.Установить(ИСТИНА);
		ОбщийМодульСервисСервер.УстановитьПараметрыСеансаЭлементарнаяТорговля();
		ОбновитьПовторноИспользуемыеЗначения();
		
	Исключение
		ТекстОписаниеОшибки = ОписаниеОшибки();
		ОбщегоНазначения.СообщитьПользователю(ТекстОписаниеОшибки);
	КонецПопытки;
	
	Попытка 
		// /		УстановитьМонопольныйРежим(ЛОЖЬ);
	Исключение 	
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьРеализациюЗаПериод(Команда)
	
	АдресФайла = ПолучитьОтносительныйАдресНаСервере();	
	
	ДиалогФильтр	 = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Файл архива") + " (*.zip)|*.zip";
	ДиалогРасширение = "zip";
	ДиалогДляВыбораФайла 	 = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогДляВыбораФайла.Заголовок				=	ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Выберите файл архива для импорта(загрузки)") + ": ";
	ДиалогДляВыбораФайла.ПолноеИмяФайла			=	АдресФайла; // АДРЕС
	ДиалогДляВыбораФайла.Фильтр					=	ДиалогФильтр;
	ДиалогДляВыбораФайла.Расширение				=	ДиалогРасширение;
	ДиалогДляВыбораФайла.МножественныйВыбор		=	ЛОЖЬ;
	ДиалогДляВыбораФайла.ПредварительныйПросмотр	=	ЛОЖЬ;
	ДиалогДляВыбораФайла.ИндексФильтра			=	0;
	ДиалогДляВыбораФайла.ПроверятьСуществованиеФайла	=	ИСТИНА;
	
	Если ДиалогДляВыбораФайла.Выбрать() Тогда
		
		АдресФайла = ДиалогДляВыбораФайла.ПолноеИмяФайла;
		Состояние(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Идет Загрузка данных.."), , ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ждите.."));
		ЗагрузитьРеализациюЗаПериодНаСервере(АдресФайла);
		ОбщийМодульСервер.ДобавитьСобытиеЖурналаНаСервере(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Загрузил данные Из файла") + ": " + АдресФайла, 2);
		
	КонецЕсли; // когда файл АдресФайла выбран
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьРеализациюЗаПериодНаСервере(Знач АдресФайла)
	
	Каталог = КаталогВременныхФайлов();
	
	ИмяВременногоФайла = Каталог + "/tmp_outdata.tmp";
	Попытка 
		УдалитьФайлы(ИмяВременногоФайла);
	Исключение 	
	КонецПопытки;
	
	ФайлАрхива = Новый ЧтениеZIPФайла(АдресФайла); 
	ФайлАрхива.ИзвлечьВсе(Каталог, РежимВосстановленияПутейФайловZIP.Восстанавливать); 
	ФайлАрхива.Закрыть();     
	
	Объект.СозданныеДокументы.Очистить();
	ПодготовитьСпискиОтбора();
	Константы.ПодсистемаИЭИмпортЭкспортОтносительныйАдресФайлов.Установить(АдресФайла);
	СоздаватьНовуюНоменклатуру = Объект.СоздаватьНовуюНоменклатуру;
	
	ФайлЗагрузки = Новый ЧтениеТекста(ИмяВременногоФайла);
	попытка                                        		
		СчетчикСтрок = 1;
		
		ТаблицаПрихода = Новый ТаблицаЗначений;
		ТаблицаПрихода.Колонки.Добавить("Период");
		ТаблицаПрихода.Колонки.Добавить("Номенклатура");
		// 	ТаблицаПрихода.Колонки.Добавить("ЕдиницаИзмерения");
		ТаблицаПрихода.Колонки.Добавить("СерияНоменклатуры");
		ТаблицаПрихода.Колонки.Добавить("Склад");
		ТаблицаПрихода.Колонки.Добавить("Клиент");
		ТаблицаПрихода.Колонки.Добавить("Количество");
		ТаблицаПрихода.Колонки.Добавить("Сумма");
		ТаблицаПрихода.Колонки.Добавить("Цена");
		ТаблицаПрихода.Колонки.Добавить("ПроцентСкидки");
		
		ТаблицаРасхода = Новый ТаблицаЗначений;
		ТаблицаРасхода.Колонки.Добавить("Период");
		ТаблицаРасхода.Колонки.Добавить("Номенклатура");
		// 	ТаблицаРасхода.Колонки.Добавить("ЕдиницаИзмерения");
		ТаблицаРасхода.Колонки.Добавить("СерияНоменклатуры");
		ТаблицаРасхода.Колонки.Добавить("Склад");
		ТаблицаРасхода.Колонки.Добавить("Клиент");
		ТаблицаРасхода.Колонки.Добавить("Количество");
		ТаблицаРасхода.Колонки.Добавить("Сумма");
		ТаблицаРасхода.Колонки.Добавить("Цена");
		ТаблицаРасхода.Колонки.Добавить("ПроцентСкидки");
		
		ТаблицаОприходования = Новый ТаблицаЗначений;
		ТаблицаОприходования.Колонки.Добавить("Период");
		ТаблицаОприходования.Колонки.Добавить("Номенклатура");
		// 	ТаблицаОприходования.Колонки.Добавить("ЕдиницаИзмерения");
		ТаблицаОприходования.Колонки.Добавить("СерияНоменклатуры");
		ТаблицаОприходования.Колонки.Добавить("Склад");
		ТаблицаОприходования.Колонки.Добавить("Клиент");
		ТаблицаОприходования.Колонки.Добавить("Количество");
		ТаблицаОприходования.Колонки.Добавить("Сумма");
		ТаблицаОприходования.Колонки.Добавить("Цена");
		ТаблицаОприходования.Колонки.Добавить("ПроцентСкидки");
		
		ТаблицаСписания = Новый ТаблицаЗначений;
		ТаблицаСписания.Колонки.Добавить("Период");
		ТаблицаСписания.Колонки.Добавить("Номенклатура");
		// 	ТаблицаСписания.Колонки.Добавить("ЕдиницаИзмерения");
		ТаблицаСписания.Колонки.Добавить("СерияНоменклатуры");
		ТаблицаСписания.Колонки.Добавить("Склад");
		ТаблицаСписания.Колонки.Добавить("Клиент");
		ТаблицаСписания.Колонки.Добавить("Количество");
		ТаблицаСписания.Колонки.Добавить("Сумма");
		ТаблицаСписания.Колонки.Добавить("Цена");
		ТаблицаСписания.Колонки.Добавить("ПроцентСкидки");
		
		ВерсияВФайле = СтрЗаменить(СокрЛП(ФайлЗагрузки.ПрочитатьСтроку()), "F", "");		
		ВерсияЗдесь  = СтрЗаменить(СокрЛП(Метаданные.Версия), "F", "");
		
		Если НЕ ВерсияВФайле = ВерсияЗдесь Тогда
			ОбщегоНазначения.СообщитьПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Версия файла") + ": " + ВерсияВФайле + " " + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("не совпадает с версией конфигурации" + ": " + ВерсияЗдесь));			
			ФайлЗагрузки.Закрыть();
			
			Возврат;
		КонецЕсли;
		
		ЭтоКонецФайла = ЛОЖЬ;
		ВидДвижения   = ФайлЗагрузки.ПрочитатьСтроку();
		
		Если ВидДвижения = Неопределено Тогда
			ЭтоКонецФайла = ИСТИНА;
		ИначеЕсли ВидДвижения = "ПРИХОД" Тогда
			СтрокаТаблицы = ТаблицаПрихода.Добавить();
		ИначеЕсли ВидДвижения = "ОПРИХОД" Тогда
			СтрокаТаблицы = ТаблицаОприходования.Добавить();
		ИначеЕсли ВидДвижения = "СПИСАНИЕ" Тогда
			СтрокаТаблицы = ТаблицаСписания.Добавить();
		Иначе
			СтрокаТаблицы = ТаблицаРасхода.Добавить();
		КонецЕсли;
		
		ЗапрещеноПроводить = ЛОЖЬ;
		ПерваяСтрока 	   = ИСТИНА;
		
		Пока не ЭтоКонецФайла Цикл // строки читаются до символа перевода строки	
			
			Если ПерваяСтрока Тогда
				ПерваяСтрока = ЛОЖЬ;
				
			Иначе
				ВидДвижения = ФайлЗагрузки.ПрочитатьСтроку();
				
				Если ВидДвижения = Неопределено 
					ИЛИ ПустаяСтрока(ВидДвижения) Тогда
					
					ЭтоКонецФайла = ИСТИНА;
				ИначеЕсли ВидДвижения = "ПРИХОД" Тогда
					СтрокаТаблицы = ТаблицаПрихода.Добавить();
				ИначеЕсли ВидДвижения = "ОПРИХОД" Тогда
					СтрокаТаблицы = ТаблицаОприходования.Добавить();
				ИначеЕсли ВидДвижения = "СПИСАНИЕ" Тогда
					СтрокаТаблицы = ТаблицаСписания.Добавить();
				Иначе
					СтрокаТаблицы = ТаблицаРасхода.Добавить();
				КонецЕсли;	
			КонецЕсли;
			
			Если НЕ ЭтоКонецФайла Тогда
				попытка
					СтрокаТаблицы.Период = дата(ФайлЗагрузки.ПрочитатьСтроку());
				исключение
					СтрокаТаблицы.Период = ОбщийМодульСервисСервер.ПользователяТекущаяДата();
				КонецПопытки;
				
				СтруктураРеквизитов = Новый Структура;
				СтруктураРеквизитов.Вставить("НоменклатураНаименование", СокрЛП(ФайлЗагрузки.ПрочитатьСтроку()));
				СтруктураРеквизитов.Вставить("НоменклатураОсновнойШтрихКод", СокрЛП(ФайлЗагрузки.ПрочитатьСтроку()));
				СтруктураРеквизитов.Вставить("НоменклатураАртикул", СокрЛП(ФайлЗагрузки.ПрочитатьСтроку()));
				СтруктураРеквизитов.Вставить("НоменклатураПроизводитель", СокрЛП(ФайлЗагрузки.ПрочитатьСтроку()));
				СтруктураРеквизитов.Вставить("НоменклатураНоменклатурнаяГруппа", СокрЛП(ФайлЗагрузки.ПрочитатьСтроку()));
				
				Попытка 
					СтрокаТаблицы.Цена = Число(ФайлЗагрузки.ПрочитатьСтроку());
				Исключение 	
					СтрокаТаблицы.Цена = 0;
				КонецПопытки;
				
				Номенклатура = ОбнаружитьНоменклатуруПоРеквизитам(СтруктураРеквизитов);
				НоваяНома 	 = ЛОЖЬ;
				
				Если НЕ ЗначениеЗаполнено(Номенклатура) 
					И ЗначениеЗаполнено(СтруктураРеквизитов.НоменклатураНаименование)
					И СоздаватьНовуюНоменклатуру Тогда
					
					НоменклатураОбъект = Справочники.Номенклатура.СоздатьЭлемент();
					НоменклатураОбъект.Артикул 		= СтруктураРеквизитов.НоменклатураАртикул;
					НоменклатураОбъект.Наименование = СтруктураРеквизитов.НоменклатураНаименование;
					НоменклатураОбъект.Родитель 	= Объект.ГруппаНовойНоменклатуры;
					Если ЗначениеЗаполнено(Объект.НоменклатурнаяГруппаНовойНоменклатуры) Тогда
						НоменклатураОбъект.НоменклатурнаяГруппа  = Объект.НоменклатурнаяГруппаНовойНоменклатуры;
					ИначеЕсли НЕ ПустаяСтрока(СтруктураРеквизитов.НоменклатураНоменклатурнаяГруппа) Тогда
						НоменклатураОбъект.НоменклатурнаяГруппа  = Справочники.НоменклатурныеГруппы.НайтиПоНаименованию(СтруктураРеквизитов.НоменклатураНоменклатурнаяГруппа);
					КонецЕсли;				
					
					НоменклатураОбъект.ОсновнойШтрихКод = СтруктураРеквизитов.НоменклатураОсновнойШтрихКод;
					Если ЗначениеЗаполнено(Объект.ПроизводительНовойНоменклатуры) Тогда
						НоменклатураОбъект.Производитель = Объект.ПроизводительНовойНоменклатуры;
					ИначеЕсли НЕ ПустаяСтрока(СтруктураРеквизитов.НоменклатураПроизводитель) Тогда
						НоменклатураОбъект.Производитель = Справочники.Производители.НайтиПоНаименованию(СтруктураРеквизитов.НоменклатураПроизводитель);
					КонецЕсли;
					НоменклатураОбъект.Цена 		= СтрокаТаблицы.Цена;
					НоменклатураОбъект.Комментарий 	= ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Загружен автоматически") + " " + ТекущаяДата();
					
					Попытка 
						
						НоменклатураОбъект.Записать();
						НоваяНома 		= ИСТИНА;
						Номенклатура 	= НоменклатураОбъект.Ссылка;
						
					Исключение 
						ТекстОписаниеОшибки = ОписаниеОшибки();
						ОбщегоНазначения.СообщитьПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ошибка при попытке записи Номенклатуры") + ": " + НоменклатураОбъект + " " + ТекстОписаниеОшибки);
					КонецПопытки; 
					
				КонецЕсли;
				
				СтрокаТаблицы.Номенклатура = Номенклатура;
				
				Попытка 
					СтрокаТаблицы.ПроцентСкидки = Число(ФайлЗагрузки.ПрочитатьСтроку());	
				Исключение 	
					СтрокаТаблицы.ПроцентСкидки = 0;							
				КонецПопытки;
				
				СерияНоменклатуры = ФайлЗагрузки.ПрочитатьСтроку();
				Если УчетПоСериям Тогда
					СтрокаТаблицы.СерияНоменклатуры = ОбщийМодульТоварСервер.ОбнаружитьСериюНоменклатуры(Номенклатура, СерияНоменклатуры, ИСТИНА);
				КонецЕсли;
				
				// 	ЕдиницаИзмерения = ФайлЗагрузки.ПрочитатьСтроку();
				// 	СтрокаТаблицы.ЕдиницаИзмерения = ОбщийМодульТоварСервер.ОбнаружитьЕдиницуНоменклатуры(Номенклатура, ЕдиницаИзмерения);
				
				наимс = ФайлЗагрузки.ПрочитатьСтроку();
				Если ЗначениеЗаполнено(Объект.УстановитьСклад) Тогда
					СтрокаТаблицы.Склад = Объект.УстановитьСклад.Ссылка;
				Иначе
					СтрокаТаблицы.Склад = Справочники.Склады.НайтиПоНаименованию(наимс);
				КонецЕсли;					
				
				КлиентНаименование 	= СокрЛП(ФайлЗагрузки.ПрочитатьСтроку());
				КлиентОКПО			= СокрЛП(ФайлЗагрузки.ПрочитатьСтроку());	
				
				Если ЗначениеЗаполнено(Объект.УстановитьКлиента) Тогда
					СтрокаТаблицы.Клиент = Объект.УстановитьКлиента;
					
				Иначе
					Клиент = ОбнаружитьКлиента(КлиентНаименование, КлиентОКПО);
					
					Если ЗначениеЗаполнено(КлиентНаименование)
						И НЕ ЗначениеЗаполнено(Клиент) 
						И Объект.СоздаватьНовыхКлиентовЕслиНеНайдены Тогда
						
						КлиентОбъект = Справочники.Клиенты.СоздатьЭлемент();
						КлиентОбъект.ВидЦен = Объект.ВидЦенДляНовыхКлиентов;
						КлиентОбъект.Наименование = КлиентНаименование;
						КлиентОбъект.ОКПО = КлиентОКПО;
						КлиентОбъект.НаименованиеДляПечати = КлиентНаименование;
						КлиентОбъект.ПравовойСтатус = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ПравовойСтатусПоУмолчанию");
						Если ЗначениеЗаполнено(Объект.РегионНовыхКлиентов) Тогда
							КлиентОбъект.Регион = Объект.РегионНовыхКлиентов ;
						Иначе
							КлиентОбъект.Регион = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("РегионПоУмолчанию");								
						КонецЕсли;
						КлиентОбъект.Комментарий = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Загружен автоматически") + " " + ТекущаяДата();
						
						Попытка // Записи КлиентОбъект
							
							КлиентОбъект.Записать();
							Клиент = КлиентОбъект.Ссылка;
							
						Исключение // Записи КлиентОбъект
							ТекстОписаниеОшибки = ОписаниеОшибки();
							ОбщегоНазначения.СообщитьПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ошибка при попытке записи Клиента") + ": " + КлиентОбъект + " - " + ТекстОписаниеОшибки);
						КонецПопытки; // Записи КлиентОбъект    							
						
					КонецЕсли;
					
					СтрокаТаблицы.Клиент = Клиент;
				КонецЕсли;     					
				
				попытка
					СтрокаТаблицы.Количество = Число(ФайлЗагрузки.ПрочитатьСтроку());
				исключение
					СтрокаТаблицы.Количество = 0;
					ЗапрещеноПроводить = ИСТИНА;
				КонецПопытки;
				
				Если НЕ СтрокаТаблицы.Цена
					И ЗначениеЗаполнено(Номенклатура)
					И Объект.УстанавливатьЦенуПриЗагрузке Тогда
					
					ТекущаяЦена = 0;
					Если НЕ НоваяНома
						И Объект.УстанавливатьЦенуТолькоЕслиОнаНеУстановлена Тогда
						
						ТекущаяЦена = ОбщийМодульСервер.ПолучитьЦенуНаСервере(Номенклатура, Объект.ВидЦенДляУстановкиПриЗагрузке, СтрокаТаблицы.Период, ЛОЖЬ, СтрокаТаблицы.Количество, , , , Объект.Ссылка, , СтрокаТаблицы.ЕдиницаИзмерения);
					КонецЕсли;
					
					Если ТекущаяЦена = 0 Тогда
						СтрокаТовара = Новый Структура;
						СтрокаТовара.Номенклатура 	= Номенклатура;
						СтрокаТовара.цена 			= СтрокаТаблицы.Цена;
						ОбщийМодульСервер.УстановитьЦенуИВсеЗависимые(Объект.ВидЦенДляУстановкиПриЗагрузке, СтрокаТовара, , ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Загружен автоматически") + " " + ТекущаяДата(), СтрокаТаблицы.Период, ЛОЖЬ, , , , , СтрокаТаблицы.ЕдиницаИзмерения);
					КонецЕсли;
					
				КонецЕсли;
				
				попытка	
					СтрокаТаблицы.Сумма = Число(ФайлЗагрузки.ПрочитатьСтроку());
					
					Если НЕ СтрокаТаблицы.Количество = 0 Тогда
						СтрокаТаблицы.Цена = СтрокаТаблицы.Сумма / СтрокаТаблицы.Количество;	
					КонецЕсли;
					
				исключение
					СтрокаТаблицы.Сумма = 0;
					ЗапрещеноПроводить = ИСТИНА;
				КонецПопытки;
				
				СчетчикСтрок = СчетчикСтрок + 1;	
			КонецЕсли;
		КонецЦикла;	
		
		ФайлЗагрузки.Закрыть();
		
		// запись всех доков
		Если НЕ ТаблицаПрихода.Количество() = 0 Тогда
			
			НовыйДокумент = Неопределено;
			ТекущийКлиент = Справочники.Клиенты.ПустаяСсылка();
			ТекущийСклад = Справочники.Склады.ПустаяСсылка();
			
			Если Объект.ФормироватьОдинДокументДляВсейРеализации Тогда
				
				НовыйДокумент = Документы.ПоступленияТовара.СоздатьДокумент();
				НовыйДокумент.Дата 			= ТаблицаПрихода[0].Период;
				НовыйДокумент.Комментарий 	= ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Загружен автоматически") + " " + ТекущаяДата();
				НовыйДокумент.Склад 		= ТаблицаПрихода[0].Склад;
				НовыйДокумент.КлиентПоставщик = Справочники.Клиенты.ФизическоеЛицо ;// это же возврат, значит он обязателен
				
			КонецЕсли;
			
			Для Каждого СтрокаПрихода Из ТаблицаПрихода Цикл
				
				Если НЕ Объект.ФормироватьОдинДокументДляВсейРеализации
					И (не ТекущийКлиент = СтрокаПрихода.клиент Или не ТекущийСклад = СтрокаПрихода.Склад) Тогда
					
					Если НЕ НовыйДокумент = Неопределено Тогда
						ЗаписьНовогоДокумента(НовыйДокумент, ЗапрещеноПроводить);
					КонецЕсли;
					
					Если ПроверитьСтрокуПоОтборам(СтрокаПрихода) Тогда
						
						НовыйДокумент = Документы.ПоступленияТовара.СоздатьДокумент();
						НовыйДокумент.КлиентПоставщик 	= СтрокаПрихода.Клиент;
						НовыйДокумент.Дата 				= СтрокаПрихода.Период;
						НовыйДокумент.Комментарий 		= ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Загружен автоматически") + " " + ТекущаяДата();
						НовыйДокумент.Склад 			= СтрокаПрихода.Склад;	
						
					КонецЕсли;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СтрокаПрихода.Номенклатура) Тогда
					
					СтрокаТоваров = НовыйДокумент.Товары.Добавить();
					СтрокаТоваров.Номенклатура 	= СтрокаПрихода.Номенклатура;
					СтрокаТоваров.СерияНоменклатуры = СтрокаПрихода.СерияНоменклатуры;
					СтрокаТоваров.Количество 	= СтрокаПрихода.Количество;
					СтрокаТоваров.Цена 			= СтрокаПрихода.Цена;
					СтрокаТоваров.Сумма 		= СтрокаПрихода.Сумма;
					
				КонецЕсли;
				
			КонецЦикла;	
			Если НЕ НовыйДокумент = Неопределено Тогда
				ЗаписьНовогоДокумента(НовыйДокумент, ЗапрещеноПроводить);
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ТаблицаРасхода.Количество() = 0 Тогда
			
			НовыйДокумент 	= Неопределено;
			ТекущийКлиент 	= Справочники.Клиенты.ПустаяСсылка();
			ТекущийСклад 	= Справочники.Склады.ПустаяСсылка();
			
			Если Объект.ФормироватьОдинДокументДляВсейРеализации Тогда
				
				НовыйДокумент = Документы.РасходыТовара.СоздатьДокумент();
				НовыйДокумент.Дата 			= ТаблицаРасхода[0].Период;
				НовыйДокумент.Комментарий 	= ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Загружен автоматически") + " " + ТекущаяДата();
				НовыйДокумент.Склад 		= ТаблицаРасхода[0].Склад;
				НовыйДокумент.КлиентПоставщик = Справочники.Клиенты.ФизическоеЛицо ;// это же возврат, значит он обязателен
				
			КонецЕсли;
			
			Для Каждого СтрокаРасхода Из ТаблицаРасхода Цикл
				
				Если НЕ Объект.ФормироватьОдинДокументДляВсейРеализации
					И (не ТекущийКлиент = СтрокаРасхода.клиент Или не ТекущийСклад = СтрокаРасхода.Склад) Тогда
					
					Если НЕ НовыйДокумент = Неопределено Тогда
						ЗаписьНовогоДокумента(НовыйДокумент, ЗапрещеноПроводить);
					КонецЕсли;
					
					Если ПроверитьСтрокуПоОтборам(СтрокаРасхода) Тогда
						
						НовыйДокумент = Документы.РасходыТовара.СоздатьДокумент();
						НовыйДокумент.КлиентПоставщик = СтрокаРасхода.Клиент;
						НовыйДокумент.Дата 			= СтрокаРасхода.Период;
						НовыйДокумент.Комментарий 	= ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Загружен автоматически") + " " + ТекущаяДата();
						НовыйДокумент.Склад 		= СтрокаРасхода.Склад; 	
						
					КонецЕсли;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СтрокаРасхода.Номенклатура) Тогда
					
					СтрокаТоваров = НовыйДокумент.Товары.Добавить();
					СтрокаТоваров.Номенклатура 		= СтрокаРасхода.Номенклатура;
					СтрокаТоваров.СерияНоменклатуры = СтрокаРасхода.СерияНоменклатуры;
					СтрокаТоваров.Количество 		= СтрокаРасхода.Количество;
					СтрокаТоваров.Цена 				= СтрокаРасхода.Цена;
					СтрокаТоваров.Сумма 			= СтрокаРасхода.Сумма;
					СтрокаТоваров.ПроцентСкидки 	=  СтрокаРасхода.ПроцентСкидки;
					
					Если НЕ СтрокаРасхода.Количество = 0 Тогда
						СтрокаТоваров.СуммаБезСкидки = СтрокаРасхода.Цена * СтрокаРасхода.Количество;
					Иначе
						СтрокаТоваров.СуммаБезСкидки = СтрокаРасхода.Сумма;
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;	
			Если НЕ НовыйДокумент = Неопределено Тогда
				ЗаписьНовогоДокумента(НовыйДокумент, ЗапрещеноПроводить);
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ТаблицаСписания.Количество() = 0 Тогда
			
			НовыйДокумент = Неопределено;
			ТекущийКлиент = Справочники.Клиенты.ПустаяСсылка();
			ТекущийСклад  = Справочники.Склады.ПустаяСсылка();
			
			Если Объект.ФормироватьОдинДокументДляВсейРеализации Тогда
				
				НовыйДокумент = Документы.РасходыТовара.СоздатьДокумент();
				НовыйДокумент.Дата 			= ТаблицаСписания[0].Период;
				НовыйДокумент.Комментарий 	= ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Загружен автоматически") + " " + ТекущаяДата();
				НовыйДокумент.Склад 		= ТаблицаСписания[0].Склад;
				
			КонецЕсли;
			
			Для Каждого СтрокаРасхода Из ТаблицаСписания Цикл
				
				Если НЕ Объект.ФормироватьОдинДокументДляВсейРеализации 
					И НЕ ТекущийСклад = СтрокаРасхода.Склад Тогда
					
					Если НЕ НовыйДокумент = Неопределено Тогда
						ЗаписьНовогоДокумента(НовыйДокумент, ЗапрещеноПроводить);
					КонецЕсли;
					
					Если ПроверитьСтрокуПоОтборам(СтрокаРасхода) Тогда
						
						НовыйДокумент = Документы.РасходыТовара.СоздатьДокумент();
						НовыйДокумент.Дата 			= СтрокаРасхода.Период;
						НовыйДокумент.Комментарий 	= ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Загружен автоматически") + " " + ТекущаяДата();
						НовыйДокумент.Склад 		= СтрокаРасхода.Склад; 	
						
					КонецЕсли;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СтрокаРасхода.Номенклатура) Тогда
					
					СтрокаТоваров = НовыйДокумент.Товары.Добавить();
					СтрокаТоваров.Номенклатура 		= СтрокаРасхода.Номенклатура;
					СтрокаТоваров.СерияНоменклатуры = СтрокаРасхода.СерияНоменклатуры;
					СтрокаТоваров.Количество 		= СтрокаРасхода.Количество;
					СтрокаТоваров.Цена 				= СтрокаРасхода.Цена;
					СтрокаТоваров.Сумма 			= СтрокаРасхода.Сумма;
					СтрокаТоваров.ПроцентСкидки 	= СтрокаРасхода.ПроцентСкидки;
					
					Если НЕ СтрокаРасхода.Количество = 0 Тогда
						СтрокаТоваров.СуммаБезСкидки = СтрокаРасхода.Цена * СтрокаРасхода.Количество;
					Иначе
						СтрокаТоваров.СуммаБезСкидки = СтрокаРасхода.Сумма;
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;	
			
			Если НЕ НовыйДокумент = Неопределено Тогда
				ЗаписьНовогоДокумента(НовыйДокумент, ЗапрещеноПроводить);
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ТаблицаОприходования.Количество() = 0 Тогда
			
			НовыйДокумент = Неопределено;
			ТекущийКлиент = Справочники.Клиенты.ПустаяСсылка();
			ТекущийСклад  = Справочники.Склады.ПустаяСсылка();
			
			Если Объект.ФормироватьОдинДокументДляВсейРеализации Тогда
				
				НовыйДокумент = Документы.ПоступленияТовара.СоздатьДокумент();
				НовыйДокумент.Дата 			= ТаблицаОприходования[0].Период;
				НовыйДокумент.Комментарий 	= ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Загружен автоматически") + " " + ТекущаяДата();
				НовыйДокумент.Склад 		= ТаблицаОприходования[0].Склад;
				
			КонецЕсли;
			
			Для Каждого СтрокаОприхода Из ТаблицаОприходования Цикл
				
				Если НЕ Объект.ФормироватьОдинДокументДляВсейРеализации 
					И НЕ ТекущийСклад = СтрокаОприхода.Склад Тогда
					
					Если НЕ НовыйДокумент = Неопределено Тогда
						ЗаписьНовогоДокумента(НовыйДокумент, ЗапрещеноПроводить);
					КонецЕсли;
					
					Если ПроверитьСтрокуПоОтборам(СтрокаОприхода) Тогда
						
						НовыйДокумент = Документы.РасходыТовара.СоздатьДокумент();
						НовыйДокумент.Дата = СтрокаОприхода.Период;
						НовыйДокумент.Комментарий = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Загружен автоматически") + " " + ТекущаяДата();
						НовыйДокумент.Склад = СтрокаОприхода.Склад; 	
						
					КонецЕсли;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СтрокаОприхода.Номенклатура) Тогда
					
					СтрокаТоваров = НовыйДокумент.Товары.Добавить();
					СтрокаТоваров.Номенклатура 		= СтрокаОприхода.Номенклатура;
					СтрокаТоваров.СерияНоменклатуры = СтрокаОприхода.СерияНоменклатуры;
					СтрокаТоваров.Количество 		= СтрокаОприхода.Количество;
					СтрокаТоваров.Цена 				= СтрокаОприхода.Цена;
					СтрокаТоваров.Сумма 			= СтрокаОприхода.Сумма;
					СтрокаТоваров.ПроцентСкидки 	= СтрокаОприхода.ПроцентСкидки;
					
					Если НЕ СтрокаОприхода.Количество = 0 Тогда
						СтрокаТоваров.СуммаБезСкидки = СтрокаОприхода.Цена * СтрокаОприхода.Количество;
					Иначе
						СтрокаТоваров.СуммаБезСкидки = СтрокаОприхода.Сумма;
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;	
			
			Если НЕ НовыйДокумент = Неопределено Тогда
				ЗаписьНовогоДокумента(НовыйДокумент, ЗапрещеноПроводить);
			КонецЕсли;
		КонецЕсли;
		
		ПодсистемаИЭ.ЗаписатьВЖурналИмпортноЭкспортныхОпераций(АдресФайла, , ТаблицаРасхода.Количество(), ЛОЖЬ, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Загрузка реализаций, списания из файла."));
		
		ОбщегоНазначения.СообщитьПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Данные загружены. Всего строк") + ": " + СчетчикСтрок);
		
	Исключение 	
		ТекстОписаниеОшибки = ОписаниеОшибки();
		ОбщегоНазначения.СообщитьПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Произошла ошибка при чтении файла") + ": " + ТекстОписаниеОшибки);
	КонецПопытки;
	
	Попытка 
		УдалитьФайлы(ИмяВременногоФайла);
	Исключение 	
	КонецПопытки;
	
КонецПроцедуры

Функция   ЗагрузитьРеквизит(ДействительноЗначениеДляРеквизита, ТипРеквизита, сч, пропустить, ЗначениеТип, ОпределенныйЭлемент = Неопределено);
	
	Отказ = ЛОЖЬ;
	Назначать = ИСТИНА;
	ЗначениеДляРеквизита = Неопределено;
	
	Если ТипРеквизита = "Булево" Тогда
		
		Значение = ТекДок.ПолучитьСтроку(сч);
		Если Значение = "TRUE" Тогда
			ЗначениеДляРеквизита = ИСТИНА;
		Иначе
			ЗначениеДляРеквизита = ЛОЖЬ;
		КонецЕсли;
		сч = сч + 1;
		
	ИначеЕсли ТипРеквизита = "Строка" Тогда
		ЗначениеДляРеквизита = стрзаменить(ТекДок.ПолучитьСтроку(сч), "ПЕРЕНОССТРОКИ", Символы.ПС);
		сч = сч + 1;
		
	ИначеЕсли ТипРеквизита = "Число" Тогда
		Попытка
			ЗначениеДляРеквизита = число(ТекДок.ПолучитьСтроку(сч));
		Исключение
			ЗначениеДляРеквизита = 0;
		КонецПопытки;
		сч = сч + 1;
		
	ИначеЕсли ТипРеквизита = "Дата" Тогда   			
		Попытка
			ЗначениеДляРеквизита = Дата(ТекДок.ПолучитьСтроку(сч));
		Исключение
			ЗначениеДляРеквизита = '00010101';
		КонецПопытки;
		сч = сч + 1;
		
	ИначеЕсли ВРег(ТипРеквизита) = "NULL" Тогда 
		ТипТут = ТекДок.ПолучитьСтроку(сч);
		
		сч = сч + 1;
		Если ВРег(ТипТут) = "NULL" Тогда
			ЗначениеДляРеквизита = Неопределено;
			Назначать = ЛОЖЬ;
			сч = сч + 1;
			сч = сч + 1;
			
		ИначеЕсли ТипТут = "ПУСТО" Тогда
			ЗначениеДляРеквизита = Неопределено;				
		Иначе				
			ЗначениеДляРеквизита = ЗагрузитьСправочник("СправочникСсылка." + ТипТут, сч, пропустить, ИСТИНА, ОпределенныйЭлемент);
		КонецЕсли;
		
	ИначеЕсли НЕ Найти(ТипРеквизита, "СправочникСсылка") = 0 Тогда
		ЗначениеДляРеквизита = ЗагрузитьСправочник(ТипРеквизита, сч, пропустить, , ОпределенныйЭлемент);
		
	ИначеЕсли НЕ Найти(ТипРеквизита, "ДокументСсылка") = 0 Тогда
		ЗначениеДляРеквизита = ЗагрузитьДокумент(ИСТИНА, ТипРеквизита, сч, пропустить, ОпределенныйЭлемент);
		
	ИначеЕсли НЕ Найти(ТипРеквизита, "ПеречислениеСсылка") = 0 Тогда
		Значение = ТекДок.ПолучитьСтроку(сч);
		
		Если НЕ Значение = "ПУСТО" Тогда
			ТипРеквизитаДоп = СтрЗаменить(ТипРеквизита, "ПеречислениеСсылка.", "");
			Значение = Число(Значение);
			
			попытка
				ЗначениеДляРеквизита = перечисления[ТипРеквизитаДоп][Значение];	
			Исключение
				ЗначениеДляРеквизита = Неопределено;
			КонецПопытки;
		КонецЕсли;
		сч = сч + 1;
		
	Иначе
		ЗначениеДляРеквизита = стрзаменить(ТекДок.ПолучитьСтроку(сч), "ПЕРЕНОССТРОКИ", Символы.ПС);
		сч = сч + 1;
		
	КонецЕсли;
	
	Если Назначать Тогда
		Попытка
			ДействительноЗначениеДляРеквизита = ЗначениеДляРеквизита;
			
		Исключение
			ТекстОписаниеОшибки = ОписаниеОшибки();
			ОбщегоНазначения.СообщитьПользователю("№: " + сч + " " + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("для") + ": " + ТекДок.ПолучитьСтроку(сч) + ". " + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Значения Тип") + ": " + ЗначениеТип + ". " + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Значение Реквизита") + ": " + ЗначениеДляРеквизита + ". " + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Тип Реквизита") + ": " + ТипРеквизита + ". " + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Пропустить") + ": " + пропустить + " :" + ТекстОписаниеОшибки);
			сч = сч + 1;
			
			Отказ = ИСТИНА;
			
		КонецПопытки; 	
	КонецЕсли;
	
	Возврат Отказ;
	
КонецФункции

Функция   ЗагрузитьСправочник(Знач ТипСправочника, сч, Знач пропустить, ТипПрочитан = ЛОЖЬ, ОпределенныйЭлемент = Неопределено);
	
	ТипСправочника = СтрЗаменить(ТипСправочника, "СправочникСсылка.", "");
	
	Если НЕ ТипПрочитан Тогда
		ЗначениеТип = ТекДок.ПолучитьСтроку(сч);
		сч = сч + 1;
	Иначе
		ЗначениеТип = ТипСправочника;
	КонецЕсли;	
	
	Если ПустаяСтрока(ЗначениеТип) Тогда  		
		возврат неопределено;
		
	ИначеЕсли ЗначениеТип = "ПУСТО" Тогда  		
		
		попытка
			Возврат Справочники[ТипСправочника].ПустаяССылка();
		исключение
			возврат неопределено;
		КонецПопытки;
		
	ИначеЕсли НЕ ЗначениеТип = "ПРОП"
		И НЕ ВРег(ЗначениеТип) = "NULL" Тогда  		
		
		ЗначениеБылНов = ТекДок.ПолучитьСтроку(сч);
		сч = сч + 1;
		
		ЗначениеКод = ТекДок.ПолучитьСтроку(сч);
		сч = сч + 1;
		
		СпецКод = "";
		Если ОбщийМодульПовтор.СпецСправочник(ТипСправочника) Тогда
			СпецКод = СокрЛП(ТекДок.ПолучитьСтроку(сч));
			сч = сч + 1;	
		КонецЕсли;
		
		ЗначениеНаименование = ТекДок.ПолучитьСтроку(сч);
		сч = сч + 1;
		
		Если ОпределенныйЭлемент = Неопределено Тогда
			Запрос = Новый Запрос;
			Если НЕ ПустаяСтрока(СпецКод) Тогда
				Запрос.Текст = ОбщийМодульПовтор.ПолучитьТекстЗапросаПоискаСпецСправочника(ТипСправочника);
				
				Если Запрос.Текст = "НШК" Тогда
					ОбъектСсылка = ОбщийМодульТоварСервер.ПолучитьНоменклатуруПоШтрихКоду(СпецКод, ЛОЖЬ, ИСТИНА);
					
					РезультатЗапросаПустой = НЕ ЗначениеЗаполнено(ОбъектСсылка);
					Если РезультатЗапросаПустой Тогда
						Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 С.Ссылка Из Справочник." + ТипСправочника + " КАК С ГДЕ С.Наименование = &ЗначениеНаименование ";// И С.Код = &ЗначениеКод";
						Запрос.УстановитьПараметр("ЗначениеНаименование", ЗначениеНаименование);
						
						РезультатЗапроса = Запрос.Выполнить();
						РезультатЗапросаПустой = РезультатЗапроса.Пустой();
						Если НЕ РезультатЗапросаПустой Тогда
							ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
							ВыборкаДетальныеЗаписи.Следующий();
							
							ОбъектСсылка = ВыборкаДетальныеЗаписи.Ссылка;	
						КонецЕсли;                           	
					КонецЕсли;
					
				Иначе
					Запрос.УстановитьПараметр("СпецКод", СпецКод);	
					РезультатЗапроса = Запрос.Выполнить();
					РезультатЗапросаПустой = РезультатЗапроса.Пустой();		
					Если НЕ РезультатЗапросаПустой Тогда
						ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
						ВыборкаДетальныеЗаписи.Следующий();
						
						ОбъектСсылка = ВыборкаДетальныеЗаписи.Ссылка;	
					КонецЕсли;
				КонецЕсли;
				
			Иначе
				Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 С.Ссылка Из Справочник." + ТипСправочника + " КАК С ГДЕ С.Наименование = &ЗначениеНаименование ";// И С.Код = &ЗначениеКод";
				Запрос.УстановитьПараметр("ЗначениеНаименование", ЗначениеНаименование);
				
				РезультатЗапроса = Запрос.Выполнить();
				РезультатЗапросаПустой = РезультатЗапроса.Пустой();
				Если НЕ РезультатЗапросаПустой Тогда
					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					ВыборкаДетальныеЗаписи.Следующий();
					
					ОбъектСсылка = ВыборкаДетальныеЗаписи.Ссылка;	
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеБылНов = "БЫЛ" Тогда
			Если НЕ ОпределенныйЭлемент = Неопределено Тогда
				Возврат ОпределенныйЭлемент;
			ИначеЕсли не РезультатЗапросаПустой Тогда
				Возврат ОбъектСсылка;
			Иначе
				Возврат неопределено;	
			КонецЕсли;
			
		Иначе
			Если НЕ ОпределенныйЭлемент = Неопределено Тогда
				
				Пропустить 	= ПроверитьЭлемент(ОпределенныйЭлемент, ТипСправочника);
				Если пропустить Тогда
					ОбъектС = Справочники[ТипСправочника].СоздатьЭлемент();
				Иначе
					ОбъектС = ОпределенныйЭлемент.ПолучитьОбъект();
				КонецЕсли;
				
			Иначе
				Если РезультатЗапросаПустой Тогда
					ОбъектС = Справочники[ТипСправочника].СоздатьЭлемент();
					Если НЕ ЗначениеЗаполнено(Справочники[ТипСправочника].НайтиПоКоду(ЗначениеКод)) Тогда
						ОбъектС.Код	= ЗначениеКод;
					КонецЕсли;				
					ОбъектС.Наименование = ЗначениеНаименование;
					
				ИначеЕсли Объект.ЗаменитьДанныеВСуществующихКарточкахСправочников Тогда
					
					Пропустить 		= ПроверитьЭлемент(ОбъектСсылка, ТипСправочника);
					Если пропустить Тогда
						ОбъектС = Справочники[ТипСправочника].СоздатьЭлемент();
					Иначе
						ОбъектС = ОбъектСсылка.ПолучитьОбъект();
					КонецЕсли;
					
				Иначе
					СсылкуВернуть = ОбъектСсылка;
					ОбъектС 	  = Справочники[ТипСправочника].СоздатьЭлемент();
					пропустить 	  = ИСТИНА;
					
				КонецЕсли;	  		
			КонецЕсли;
			
			МетаДок  = Метаданные.Справочники[ТипСправочника];
			РеквизитыЭлемента 	 = МетаДок.Реквизиты;
			ТабЧасти = МетаДок.ТабличныеЧасти;
			Отказ	 = ЛОЖЬ;
			
			Для Каждого РеквизитЭлемента Из РеквизитыЭлемента Цикл
				
				РеквизитЭлементаТип = ОбщийМодульТекстСервер.СтрокаТипаРеквизита(ОбъектС, РеквизитЭлемента.Имя);
				ЗагрузитьРеквизит(ОбъектС[РеквизитЭлемента.Имя], РеквизитЭлементаТип, сч, пропустить, ЗначениеТип);
				
			КонецЦикла;
			
			Если НЕ Отказ Тогда
				Для Каждого ТабЧасть Из ТабЧасти Цикл
					
					РеквыТабЧасти = ТабЧасть.Реквизиты;					
					ЧислоСтрок =  Число(ТекДок.ПолучитьСтроку(сч));
					сч = сч + 1;
					
					Для СчетчикСтрок = 1 По ЧислоСтрок Цикл
						
						СтрокаДок = ОбъектС[ТабЧасть.Имя].Добавить();
						
						Для Каждого РеквизитЭлемента Из РеквыТабЧасти Цикл
							
							РеквизитЭлементаТип = ОбщийМодульТекстСервер.СтрокаТипаРеквизита(СтрокаДок, РеквизитЭлемента.имя);							
							ЗагрузитьРеквизит(СтрокаДок[РеквизитЭлемента.Имя], РеквизитЭлементаТип, сч, пропустить, ЗначениеТип);
							
						КонецЦикла;    				
					КонецЦикла;  			
				КонецЦикла;	
			КонецЕсли;  		
			
			Если НЕ Пропустить Тогда
				Попытка 
					ОбъектС.Записать();			
					Возврат ОбъектС.ссылка;
					
				Исключение 	
					ТекстОписаниеОшибки = ОписаниеОшибки();
					ОбщегоНазначения.СообщитьПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Произошла ошибка") + ": " + ТекстОписаниеОшибки);
					
					Возврат Неопределено;					
				КонецПопытки;
				
			Иначе
				Возврат СсылкуВернуть;
			КонецЕсли;              	
			
		КонецЕсли;	
	КонецЕсли;	
	
КонецФункции

&НаСервере
Процедура ЗаписьНовогоДокумента(НовыйДокумент, Знач ЗапрещеноПроводить = ЛОЖЬ)
	
	НовыйДокумент.ТовараВКоличестве = НовыйДокумент.Товары.Итог("Количество");
	НовыйДокумент.ТовараНаСумму 	= НовыйДокумент.Товары.Итог("Сумма");
	
	Если НЕ ЗапрещеноПроводить
		И Объект.ПытатьсяСразуПроводитьДокументыПриЗагрузке Тогда
		
		Попытка 
			НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);	
			СозданДок 			= Объект.СозданныеДокументы.Добавить();
			СозданДок.Документ 	= НовыйДокумент.Ссылка;
			
		Исключение 	
			ТекстОписаниеОшибки = ОписаниеОшибки();
			ОбщегоНазначения.СообщитьПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Произошла ошибка при проведении") + ": " + ТекстОписаниеОшибки);
			
			Попытка 
				НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);	
				СозданДок = Объект.СозданныеДокументы.Добавить();
				СозданДок.Документ = НовыйДокумент.Ссылка;
				
			Исключение 	
				ТекстОписаниеОшибки = ОписаниеОшибки();
				ОбщегоНазначения.СообщитьПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Произошла ошибка при записи") + ": " + ТекстОписаниеОшибки);
				
			КонецПопытки;	
		КонецПопытки;
		
	Иначе
		Попытка 
			НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);	
			СозданДок = Объект.СозданныеДокументы.Добавить();
			СозданДок.Документ = НовыйДокумент.Ссылка;
			
		Исключение 	
			ТекстОписаниеОшибки = ОписаниеОшибки();
			ОбщегоНазначения.СообщитьПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Произошла ошибка при записи") + ": " + ТекстОписаниеОшибки);
			
		КонецПопытки;	
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ИмпортЭкспортПакетноеИсполнение(Команда)
	ОткрытьФорму("Обработка.ИмпортЭкспортПакетноеИсполнение.Форма.ФормаСпискаЗадач");
КонецПроцедуры

&НаСервере
Функция   ОбнаружитьКлиента(КлиентНаименование, КлиентОКПО)
	
	Результат = Справочники.Клиенты.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(КлиентОКПО) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 Клиенты.Ссылка
		|ИЗ Справочник.Клиенты КАК Клиенты
		|ГДЕ Клиенты.ОКПО = &ОКПО
		|УПОРЯДОЧИТЬ ПО Клиенты.ПометкаУдаления";
		
		Запрос.УстановитьПараметр("ОКПО", КлиентОКПО);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Результат = ВыборкаДетальныеЗаписи.ссылка;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Результат = Справочники.Клиенты.НайтиПоНаименованию(КлиентНаименование);
		
		Если НЕ ЗначениеЗаполнено(Результат) Тогда
			
			Результат = Справочники.Клиенты.ФизическоеЛицо.Ссылка ;
			
			ТекстСообщения = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Клиент") + " " + КлиентНаименование + " " + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("не найден.");
			Если Объект.СоздаватьНовуюНоменклатуру Тогда
				ТекстСообщения = ТекстСообщения + " " + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Будет создан новый.");		
			Иначе
				ТекстСообщения = ТекстСообщения + " " + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Установлен частный покупатель.");		
			КонецЕсли;
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, СтатусСообщения.Важное);
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // ОбнаружитьКлиента

&НаСервере
Функция   ОбнаружитьНоменклатуруПоРеквизитам(СтруктураРеквизитов)
	
	Результат = Справочники.Номенклатура.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(СтруктураРеквизитов.НоменклатураОсновнойШтрихКод) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 Номенклатура.Ссылка
		|ИЗ Справочник.Номенклатура КАК Номенклатура
		|ГДЕ Номенклатура.ОсновнойШтрихКод = &ОсновнойШтрихКод УПОРЯДОЧИТЬ ПО Номенклатура.ПометкаУдаления";
		
		Запрос.УстановитьПараметр("ОсновнойШтрихКод", СтруктураРеквизитов.НоменклатураОсновнойШтрихКод);
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			ВыборкаДетальныеЗаписи.Следующий();
			Результат = ВыборкаДетальныеЗаписи.ссылка;
			
		Иначе
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 ШтрихКоды.Номенклатура
			|ИЗ РегистрСведений.ШтрихКоды КАК ШтрихКоды
			|ГДЕ ШтрихКоды.ШтрихКод = &ШтрихКод";
			
			Запрос.УстановитьПараметр("ШтрихКод", СтруктураРеквизитов.НоменклатураОсновнойШтрихКод);
			РезультатЗапроса = Запрос.Выполнить();
			
			Если НЕ РезультатЗапроса.Пустой() Тогда
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				ВыборкаДетальныеЗаписи.Следующий();
				Результат = ВыборкаДетальныеЗаписи.ссылка;
				
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Результат) 
		И ЗначениеЗаполнено(СтруктураРеквизитов.НоменклатураАртикул) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 Номенклатура.Ссылка
		|ИЗ Справочник.Номенклатура КАК Номенклатура
		|ГДЕ Номенклатура.Артикул = &Артикул
		|УПОРЯДОЧИТЬ ПО Номенклатура.ПометкаУдаления";
		
		Запрос.УстановитьПараметр("Артикул", СтруктураРеквизитов.НоменклатураАртикул);
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			ВыборкаДетальныеЗаписи.Следующий();
			Результат = ВыборкаДетальныеЗаписи.ссылка;
			
		КонецЕсли;			
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Результат = Справочники.Номенклатура.НайтиПоНаименованию(СтруктураРеквизитов.НоменклатураНаименование);	
		
		Если НЕ ЗначениеЗаполнено(Результат) Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 Номенклатура.Ссылка
			|ИЗ Справочник.Номенклатура КАК Номенклатура
			|ГДЕ Номенклатура.Производитель.Наименование ПОДОБНО &НаименованиеПроизводитель
			|	И Номенклатура.НоменклатурнаяГруппа.Наименование ПОДОБНО &НаименованиеНоменклатурнаяГруппа";
			
			Запрос.УстановитьПараметр("НаименованиеПроизводитель", СтруктураРеквизитов.НоменклатураПроизводитель);
			Запрос.УстановитьПараметр("НаименованиеНоменклатурнаяГруппа", СтруктураРеквизитов.НоменклатураНоменклатурнаяГруппа);
			РезультатЗапроса = Запрос.Выполнить();
			
			Если НЕ РезультатЗапроса.Пустой() Тогда
				
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				ВыборкаДетальныеЗаписи.Следующий();
				Результат = ВыборкаДетальныеЗаписи.ссылка;
				
			КонецЕсли;	
			
			Если НЕ ЗначениеЗаполнено(Результат) Тогда
				
				Результат = ПредопределенноеЗначение("Справочник.Номенклатура.ТоварНаСумму");
				ТекстСообщения = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Номенклатура") + " " + СтруктураРеквизитов.НоменклатураНаименование + " " + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("не найдена.");
				Если Объект.СоздаватьНовуюНоменклатуру Тогда
					ТекстСообщения = ТекстСообщения + " " + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Будет создана новая.");		
				Иначе
					ТекстСообщения = ТекстСообщения + " " + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Установлен товар на сумму.");		
				КонецЕсли;
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, СтатусСообщения.Важное);
				
			КонецЕсли;		
		КонецЕсли;	
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции
Процедура ОтправитьВФайл(ФайлВыгрузки, СтрокаДанных)	
	ФайлВыгрузки.ЗаписатьСтроку(СтрокаДанных, символы.ПС);	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	ТекущаяСтраница = Элементы.СтраницыОбработки.ТекущаяСтраница;
	СтраницыПанели  = Элементы.СтраницыОбработки.ПодчиненныеЭлементы;
	СтраницаПанели  = СтраницыПанели.Индекс(ТекущаяСтраница);
	
	ТекущаяСтраница = Элементы.СтраницыВыгрузки.ТекущаяСтраница;
	СтраницыПанели  = Элементы.СтраницыВыгрузки.ПодчиненныеЭлементы;
	СтраницаПанели1 = СтраницыПанели.Индекс(ТекущаяСтраница);
	
	ТекущаяСтраница = Элементы.СтраницыЗагрузки.ТекущаяСтраница;
	СтраницыПанели  = Элементы.СтраницыЗагрузки.ПодчиненныеЭлементы;
	СтраницаПанели2 = СтраницыПанели.Индекс(ТекущаяСтраница);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Объект.ДатаНачала 	 = Объект.Период.ДатаНачала;
	Объект.ДатаОкончания = Объект.Период.ДатаОкончания;
	
КонецПроцедуры
Процедура ПодготовитьСпискиОтбора()
	
	ЕстьОтборы = ЛОЖЬ;
	
	СписокСкладов.Очистить();
	Для Каждого СтрокаТаблицОтбора Из Объект.ОтборПоСкладам Цикл
		СписокСкладов.Добавить(СтрокаТаблицОтбора.Склад);
		ЕстьОтборы = ИСТИНА;
	КонецЦикла;                	
	
	СписокПроизводителей.Очистить();
	Для Каждого СтрокаТаблицОтбора Из Объект.ОтборПоПроизводителям Цикл
		СписокПроизводителей.Добавить(СтрокаТаблицОтбора.Производитель);
		ЕстьОтборы = ИСТИНА;
	КонецЦикла;
	
	СписокНоменклатурныхГрупп.Очистить();
	Для Каждого СтрокаТаблицОтбора Из Объект.ОтборПоНоменклатурнымГруппам Цикл
		СписокНоменклатурныхГрупп.Добавить(СтрокаТаблицОтбора.НоменклатурнаяГруппа);
		ЕстьОтборы = ИСТИНА;
	КонецЦикла;
	
	СписокРегионов.Очистить();
	Для Каждого СтрокаТаблицОтбора Из Объект.ОтборПоРегионам Цикл
		СписокРегионов.Добавить(СтрокаТаблицОтбора.НоменклатурнаяГруппа);
		ЕстьОтборы = ИСТИНА;
	КонецЦикла;
	
КонецПроцедуры
&НаСервере
функция   ПолучитьОтносительныйАдресНаСервере();	
	Возврат ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ПодсистемаИЭИмпортЭкспортОтносительныйАдресФайлов");	
КонецФункции

&НаКлиенте
Процедура ПриЗакрытии()                                              // ПРИ ЗАКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)                                         // ПРИ ОТКРЫТИИ	
	
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
		Объект.ДатаНачала = НачалоДня(ОбщийМодульКлиент.ПользователяТекущаяДата() - 3600 * 24);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		Объект.ДатаОкончания = КонецДня(ОбщийМодульКлиент.ПользователяТекущаяДата());
	КонецЕсли;
	
	Объект.Период.ДатаНачала = Объект.ДатаНачала;
	Объект.Период.ДатаОкончания = Объект.ДатаОкончания;
	
	Попытка
		Если ЗначениеЗаполнено(СтраницаПанели)Тогда
			
			СтраницыПанели  = Элементы.СтраницыОбработки.ПодчиненныеЭлементы;
			ТекущаяСтраница = СтраницыПанели.получить(СтраницаПанели);
			Элементы.СтраницыОбработки.ТекущаяСтраница = ТекущаяСтраница;
			
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(СтраницаПанели1)Тогда
			
			СтраницыПанели  = Элементы.СтраницыВыгрузки.ПодчиненныеЭлементы;
			ТекущаяСтраница = СтраницыПанели.получить(СтраницаПанели1);
			Элементы.СтраницыВыгрузки.ТекущаяСтраница = ТекущаяСтраница;
			
		КонецЕсли;	
		
		Если ЗначениеЗаполнено(СтраницаПанели2)Тогда
			
			СтраницыПанели  = Элементы.СтраницыЗагрузки.ПодчиненныеЭлементы;
			ТекущаяСтраница = СтраницыПанели.получить(СтраницаПанели2);
			Элементы.СтраницыЗагрузки.ТекущаяСтраница = ТекущаяСтраница;
			
		КонецЕсли;	
		
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)          // ПРИ СОЗДАНИИ НА СЕРВЕРЕ
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("002700", ЭтаФорма, Отказ, );	
	
	Если НЕ Отказ Тогда
		
		Элементы.ВыгрузкаДанныхОРеализации.Заголовок =
		ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Данные о реализации это данные о движения товара на отдельном складе или в отдельной торговой точке с самостоятельным учетом. ") + Символы.ПС +
		ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Они включают в себя только данные по расходам, возвратам и списанию товаров за период.") + Символы.ПС +
		ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Деньги, состояние склада и взаиморасчетов не выгружаются.");
		
		Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьСобственныйПереводЭлементовИнтерфейса") Тогда
			ОбщийМодульСервер.ПеревестиРеквизитыФормы(ЭтаФорма);	
		КонецЕсли;
		
		ВестиУчетПоСкладам  = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетПоСкладам");	
		ВестиУчетПоКлиентам = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетПоКлиентам");
		ВестиУчетРегионов   = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетРегионов");
		Элементы.РегионНовыхКлиентов.Видимость 		= ВестиУчетПоКлиентам и ВестиУчетРегионов;
		Элементы.ВидЦенДляНовыхКлиентов.Видимость 	= ВестиУчетПоКлиентам и ПараметрыСеанса.ИспользоватьСложныйМеханизмЦенПС ;
		ВестиУчетПроизводителейНоменклатуры 		= ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетПроизводителейНоменклатуры");
		Элементы.ПараметрыНовогоКлиента.Видимость 	= ВестиУчетПоКлиентам;
		ИспользоватьСложныйМеханизмЦен				= ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьСложныйМеханизмЦен");
		
		УчетПоСериям = ПараметрыСеанса.ВестиУчетПоСериямНоменклатуры
		ИЛИ ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетСерийНоменклатурыТолькоПриПоступлении");
		
		ВестиУчетНоменклатурыВРазрезеНоменклатурныхГрупп = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетНоменклатурыВРазрезеНоменклатурныхГрупп");
		
		Если ВестиУчетРегионов Тогда
			ОписаниеОграниченияПоРегионам = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Отбор по Регионам для Клиентов и Поставщиков.") + Символы.ПС + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Не для производителей номенклатуры.");	
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
функция   ПроверитьСтрокуПоОтборам(СтрокаДокумента)
	
	Результат = ИСТИНА;
	
	Если НЕ СписокНоменклатурныхГрупп.Количество() = 0 
		И НЕ СписокНоменклатурныхГрупп.НайтиПоЗначению(СтрокаДокумента.Номенклатура.НоменклатурнаяГруппа) = Неопределено Тогда
		
		Результат = ЛОЖЬ;
	КонецЕсли;	
	
	Если НЕ СписокСкладов.Количество() = 0 
		И НЕ СписокСкладов.НайтиПоЗначению(СтрокаДокумента.Склад) = Неопределено Тогда
		
		Результат = ЛОЖЬ;
	КонецЕсли;	
	
	Если НЕ СписокПроизводителей.Количество() = 0 
		И НЕ СписокПроизводителей.НайтиПоЗначению(СтрокаДокумента.Номенклатура.Производитель) = Неопределено Тогда
		
		Результат = ЛОЖЬ;
	КонецЕсли;	
	
	Если НЕ СписокРегионов.Количество() = 0
		И ((ЗначениеЗаполнено(СтрокаДокумента.Номенклатура.Производитель)
		И НЕ СписокРегионов.НайтиПоЗначению(СтрокаДокумента.Номенклатура.Производитель.Регион) = Неопределено)
		ИЛИ (ЗначениеЗаполнено(СтрокаДокумента.Клиент) и не СписокРегионов.НайтиПоЗначению(СтрокаДокумента.Клиент = Неопределено))) Тогда
		
		Результат = ЛОЖЬ;
	КонецЕсли;	
	
	Возврат результат;
	
КонецФункции
Функция   ПроверитьЭлемент(Ссылка, ТипСправочника)
	
	Пропустить = ЛОЖЬ;
	
	Если ЕстьОтборы Тогда
		
		Если ВестиУчетПроизводителейНоменклатуры
			И НЕ СписокПроизводителей.Количество() = 0 
			И ТипЗнч(Ссылка) = Тип("СправочникСсылка.Номенклатура") Тогда
			
			Пропустить = СписокПроизводителей.НайтиПоЗначению(Ссылка.Производитель) = Неопределено;
			
		ИначеЕсли ВестиУчетПроизводителейНоменклатуры
			И НЕ СписокПроизводителей.Количество() = 0 
			И ТипЗнч(Ссылка) = Тип("СправочникСсылка.Производители") Тогда
			
			Пропустить = СписокПроизводителей.НайтиПоЗначению(Ссылка) = Неопределено;
			
		КонецЕсли;
		
		Если НЕ Пропустить		
			И ПараметрыСеанса.ВестиУчетНоменклатурыВРазрезеНоменклатурныхГруппПС
			И НЕ СписокНоменклатурныхГрупп.Количество() = 0 
			И ТипЗнч(Ссылка) = Тип("СправочникСсылка.Номенклатура") Тогда
			
			Пропустить = СписокНоменклатурныхГрупп.НайтиПоЗначению(Ссылка.НоменклатурнаяГруппа) = Неопределено;
			
		ИначеЕсли НЕ Пропустить		
			И ПараметрыСеанса.ВестиУчетНоменклатурыВРазрезеНоменклатурныхГруппПС
			И НЕ СписокНоменклатурныхГрупп.Количество() = 0 
			И ТипЗнч(Ссылка) = Тип("СправочникСсылка.НоменклатурныеГруппы") Тогда
			
			Пропустить = СписокНоменклатурныхГрупп.НайтиПоЗначению(Ссылка) = Неопределено;
			
		КонецЕсли;
		
		Если НЕ Пропустить
			И ВестиУчетПоСкладам
			И НЕ СписокСкладов.Количество() = 0 
			И ТипЗнч(Ссылка) = Тип("СправочникСсылка.Склады") Тогда
			
			Пропустить = СписокСкладов.НайтиПоЗначению(Ссылка) = Неопределено;
			
		КонецЕсли;
		
		Если НЕ Пропустить
			И ВестиУчетРегионов
			И НЕ СписокРегионов.Количество() = 0 
			И ТипЗнч(Ссылка) = Тип("СправочникСсылка.Регионы") Тогда
			
			Пропустить = СписокРегионов.НайтиПоЗначению(Ссылка) = Неопределено;
			
		ИначеЕсли НЕ Пропустить
			И ВестиУчетРегионов
			И НЕ СписокРегионов.Количество() = 0 
			И (ТипЗнч(Ссылка) = Тип("СправочникСсылка.Клиенты")
			ИЛИ ТипЗнч(Ссылка) = Тип("СправочникСсылка.Поставщики")) Тогда
			
			Пропустить = СписокРегионов.НайтиПоЗначению(Ссылка.Регион) = Неопределено;
			
		КонецЕсли;      	
	КонецЕсли;
	
	Возврат Пропустить;
	
КонецФункции // ПроверитьНоменклатуру

&НаСервере
Функция   САрхивировать(АдресФайла, ИмяФайлаTxt)
	
	Каталог = КаталогВременныхФайлов();		
	Константы.ПодсистемаИЭИмпортЭкспортОтносительныйАдресФайлов.Установить(АдресФайла);
	
	ЗаписьZIP =  Новый ЗаписьZipФайла(АдресФайла, , ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Данные руководителю"), , УровеньСжатияZIP.Максимальный);
	ЗаписьZIP.Добавить(Каталог + ИмяФайлаTxt);
	ЗаписьZIP.Записать();
	
	ОбщегоНазначения.СообщитьПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Выгрузка окончена."));
	
КонецФункции	
Функция   СпецКод(ТипСправочника, Ссылка) Экспорт
	
	Результат = "";
	
	ТипСправочника = ВРег(ТипСправочника);
	Если ТипСправочника = "НОМЕНКЛАТУРА"
		И ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьШтрихКоды")
		И НЕ ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("НеПроверятьУникальностьШтрихКода") Тогда
		
		Результат = ОбщийМодульПовтор.ПолучитьШтрихКодНоменклатурыИлиСерии(Ссылка, ЛОЖЬ);
		
	ИначеЕсли (ТипСправочника = "КЛИЕНТЫ" 
		ИЛИ ТипСправочника = "ПОСТАВЩИКИ" 
		ИЛИ ТипСправочника = "ОРГАНИЗАЦИИ" 
		ИЛИ ТипСправочника = "СОТРУДНИКИ")
		И ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ЗапретитьИспользоватьОдинаковыеКодыИНН") Тогда
		
		Результат = Ссылка.ОКПО;
		
	ИначеЕсли ТипСправочника = "СЕРИИНОМЕНКЛАТУРЫ"
		И ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьШтрихКоды")
		И НЕ ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("НеПроверятьУникальностьШтрихКода") Тогда
		
		Результат = ОбщийМодульПовтор.ПолучитьШтрихКодНоменклатурыИлиСерии(Ссылка, ИСТИНА);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // СпецКод

&НаСервере
Функция   Формирование(АвтоПериодДляВыгрузкиРуководителю = ЛОЖЬ, РуководительПодтвердилПрошлуюВыгрузку = ЛОЖЬ)
	
	Отказ = ЛОЖЬ;
	
	ПодготовитьСпискиОтбора();	
	ЧтоВыгружено.Очистить();
	
	ТекДок.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ ПоступленияТовара.Ссылка, ПоступленияТовара.Дата КАК Дата
	|ИЗ Документ.ПоступленияТовара КАК ПоступленияТовара
	|ГДЕ ПоступленияТовара.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания И ПоступленияТовара.Проведен = ИСТИНА  %%1 %%2 
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ ДвиженияДенег.Ссылка, ДвиженияДенег.Дата
	|ИЗ Документ.ДвиженияДенег КАК ДвиженияДенег
	|ГДЕ ДвиженияДенег.Проведен = ИСТИНА И ДвиженияДенег.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания %%7 
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ Инвентаризации.Ссылка, Инвентаризации.Дата
	|ИЗ Документ.Инвентаризации КАК Инвентаризации
	|ГДЕ Инвентаризации.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания И Инвентаризации.Проведен = ИСТИНА  %%6 
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ КорректировкиИРегистрацияОстатков.Ссылка, КорректировкиИРегистрацияОстатков.Дата
	|ИЗ Документ.КорректировкиИРегистрацияОстатков КАК КорректировкиИРегистрацияОстатков
	|ГДЕ КорректировкиИРегистрацияОстатков.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания И КорректировкиИРегистрацияОстатков.Проведен = ИСТИНА  
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ ПеремещенияТовара.Ссылка, ПеремещенияТовара.Дата
	|ИЗ Документ.ПеремещенияТовара КАК ПеремещенияТовара
	|ГДЕ ПеремещенияТовара.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания И ПеремещенияТовара.Проведен = ИСТИНА  %%5
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ РасходыТовара.Ссылка, РасходыТовара.Дата
	|ИЗ Документ.РасходыТовара КАК РасходыТовара
	|ГДЕ РасходыТовара.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания И РасходыТовара.Проведен = ИСТИНА %%3 %%4
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ ВыполненияРабот.Ссылка, ВыполненияРабот.Дата
	|ИЗ Документ.ВыполненияРабот КАК ВыполненияРабот
	|ГДЕ ВыполненияРабот.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания И ВыполненияРабот.Проведен = ИСТИНА
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ ОказанияУслугЗаВремя.Ссылка, ОказанияУслугЗаВремя.Дата
	|ИЗ Документ.ОказанияУслугЗаВремя КАК ОказанияУслугЗаВремя
	|ГДЕ ОказанияУслугЗаВремя.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания И ОказанияУслугЗаВремя.Проведен = ИСТИНА
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ УстановкиЦен.Ссылка, УстановкиЦен.Дата
	|ИЗ Документ.УстановкиЦен КАК УстановкиЦен
	|ГДЕ УстановкиЦен.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания И УстановкиЦен.Проведен = ИСТИНА
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ Комплектация.Ссылка, Комплектация.Дата
	|ИЗ Документ.Комплектация КАК Комплектация
	|ГДЕ Комплектация.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания И Комплектация.Проведен = ИСТИНА
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ ОтчетыКомиссионеров.Ссылка, ОтчетыКомиссионеров.Дата
	|ИЗ Документ.ОтчетыКомиссионеров КАК ОтчетыКомиссионеров
	|ГДЕ ОтчетыКомиссионеров.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания И ОтчетыКомиссионеров.Проведен = ИСТИНА
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ ПланыДоходовИРасходовДенег.Ссылка, ПланыДоходовИРасходовДенег.Дата
	|ИЗ Документ.ПланыДоходовИРасходовДенег КАК ПланыДоходовИРасходовДенег
	|ГДЕ ПланыДоходовИРасходовДенег.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ ПланыПродаж.Ссылка, ПланыПродаж.Дата
	|ИЗ Документ.ПланыПродаж КАК ПланыПродаж
	|ГДЕ ПланыПродаж.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ КоррекцияПартииПриобретенияРуководителем.Ссылка, КоррекцияПартииПриобретенияРуководителем.Дата
	|ИЗ Документ.КоррекцияПартииПриобретенияРуководителем КАК КоррекцияПартииПриобретенияРуководителем
	|ГДЕ КоррекцияПартииПриобретенияРуководителем.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания %%8
	|УПОРЯДОЧИТЬ ПО Дата" ;
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(Объект.ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(Объект.ДатаОкончания));
	
	Если ВестиУчетПоСкладам
		И НЕ Объект.ОтборПоСкладам.Количество() = 0 Тогда
		
		Запрос.Текст = стрзаменить(Запрос.Текст, "%%1", " И ПоступленияТовара.Склад В(&Склады) ");		
		Запрос.Текст = стрзаменить(Запрос.Текст, "%%3", " И РасходыТовара.Склад В(&Склады) ");		
		Запрос.Текст = стрзаменить(Запрос.Текст, "%%5", " И ПеремещенияТовара.Склад В(&Склады) ");		
		Запрос.Текст = стрзаменить(Запрос.Текст, "%%6", " И Инвентаризации.Склад В(&Склады) ");		
		Запрос.УстановитьПараметр("Склады", СписокСкладов);		
	КонецЕсли;
	
	Если ВыгружатьДокументыТаблицыДанных Тогда
		Запрос.Текст = стрзаменить(Запрос.Текст, "%%8", "ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ ТаблицыДанных.Ссылка, ТаблицыДанных.Дата
		|ИЗ Документ.ТаблицыДанных КАК ТаблицыДанных
		|ГДЕ ТаблицыДанных.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания ");
	КонецЕсли;
	
	Если ВестиУчетРегионов
		И НЕ Объект.ОтборПоРегионам.Количество() = 0 Тогда
		
		Запрос.Текст = стрзаменить(Запрос.Текст, "%%2", " И естьNull(ПоступленияТовара.КлиентПоставщик.Регион, &ПустойРегион) В (&Регионы) ");
		Запрос.Текст = стрзаменить(Запрос.Текст, "%%4", " И естьNull(РасходыТовара.КлиентПоставщик.Регион, &ПустойРегион) В (&Регионы) ");
		Запрос.Текст = стрзаменить(Запрос.Текст, "%%7", " И естьNull(ДвиженияДенег.КлиентПоставщик.Регион, &ПустойРегион) В (&Регионы) ");
		Запрос.УстановитьПараметр("Регионы", СписокРегионов);
		Запрос.УстановитьПараметр("ПустойРегион", Справочники.Регионы.ПустаяСсылка());		
	КонецЕсли;
	
	Запрос.Текст = стрзаменить(Запрос.Текст, "%%1", "");
	Запрос.Текст = стрзаменить(Запрос.Текст, "%%2", "");
	Запрос.Текст = стрзаменить(Запрос.Текст, "%%3", "");
	Запрос.Текст = стрзаменить(Запрос.Текст, "%%4", "");
	Запрос.Текст = стрзаменить(Запрос.Текст, "%%5", "");
	Запрос.Текст = стрзаменить(Запрос.Текст, "%%6", "");
	Запрос.Текст = стрзаменить(Запрос.Текст, "%%7", "");
	Запрос.Текст = стрзаменить(Запрос.Текст, "%%8", "");
	
	Если АвтоПериодДляВыгрузкиРуководителю Тогда
		
		ДатаНачала 	  = Константы.ДатаНачалаПериодаДляВыгрузкиРуководителю.Получить();
		ДатаОкончания = Константы.ДатаОкончанияПериодаДляВыгрузкиРуководителю.Получить();
		ДатаНачалаПериодаПодтвержденнаяРуководителем    = Константы.ДатаНачалаПериодаПодтвержденнаяРуководителем.Получить();
		ДатаОкончанияПериодаПодтвержденнаяРуководителем = Константы.ДатаОкончанияПериодаПодтвержденнаяРуководителем.Получить();
		
		Если НЕ РуководительПодтвердилПрошлуюВыгрузку Тогда
			Если ДатаНачала > ДатаНачалаПериодаПодтвержденнаяРуководителем Тогда
				ДатаНачала = ДатаНачалаПериодаПодтвержденнаяРуководителем;
			КонецЕсли;
			Если ДатаОкончания < ДатаОкончанияПериодаПодтвержденнаяРуководителем Тогда
				ДатаОкончания = ДатаОкончанияПериодаПодтвержденнаяРуководителем;
			КонецЕсли;
		КонецЕсли;
		
	Иначе		
		ДатаНачала    = НачалоДня(Объект.ДатаНачала);
		ДатаОкончания = КонецДня(Объект.ДатаОкончания);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);	
	Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ТекДок.ДобавитьСтроку(СокрЛП(Метаданные.Версия));
		
		ВыборкаДанных = РезультатЗапроса.Выбрать();
		СчетчикСтрок = 0;
		
		Пока ВыборкаДанных.Следующий() Цикл		
			СчетчикСтрок = СчетчикСтрок + 1;
			
			МассивЭлементов = Новый Массив;
			Отказ = ВыгрузитьДокумент(ВыборкаДанных.Ссылка, ВыборкаДанных.Ссылка.Метаданные().Имя, МассивЭлементов);
			
			Если отказ Тогда	
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		ОбщегоНазначения.СообщитьПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Нет данных в этом периоде!"));
		Отказ = ИСТИНА;		
	КонецЕсли;
	
	Если АвтоПериодДляВыгрузкиРуководителю
		И РуководительПодтвердилПрошлуюВыгрузку
		И НЕ отказ Тогда
		
		Константы.ДатаНачалаПериодаПодтвержденнаяРуководителем.Установить(ДатаНачала);	
		Константы.ДатаОкончанияПериодаПодтвержденнаяРуководителем.Установить(ДатаОкончания);
		Дата = ОбщийМодульСервисСервер.ПользователяТекущаяДата();
		Константы.ДатаНачалаПериодаДляВыгрузкиРуководителю.Установить(Дата);
		Константы.ДатаОкончанияПериодаДляВыгрузкиРуководителю.Установить(Дата);
	КонецЕсли;
	
	Возврат НЕ Отказ;
	
КонецФункции
