// Суров С.В <s_surov@mail.ru>

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РазмерПорции = Параметры.РазмерПорции;
	КоличествоПовторений = Параметры.КоличествоПовторений;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	Результат = Новый Структура;
	Результат.Вставить("РазмерПорции", РазмерПорции);
	Результат.Вставить("КоличествоПовторений", КоличествоПовторений);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Оповестить("РасширеннаяНастройка", Неопределено);
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры
