//sza140420-1527  
//sza131005-0219 : 
&НаКлиенте
Процедура ПриЗакрытии()                                         // ПРИ ЗАКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)                                    // ПРИ ОТКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("001850", ЭтаФорма, Отказ, );
	
	Если НЕ Отказ Тогда
		ОбщийМодульСервисСервер.ОформитьФорматКоличества(Элементы.ТовараВКоличестве, , ИСТИНА);
		Элементы.Адрес.Видимость = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьОтдельныеПоляАдресаИТелефонаВЗаказахКлиентов");	
		ОбщийМодульСервер.ОбеспечитьСписокОтборов(Список, "ЗаказКлиента");	
	КонецЕсли;
	
КонецПроцедуры



