//sza141112-1521
//sza141016-0102 : 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаконченаПервоначальнаяНастройка = Константы.ЗаконченаПервоначальнаяНастройка.Получить();
	попытка	
		ЯзыкА = Справочники.Языки.English.ПолучитьОбъект();
		ЯзыкА.Комментарий 	= "English language EN";
		ЯзыкА.Наименование 	= "English - Английский (EN)";
		ЯзыкА.Записать();
	исключение
		сообщить(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Убедитесь, что установлена версия платформы 1С не ниже 8.2.19 !"));
	конецпопытки;
	
	ЯзыкУ = Справочники.Языки.Український.ПолучитьОбъект();
	ЯзыкУ.Комментарий 	= "Українська мова UA";
	ЯзыкУ.Наименование 	= "Українська - Ukrainian (UK)";
	ЯзыкУ.Записать();
	
	ЯзыкР = Справочники.Языки.Русский.ПолучитьОбъект();
	ЯзыкР.Комментарий 	= "Русский язык RU";
	ЯзыкР.Наименование 	= "Русский - Russian (RU)";
	ЯзыкР.Записать();
	
	ЯзыкР = Справочники.Языки.Румынский.ПолучитьОбъект();
	ЯзыкР.Комментарий 	= "Român RO";
	ЯзыкР.Наименование 	= "Român - Румынский (RU)";
	ЯзыкР.Записать();
	
	ЯзыкР = Справочники.Языки.Белорусский.ПолучитьОбъект();
	ЯзыкР.Комментарий 	= "Беларускі BL";
	ЯзыкР.Наименование 	= "Беларускі - Белорусский (BL)";
	ЯзыкР.Записать();
	
	ЯзыкР = Справочники.Языки.Китайский.ПолучитьОбъект();
	ЯзыкР.Комментарий 	= "中国的 ZH";
	ЯзыкР.Наименование 	= "中国的 - Китайский (ZH)";
	ЯзыкР.Записать();
	
	ЯзыкР = Справочники.Языки.Болгарский.ПолучитьОбъект();
	ЯзыкР.Комментарий 	= "Български BG";
	ЯзыкР.Наименование 	= "Български - Болгарский (BG)";
	ЯзыкР.Записать();
	
	ЯзыкР = Справочники.Языки.Казахский.ПолучитьОбъект();
	ЯзыкР.Комментарий 	= "Қазақ KK";
	ЯзыкР.Наименование 	= "Қазақ - Казахский (KK)";
	ЯзыкР.Записать();
	
	ЯзыкР = Справочники.Языки.Немецкий.ПолучитьОбъект();
	ЯзыкР.Комментарий 	= "Deutsch DE";
	ЯзыкР.Наименование 	= "Deutsch - Немецкий (DE)";
	ЯзыкР.Записать();
	
	ЯзыкР = Справочники.Языки.Польский.ПолучитьОбъект();
	ЯзыкР.Комментарий 	= "Polski PL";
	ЯзыкР.Наименование 	= "Polski - Польский (PL)";
	ЯзыкР.Записать();
	
	ЯзыкР = Справочники.Языки.Тайский.ПолучитьОбъект();
	ЯзыкР.Комментарий 	= "ภาษาไทย  TH";
	ЯзыкР.Наименование 	= "ภาษาไทย - Тайский (TH)";
	ЯзыкР.Записать();
	
	ТекущийКодЛокализации = Врег(ТекущийКодЛокализации());
	ПоддерживатьИныеЯзыкиКромеРусского = Константы.ПоддерживатьИныеЯзыкиКромеРусского.Получить();
	Константы.ПоддерживатьИныеЯзыкиКромеРусского.Установить(ИСТИНА);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыберитеВашЯзыкПриИзменении(Элемент)
	
	Русский = ЗначениеЗаполнено(ВыберитеВашЯзык) И ВыберитеВашЯзык = ПредопределенноеЗначение("Справочник.Языки.Русский");
	
	Если НЕ Русский Тогда
		состояние(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ждите, Локализация.. / Wait for localiZation.."), , ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ждите"));
	КонецЕсли;

	ОбновитьТекущийЯзыкИнтерфейса(ВыберитеВашЯзык);
	ОбщийМодульКлиент.ДобавитьСобытиеЖурнала(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Сменил язык интерфейса"), 2);
	
	Закрыть();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьТекущийЯзыкИнтерфейса(Знач ВыберитеВашЯзыкБК = Неопределено)
	
	РусскийЯзык = ПредопределенноеЗначение("Справочник.Языки.Русский");
	Русский = ЗначениеЗаполнено(ВыберитеВашЯзыкБК) И ВыберитеВашЯзыкБК = РусскийЯзык;
	
	Если НЕ Русский Тогда
		
		ОбщийМодульТекстСервер.ЗагрузитьТекстыЯзыкаИзМакета("Макет" + ВыберитеВашЯзыкБК.Код, ВыберитеВашЯзыкБК);
		
		Если ВыберитеВашЯзыкБК = справочники.Языки.Український Тогда
			
			Валюта = Справочники.Валюты.ОсновнаяВалюта.ПолучитьОбъект();
			Валюта.Наименование = "грн.";
			Валюта.Код = "980";
			Валюта.Записать();
			
		ИначеЕсли ВыберитеВашЯзыкБК = справочники.Языки.English 
			ИЛИ ВыберитеВашЯзыкБК = справочники.Языки.Китайский 
			ИЛИ ВыберитеВашЯзыкБК = справочники.Языки.Тайский Тогда
			
			Валюта = Справочники.Валюты.ОсновнаяВалюта.ПолучитьОбъект();
			Валюта.Наименование = "usd";
			Валюта.Код = "840";
			Валюта.Записать();
			
		ИначеЕсли ВыберитеВашЯзыкБК = справочники.Языки.Болгарский
			ИЛИ ВыберитеВашЯзыкБК = справочники.Языки.Болгарский 
			ИЛИ ВыберитеВашЯзыкБК = справочники.Языки.Немецкий
			ИЛИ ВыберитеВашЯзыкБК = справочники.Языки.Польский Тогда
			
			Валюта = Справочники.Валюты.ОсновнаяВалюта.ПолучитьОбъект();
			Валюта.Наименование = "eur";
			Валюта.Код = "978";
			Валюта.Записать();
			
		КонецЕсли;
		
		Константы.ТекущийЯзыкИнтерфейса.Установить(ВыберитеВашЯзыкБК);
		Константы.ПоддерживатьИныеЯзыкиКромеРусского.Установить(ИСТИНА);
		ПараметрыСеанса.ТекущийЯзыкИнтерфейсаПрограммы = ВыберитеВашЯзыкБК;	
		ОбновитьПовторноИспользуемыеЗначения();
		
	Иначе
		Константы.ТекущийЯзыкИнтерфейса.Установить(РусскийЯзык);
		ПараметрыСеанса.ТекущийЯзыкИнтерфейсаПрограммы = РусскийЯзык;
		Константы.ПоддерживатьИныеЯзыкиКромеРусского.Установить(ЛОЖЬ);
		
	КонецЕсли;      	
	
	ОбщийМодульСервер.ЗадатьНаименованияОбъектамНаДругомЯзыке(); //и в случае русского тоже
	
КонецПроцедуры 
