// sza160229-0426
// sza160218-0017

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	Процедура НаПечать(ТабДок, Ссылка) Экспорт

		Макет = Справочники.НаправленияДеятельности.ПолучитьМакет("НаПечать");

		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	НаправленияДеятельности.ВидДеятельности,
		|	НаправленияДеятельности.Код,
		|	ВЫРАЗИТЬ(НаправленияДеятельности.Комментарий КАК СТРОКА(1000)) КАК Комментарий,
		|	НаправленияДеятельности.Наименование,
		|	НаправленияДеятельности.ПроВидыДеятельности,
		|	НаправленияДеятельности.ПроЗакрепленныеСотрудники,
		|	НаправленияДеятельности.РуководительНаправления,
		|	НаправленияДеятельности.ВидыДеятельности.(
		|		НомерСтроки,
		|		ВидДеятельности,
		|		Основной,
		|		ОСтроке
		|	),
		|	НаправленияДеятельности.ЗакрепленныеСотрудники.(
		|		НомерСтроки,
		|		Сотрудник,
		|		РольСотрудника,
		|		ОСтроке
		|	)
		|ИЗ Справочник.НаправленияДеятельности КАК НаправленияДеятельности
		|ГДЕ НаправленияДеятельности.Ссылка В (&Ссылка)";
		Запрос.Параметры.Вставить("Ссылка", Ссылка);

		Выборка = Запрос.Выполнить().Выбрать();

		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		Шапка = Макет.ПолучитьОбласть("Шапка");
		ОбластьВидыДеятельностиШапка = Макет.ПолучитьОбласть("ВидыДеятельностиШапка");
		ОбластьВидыДеятельности = Макет.ПолучитьОбласть("ВидыДеятельности");
		ОбластьЗакрепленныеСотрудникиШапка = Макет.ПолучитьОбласть("ЗакрепленныеСотрудникиШапка");
		ОбластьЗакрепленныеСотрудники = Макет.ПолучитьОбласть("ЗакрепленныеСотрудники");
		ТабДок.Очистить();
		ВставлятьРазделительСтраниц = Ложь;

		Пока Выборка.Следующий() Цикл
			Если ВставлятьРазделительСтраниц Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;

			ТабДок.Вывести(ОбластьЗаголовок);
			Шапка.Параметры.Заполнить(Выборка);
			ТабДок.Вывести(Шапка, Выборка.Уровень());
			ТабДок.Вывести(ОбластьВидыДеятельностиШапка);
			ВыборкаВидыДеятельности = Выборка.ВидыДеятельности.Выбрать();

			Пока ВыборкаВидыДеятельности.Следующий() Цикл
				ОбластьВидыДеятельности.Параметры.Заполнить(ВыборкаВидыДеятельности);
				ТабДок.Вывести(ОбластьВидыДеятельности, ВыборкаВидыДеятельности.Уровень());

			КонецЦикла;

			ТабДок.Вывести(ОбластьЗакрепленныеСотрудникиШапка);
			ВыборкаЗакрепленныеСотрудники = Выборка.ЗакрепленныеСотрудники.Выбрать();
			Пока ВыборкаЗакрепленныеСотрудники.Следующий() Цикл
				ОбластьЗакрепленныеСотрудники.Параметры.Заполнить(ВыборкаЗакрепленныеСотрудники);
				ТабДок.Вывести(ОбластьЗакрепленныеСотрудники, ВыборкаЗакрепленныеСотрудники.Уровень());

			КонецЦикла;

			ВставлятьРазделительСтраниц = Истина;
		КонецЦикла;

	КонецПроцедуры

	Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)

		Если ОбщийМодульПовтор.ВывестиНаименованияНаДругомЯзыке() Тогда
			ВозможноеПредставление = ОбщийМодульПовтор.получитьПредставлениеНаЯзыке(Данные.ссылка, , ИСТИНА);
			Если НЕ ВозможноеПредставление = Неопределено Тогда
				Представление = ВозможноеПредставление;
				СтандартнаяОбработка = ЛОЖЬ;
			КонецЕсли;
		КонецЕсли;

	КонецПроцедуры

#КонецЕсли
