#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// sza151213-0132
// sza151022-2131
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ВидыДеятельности") Тогда
		Комментарий  = ДанныеЗаполнения.Комментарий;
		Наименование = ДанныеЗаполнения.Наименование;
		СтрокаВидаДеятельности = ВидыДеятельности.Добавить();
		СтрокаВидаДеятельности.ВидДеятельности = ДанныеЗаполнения.Ссылка;
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ)

	Если НЕ Отказ
		И НЕ ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("МассоваяЗагрузка", ИСТИНА)
		И ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ФормироватьОписаниеТаблицОбъектовДляИхСписков") Тогда

		ОбщийМодульСервер.ОформитьОписаниеТаблицы(ЭтотОбъект, "ЗакрепленныеСотрудники", "Сотрудник", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("закрепленных сотрудников"), "РуководительНаправления");
		ОбщийМодульСервер.ОформитьОписаниеТаблицы(ЭтотОбъект, "ВидыДеятельности", "ВидДеятельности", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Видов деятельности"), "ВидДеятельности");
	КонецЕсли;

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Комментарий = "";
КонецПроцедуры

#КонецЕсли
