// sza151213-0132 
// sza151022-2131 
Процедура ПриКопировании(ОбъектКопирования)
	Комментарий = "";
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ВидыДеятельности") Тогда
		Комментарий  = ДанныеЗаполнения.Комментарий;
		Наименование = ДанныеЗаполнения.Наименование;
		
		СтрокаВидаДеятельности = ВидыДеятельности.Добавить();
		СтрокаВидаДеятельности.ВидДеятельности = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ФормироватьОписаниеТаблицОбъектовДляИхСписков") Тогда				
		ОбщийМодульСервер.ОформитьОписаниеТаблицы(ЭтотОбъект, "ЗакрепленныеСотрудники", "Сотрудник", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("закрепленных сотрудников"), "РуководительНаправления");
		ОбщийМодульСервер.ОформитьОписаниеТаблицы(ЭтотОбъект, "ВидыДеятельности", "ВидДеятельности", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("видов деятельности"), "ВидДеятельности");
	КонецЕсли;
	
КонецПроцедуры
