// Суров С.В <s_surov@mail.ru>

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	УзелОбмена = ПараметрКоманды;
	
	Состояние(
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"%1 " + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("начат обмен данными с сайтом"),
			Формат(МенеджерОборудованияКлиентПереопределяемый.ДатаСеанса(), "ДЛФ=DT"))
		,,
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("по узлу обмена") + """%1""...",
			УзелОбмена));
	
	ОбменВыполненСервер(УзелОбмена);
		
	ПоказатьОповещениеПользователя(
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"%1 ""%2""",
			Формат(МенеджерОборудованияКлиентПереопределяемый.ДатаСеанса(), "ДЛФ=DT"),
			УзелОбмена) 
		,,
		ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Обмен с сайтом завершен"),
		БиблиотекаКартинок.ЗнакИнформацияБольшойОранжевый);
		
	Оповестить("ЗавершенСеансОбменаССайтом");

КонецПроцедуры

&НаСервере
Функция ОбменВыполненСервер(УзелОбмена)

	Если ОбменССайтомПовтИсп.ПолучитьЭтотУзелПланаОбмена(УзелОбмена) Тогда
		
		Возврат ЛОЖЬ;
		
	КонецЕсли;
	
	Если УзелОбмена.ПометкаУдаления Тогда
		
		Возврат ЛОЖЬ;
		
	КонецЕсли;
	
	ОбменССайтомСобытия.ВыполнитьОбмен(УзелОбмена, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Интерактивный обмен"));
	
	Возврат ИСТИНА;
	
КонецФункции
