// sza151113-0312 фио
// sza150707-0254 

&НаКлиенте
Процедура ПриЗакрытии()
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьСобственныйПереводЭлементовИнтерфейса") Тогда
		ОбщийМодульСервер.ПеревестиРеквизитыФормы(ЭтаФорма);	
	КонецЕсли;
	
	ФизическоеЛицоПриИзмененииНаСервере();
	Элементы.ГруппаФИО.Видимость = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьФИОКонтрагентов");
КонецПроцедуры

&НаКлиенте
Процедура ФизическоеЛицоПриИзменении(Элемент)
	ФизическоеЛицоПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ФизическоеЛицоПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Запись.ФизическоеЛицо) Тогда
		ДатаРождения = Запись.ФизическоеЛицо;
		Имя = Запись.ФизическоеЛицо.Имя;
		Фамилия = Запись.ФизическоеЛицо.Фамилия;
		Отчество = Запись.ФизическоеЛицо.Отчество;
		
	Иначе
		ДатаРождения = '00010101';
		Имя = "";
		Фамилия = "";
		Отчество = "";
	КонецЕсли;
	
КонецПроцедуры
