//sza131119-1406

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура("ПараметрКоманды", ПараметрКоманды);
	ПараметрыФормы.Вставить("ТипЗаметки", ПредопределенноеЗначение("Перечисление.ТипыЗаметок.Напоминание"));
	ОткрытьФорму("Справочник.ЗаметкиИНапоминания.Форма.ФормаЗаписи", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры
