// sza150825-1457 

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("000200", , , );
	
	Если НЕ Отказ Тогда	
		Если НЕ ОбщийМодульСервер.ПроверитьДокументПроведен(ПараметрКоманды) Тогда
			Если ОбщийМодульСервер.ПроверитьПользовательИмеетПравоМенятьЦены() Тогда
				
				РазмерСкидки = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("РазмерСкидкиДляДокументаРеализации");
				
				Если РазмерСкидки = 0 Тогда				
					ПоказатьВводЧисла(Новый ОписаниеОповещения("ОбработкаКомандыЗавершение", ЭтотОбъект, Новый Структура("ПараметрКоманды, РазмерСкидки", ПараметрКоманды, РазмерСкидки)), РазмерСкидки, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Процент скидки") + ": ", 12, 6);
				Иначе
					ПрименитьСкидку(РазмерСкидки, ПараметрКоманды);
				КонецЕсли;
				
			Иначе
				Сообщить(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("У Вас нет права менять цены!"), СтатусСообщения.Внимание);
			КонецЕсли;
			
		Иначе
			Сообщить(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Документ уже проведен. Изменения не произведены."), СтатусСообщения.Информация);
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрименитьСкидку(Знач РазмерСкидки, ПараметрКоманды)
	
	Состояние(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Пересчет цен для таблицы товаров с учетом скидки..") + РазмерСкидки);
	ОбщийМодульКлиент.ДобавитьСобытиеЖурнала(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Пересчитал Цены товаров с учетом скидки") + " " + РазмерСкидки, 2, ПараметрКоманды);
	ОбщийМодульКлиент.ПересчитатьТоВары(ПараметрКоманды, РазмерСкидки, , , ИСТИНА);		
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКомандыЗавершение(Число, ДополнительныеПараметры) Экспорт
	
	Если НЕ Число = Неопределено Тогда
		ПараметрКоманды = ДополнительныеПараметры.ПараметрКоманды;
		ПрименитьСкидку(Число, ПараметрКоманды);	
	КонецЕсли;
	
КонецПроцедуры
