//sza140106-2319 : 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0, Запись.Ответственный, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1, Запись.Ответственный, Истина);
КонецПроцедуры

&НаКлиенте
Процедура Сегодня(Команда)
	запись.Период = ОбщийМодульСервисСервер.ПользователяТекущаяДата();
КонецПроцедуры

&НаКлиенте
Процедура НачалоМесяцаК(Команда)
	запись.Период = НачалоМесяца(ОбщийМодульСервисСервер.ПользователяТекущаяДата());
КонецПроцедуры

&НаКлиенте
Процедура НачалоГодаК(Команда)
	запись.Период = НачалоГода(ОбщийМодульСервисСервер.ПользователяТекущаяДата());
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Запись.ДополнительныйРеквизит)
		и не запись.ДополнительныйРеквизит.Периодический Тогда
		
		Элементы.ГруппаПериода.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры
