//sza140831-0334 : 
//sza140106-2319 : 
&НаКлиенте
Процедура НачалоГодаК(Команда)
	запись.Период = НачалоГода(ОбщийМодульСервисСервер.ПользователяТекущаяДата());
КонецПроцедуры

&НаКлиенте
Процедура НачалоМесяцаК(Команда)
	запись.Период = НачалоМесяца(ОбщийМодульСервисСервер.ПользователяТекущаяДата());
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1, Запись.Ответственный, ИСТИНА);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0, Запись.Ответственный, ИСТИНА);
	ОбновитьВидимостьКнопок();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Запись.ДополнительныйРеквизит)
		И НЕ Запись.ДополнительныйРеквизит.Периодический Тогда
		
		Элементы.ГруппаПериода.Видимость = ЛОЖЬ;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Сегодня(Команда)
	запись.Период = ОбщийМодульСервисСервер.ПользователяТекущаяДата();
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныйРеквизитПриИзменении(Элемент)
	ОбновитьВидимостьКнопок();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьКнопок()
	
	Если ЗначениеЗаполнено(Запись.ДополнительныйРеквизит) Тогда		
		ТипДополнительногоРеквизита = ОбщийМодульКлиент.получитьЗначениеРеквизита(Запись.ДополнительныйРеквизит, "ТипДополнительногоРеквизита");
		
		Если ТипДополнительногоРеквизита = ПредопределенноеЗначение("Перечисление.ТипыДополнительныхРеквизитов.ЗначениеИзСправочника")
			ИЛИ ТипДополнительногоРеквизита = ПредопределенноеЗначение("Перечисление.ТипыДополнительныхРеквизитов.СсылкаНаЭлементСправочника")
			ИЛИ ТипДополнительногоРеквизита = ПредопределенноеЗначение("Перечисление.ТипыДополнительныхРеквизитов.СсылкаНаДокумент") Тогда
			
			Элементы.ЗначениеРеквизита.КнопкаВыбора  = ИСТИНА;
			Элементы.ЗначениеРеквизита.КнопкаОчистки = ИСТИНА;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеРеквизитаОчистка(Элемент, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Запись.ДополнительныйРеквизит) Тогда
		ТипДополнительногоРеквизита = ОбщийМодульКлиент.получитьЗначениеРеквизита(Запись.ДополнительныйРеквизит, "ТипДополнительногоРеквизита");
		
		Если ТипДополнительногоРеквизита = ПредопределенноеЗначение("Перечисление.ТипыДополнительныхРеквизитов.СсылкаНаЭлементСправочника")
			ИЛИ ТипДополнительногоРеквизита = ПредопределенноеЗначение("Перечисление.ТипыДополнительныхРеквизитов.СсылкаНаДокумент") Тогда
			СтандартнаяОбработка = ЛОЖЬ;
			
			Запись.ЗначениеРеквизита = Неопределено;		
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеРеквизитаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Запись.ДополнительныйРеквизит) Тогда
		
		ТипДополнительногоРеквизита = ОбщийМодульКлиент.получитьЗначениеРеквизита(Запись.ДополнительныйРеквизит, "ТипДополнительногоРеквизита");
		Если ТипДополнительногоРеквизита = ПредопределенноеЗначение("Перечисление.ТипыДополнительныхРеквизитов.СсылкаНаЭлементСправочника") Тогда
			СтандартнаяОбработка = ЛОЖЬ;
			
			Если Запись.ЗначениеРеквизита = Неопределено Тогда
				ТипРеквизита = ВыбратьИзСписка(ОбщийМодульКлиент.ПолучитьСписокИзМетаданных(ИСТИНА));
				Если НЕ ТипРеквизита = Неопределено Тогда
					Запись.ЗначениеРеквизита = ПредопределенноеЗначение("Справочник." + ТипРеквизита.Значение + ".ПустаяСсылка");	
				КонецЕсли;
			КонецЕсли;
			ВвестиЗначение(Запись.ЗначениеРеквизита, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите значение") + ":");
			
		ИначеЕсли ТипДополнительногоРеквизита = ПредопределенноеЗначение("Перечисление.ТипыДополнительныхРеквизитов.СсылкаНаДокумент") Тогда
			СтандартнаяОбработка = ЛОЖЬ;
			
			Если Запись.ЗначениеРеквизита = Неопределено Тогда
				ТипРеквизита = ВыбратьИзСписка(ОбщийМодульКлиент.ПолучитьСписокИзМетаданных(ЛОЖЬ));
				Если НЕ ТипРеквизита = Неопределено Тогда
					Запись.ЗначениеРеквизита = ПредопределенноеЗначение("Документ." + ТипРеквизита.Значение + ".ПустаяСсылка");	
				КонецЕсли;
			КонецЕсли;
			ВвестиЗначение(Запись.ЗначениеРеквизита, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите значение") + ":");
			
		ИначеЕсли ТипДополнительногоРеквизита = ПредопределенноеЗначение("Перечисление.ТипыДополнительныхРеквизитов.ЗначениеИзСправочника") Тогда
			СтандартнаяОбработка = ЛОЖЬ;
		
			Запись.ЗначениеРеквизита = ПредопределенноеЗначение("Справочник.НаборЗначенийДополнительныхРеквизитов.ПустаяСсылка");
			ПараметрыФормы = Новый Структура("Владелец", Запись.ДополнительныйРеквизит);
			ФормаВыбора = ПолучитьФорму("Справочник.НаборЗначенийДополнительныхРеквизитов.Форма.ФормаВыбора", ПараметрыФормы, ЭтаФорма);
			ФормаВыбора.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите значение") + ":";
			Запись.ЗначениеРеквизита = ФормаВыбора.ОткрытьМодально();
		
		КонецЕсли; 	
	КонецЕсли;
	
КонецПроцедуры
