//sza140601-2055 SZA: 
//sza130915-1735 : 

Процедура ПередЗаписью(Отказ)
	
	Если НЕ Отказ 
		И Не ПометкаУдаления Тогда
		
		Если не ЭтоГруппа 
			и Модифицированность() ТОгда
			
			Если НЕ ЗначениеЗаполнено(НаименованиеДляПечати) Тогда
				НаименованиеДляПечати = Наименование;	
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Родитель) 
				и ЗначениеЗаполнено(Родитель.ВидЦен)
				и (не ЗначениеЗаполнено(ВидЦен) или ВидЦен <> Родитель.ВидЦен) Тогда
				
				ВидЦен = Родитель.ВидЦен;
			КонецЕсли;
			
			Отказ = ОбщийМодульСервер.ПроверитьУникальностьОКПО(Отказ, "Поставщики", ЭтотОбъект.ОКПО, ЭтотОбъект.Ссылка);		
			Отказ = ОбщийМодульСервер.ПроверитьУникальностьНаименование(Отказ, "Поставщики", ЭтотОбъект.Наименование, ЭтотОбъект.Ссылка);
			
		ИначеЕсли Модифицированность() тогда
			
			Если НЕ Отказ 
				И ЗначениеЗаполнено(Ссылка)
				И ЗначениеЗаполнено(ВидЦен) Тогда
				
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ Поставщики.Ссылка
				|ИЗ Справочник.Поставщики КАК Поставщики
				|ГДЕ Поставщики.Родитель = &Родитель И Поставщики.ВидЦен <> &ВидЦен";
				
				Запрос.УстановитьПараметр("Родитель", Ссылка);
				Запрос.УстановитьПараметр("ВидЦен", ВидЦен);  			
				
				РезультатЗапроса = Запрос.Выполнить();
				если не РезультатЗапроса.Пустой() тогда
					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					Счетчик  = 0;
					
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						ПоставщикОбъект = ВыборкаДетальныеЗаписи.ссылка.ПолучитьОбъект();
						ПоставщикОбъект.ВидЦен = ВидЦен;
						ПоставщикОбъект.Записать();
						Счетчик = Счетчик  + 1;
					КонецЦикла;
					
					Если не Счетчик =0 Тогда
						если ОбщийМодульПовторВТеченииСервера.ВыводитьСообщенияМожно() тогда
							ОбщийМодульСервисСервер.ДобавитьСообщениеПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Вид цен установлен для") + " " + Счетчик + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке(" Поставщиков этой группы."), , ссылка);
							//Сообщение = Новый СообщениеПользователю;
							//Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Вид цен установлен для") + " " + Счетчик + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке(" Поставщиков этой группы.");
							//Сообщение.Сообщить();                                               	
						КонецЕсли;
						
					КонецЕсли;	
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		ОбщийМодульСервер.ПроверитьСменуНаименованияНаТекущемЯзыке(Наименование, Ссылка, , Отказ);
		ОбщийМодульСервер.ПроверитьСменуНаименованияНаТекущемЯзыке(НаименованиеДляПечати, Ссылка, "НаименованиеДляПечати", Отказ);				
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ЭтотОбъект.комментарий = "";
	ЭтотОбъект.НаименованиеДляПечати = "";
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Клиенты") Тогда
		// Заполнение шапки
		Адрес = ДанныеЗаполнения.Адрес;
		ВидЦен = ДанныеЗаполнения.ВидЦен;
		Комментарий = ДанныеЗаполнения.Комментарий;
		МФО = ДанныеЗаполнения.МФО;
		Наименование = ДанныеЗаполнения.Наименование;
		НаименованиеБанка = ДанныеЗаполнения.НаименованиеБанка;
		НаименованиеДляПечати = ДанныеЗаполнения.НаименованиеДляПечати;
		НомерСчета = ДанныеЗаполнения.НомерСчета;
		ОКПО = ДанныеЗаполнения.ОКПО;
		ОсновнаяВалюта = ДанныеЗаполнения.ОсновнаяВалюта;
		ПравовойСтатус = ДанныеЗаполнения.ПравовойСтатус;
		Регион = ДанныеЗаполнения.Регион;
		Склад = ДанныеЗаполнения.Склад;
		Телефон = ДанныеЗаполнения.Телефон;
		ХранилищеДенег = ДанныеЗаполнения.ХранилищеДенег;
		ЭлектроннаяПочта = ДанныеЗаполнения.ЭлектроннаяПочта;
		ЭтоСотрудник = ДанныеЗаполнения.ЭтоСотрудник;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Производители") Тогда
		// Заполнение шапки
		Адрес = ДанныеЗаполнения.Адрес;
		Комментарий = ДанныеЗаполнения.Комментарий;
		Наименование = ДанныеЗаполнения.Наименование;
		Регион = ДанныеЗаполнения.Регион;
		Производитель = ДанныеЗаполнения.Ссылка;
		Телефон = ДанныеЗаполнения.Телефон;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Сотрудники") Тогда
		// Заполнение шапки
		Адрес = ДанныеЗаполнения.Адрес;
		Комментарий = ДанныеЗаполнения.Комментарий;
		Наименование = ДанныеЗаполнения.Наименование;
		ОКПО = ДанныеЗаполнения.ОКПО;
		Телефон = ДанныеЗаполнения.Телефон;
		ХранилищеДенег = ДанныеЗаполнения.ХранилищеДенег;
		ЭлектроннаяПочта = ДанныеЗаполнения.ЭлектроннаяПочта;
		ЭтоСотрудник = Истина;
	КонецЕсли;
	
КонецПроцедуры
