// sza140606-0026  
Процедура ОбновитьОтборПоПодразделению()

	список.Параметры.УстановитьЗначениеПараметра("ОтборПоПодразделению", ОтборПоПодразделению);
	список.Параметры.УстановитьЗначениеПараметра("НеИспользоватьОтборПоПодразделению", НЕ ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетПодразделений") ИЛИ НЕ ЗначениеЗаполнено(ОтборПоПодразделению));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоПодразделениюПриИзменении(Элемент)
	ОбновитьОтборПоПодразделению();	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
	ОбновитьОтборПоПодразделению();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьСобственныйПереводЭлементовИнтерфейса") Тогда
			ОбщийМодульСервер.ПеревестиРеквизитыФормы(ЭтаФорма);	
		КонецЕсли; 		

КонецПроцедуры
