//sza140509-0108 SZA: 
//sza131005-0216 : 

&НаКлиенте
Процедура ПриОткрытии(Отказ)                                      // ПРИ ОТКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()                                           // ПРИ ЗАКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаказ(Команда)
	
	ПараметрыФормы = НоВый Структура("ЭтоЗаказ", Истина);
	формазаказа = получитьформу("Документ.ПоступленияТовара.ФормаОбъекта", ПараметрыФормы);
	формазаказа.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = НоВый Структура("ЭтоЗаказ", Истина);
	ПараметрыФормы.Вставить("Ключ", ВыбраннаяСтрока);
	формазаказа = получитьформу("Документ.ПоступленияТовара.Форма.ФормаДокументаЗаказ", ПараметрыФормы, , ВыбраннаяСтрока);
	формазаказа.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПометитьНаУдалениеСнятьПометку(Команда)
	
	Заказ = Элементы.список.ТекущаяСтрока;
	
	Если не Заказ = Неопределено Тогда
		ПометитьСнятьПометку(Заказ);
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПометитьСнятьПометку(Знач ТекущийЗаказ)
	
	ТекущийЗаказОбъект = ТекущийЗаказ.получитьобъект();
	ТекущийЗаказОбъект.УстановитьПометкуУдаления(НЕ ТекущийЗаказ.ПометкаУдаления);
	ТекущийЗаказОбъект.Записать();
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("001750", ЭтаФорма, Отказ, );
	
	Если НЕ Отказ Тогда
		ОбщийМодульСервисСервер.ОформитьФорматКоличества(Элементы.ТовараВКоличестве, , Истина);
		ОбщийМодульСервер.ОбеспечитьСписокОтборов(Список, "ЗаказПоставщику");	
	КонецЕсли;

КонецПроцедуры
