// sza140509-0108  
// sza131005-0216 : 
&НаКлиенте
Процедура ПометитьНаУдалениеСнятьПометку(Команда)
	
	Заказ = Элементы.список.ТекущаяСтрока;
	
	Если НЕ Заказ = Неопределено Тогда
		ПометитьСнятьПометку(Заказ);
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПометитьСнятьПометку(Знач ТекущийЗаказ)
	
	ТекущийЗаказОбъект = ТекущийЗаказ.получитьобъект();
	ТекущийЗаказОбъект.УстановитьПометкуУдаления(НЕ ТекущийЗаказ.ПометкаУдаления);
	ТекущийЗаказОбъект.Записать(РежимЗаписиДокумента.Запись);
		
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()                                           // ПРИ ЗАКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)                                      // ПРИ ОТКРЫТИИ
	
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
	ПодключитьОбработчикОжидания("ПослеИзображенияОкнаФормы", 0.3, ИСТИНА);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеИзображенияОкнаФормы() // Когда окно уже нарисовано пользователю
	ЭтаФорма.Элементы.ФормаЗакрыть.Видимость = НЕ ЭтаФорма.Окно = Неопределено;	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("001750", ЭтаФорма, Отказ, );
	
	Если НЕ Отказ Тогда
		Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьСобственныйПереводЭлементовИнтерфейса") Тогда
			ОбщийМодульСервер.ПеревестиРеквизитыФормы(ЭтаФорма);	
		КонецЕсли;
		
		ОбщийМодульСервисСервер.ОформитьФорматКоличества(Элементы.ТовараВКоличестве, , ИСТИНА);
		ОбщийМодульСервер.ОбеспечитьСписокОтборов(Список, "ЗаказПоставщику");	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаказ(Команда)
	
	ПараметрыФормы = Новый Структура("ЭтоЗаказ", ИСТИНА);
	формазаказа = получитьформу("Документ.ПоступленияТовара.ФормаОбъекта", ПараметрыФормы);
	формазаказа.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ЛОЖЬ;
	ПараметрыФормы = Новый Структура("ЭтоЗаказ", ИСТИНА);
	ПараметрыФормы.Вставить("Ключ", ВыбраннаяСтрока);
	формазаказа = получитьформу("Документ.ПоступленияТовара.Форма.ФормаДокументаЗаказ", ПараметрыФормы, , ВыбраннаяСтрока);
	формазаказа.Открыть();
	
КонецПроцедуры
