//sza150109-2341 НЧ
//sza141129-0307
//sza140710-0021  
//sza140618-1339  
//sza130909-1805
&НаКлиенте
Процедура Валюта1ПриИзменении(Элемент)
	Валюта1ПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура Валюта1ПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.ХранилищеДенег)
		И НЕ Объект.Валюта = Объект.ХранилищеДенег.Валюта Тогда
		
		Объект.ХранилищеДенег = ПредопределенноеЗначение("Справочник.ХранилищаДенег.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	Валюта1ПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Функция   ВвестиШтрихКод(Знач ШтрихКод = "", Знач ТекстЗаголовка = "") Экспорт
	
	Результат = ЛОЖЬ;
	
	Если ПустаяСтрока(ТекстЗаголовка) Тогда
		ТекстЗаголовка = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Введите Штрих-Код");
	КонецЕсли;
	
	Если ВвестиЗначение(ШтрихКод, ТекстЗаголовка) Тогда
		Если НЕ ПустаяСтрока(ШтрихКод) Тогда
			Результат = ИСТИНА;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ВводСКоличеством(Команда)
	
	Если ИспользоватьПодключаемоеОборудование Тогда
		ПоддерживаемыеТипыВО = Новый Массив ();
		ПоддерживаемыеТипыВО.Добавить("СканерШтрихКода");
		МенеджерОборудованияКлиент.ОтключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО);
	КонецЕсли;
	
	СтруктураДляВВода = Новый Структура;
	СтруктураДляВВода.Вставить("Дата", Объект.Дата);
	СтруктураДляВВода.Вставить("ВидЦен", Объект.ВидЦен);
	СтруктураДляВВода.Вставить("Склад", Объект.Склад);
	СтруктураДляВВода.Вставить("ЭтоДобавка", ИСТИНА);
	СтруктураДляВВода.Вставить("БлокВидаЦенИЦены", ИСТИНА);
	
	СтруктураПараметров = ОбщийМодульКлиент.ВвестиНоменклатуруИКоличество(СтруктураДляВВода);	
	
	Если НЕ СтруктураПараметров = Неопределено Тогда
		ДобавитьПозициюНоменклатуры(СтруктураПараметров);
		ПересчитатьДокументНаКлиенте();
		ЭтаФорма.ТекущийЭлемент = Элементы.Товары;
	КонецЕсли;
	
	Если ИспользоватьПодключаемоеОборудование И 
		МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда
		
		ОписаниеОшибки = "" ;
		ПоддерживаемыеТипыВО = Новый Массив();
		ПоддерживаемыеТипыВО.Добавить("СканерШтрихКода");
		
		Если НЕ МенеджерОборудованияКлиент.ПодключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО, ОписаниеОшибки) Тогда
			ТекстСообщения = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке( "При подключении оборудования произошла ошибка") + ": " + ОписаниеОшибки + ".";
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВводШтрихКода(Команда)
	
	ТекКод = "";
	Если ВвестиШтрихКод(ТекКод) Тогда
		Если НЕ ОбработатьПолученныйШКНаСервере(ТекКод) Тогда
			ОбщийМодульКлиент.ВыдатьСигнал(ТекКод);
		КонецЕсли;
		
		ПересчитатьДокументНаКлиенте();   	
	КонецЕсли;                              	
	
КонецПроцедуры

&НаКлиенте
Процедура ВидЦенПриИзменении(Элемент)	
	ВидЦенПриИзмененииНаСервере();	
КонецПроцедуры

&НаСервере
Процедура ВидЦенПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.ВидЦен)
		И ЗначениеЗаполнено(Объект.ВидЦен.ВалютаЦены) Тогда
		
		Объект.Валюта = Объект.ВидЦен.ВалютаЦены;		
	КонецЕсли;
	
	Для Каждого строкаТовара из Объект.Товары Цикл
		строкаТовара.цена = ОбщийМодульСервер.ПолучитьЦенуНаСервере(строкаТовара.Номенклатура, Объект.ВидЦен, Объект.Дата, , , , , , Объект.Ссылка);
		ПересчитатьСтрокуНаСервере(строкаТовара);		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеньгиПоРезультату(Команда)
	ДеньгиПоРезультатуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДеньгиПоРезультатуНаСервере()
	
	Если ЗначениеЗаполнено(Объект.ВидЦен)
		И ЗначениеЗаполнено(Объект.ВидЦен.ВалютаЦены) Тогда
		
		Объект.Валюта = Объект.ВидЦен.ВалютаЦены;
	КонецЕсли;
	
	Если УчетЗарплаты
		И Объект.ОтразитьВЗаработнойПлате Тогда
		
		СуммаРазница = ОбщийМодульСервер.ПоКурсу(Объект.Товары.Итог("СуммаРазница"), , Объект.Валюта, Объект.Дата);	//к основной валюте
		
		Объект.ОтражениеВЗарплате.Очистить();
		Если ВестиУчетПоСкладам
			И ЗначениеЗаполнено(Объект.Склад)
			И ЗначениеЗаполнено(Объект.Склад.ОтветственныйСотрудник) Тогда
			
			СтрокаОтражения = Объект.ОтражениеВЗарплате.Добавить();
			СтрокаОтражения.Сотрудник = Объект.Склад.ОтветственныйСотрудник;	
			
		Иначе
			Сотрудники = Справочники.Сотрудники.Выбрать();
			
			Пока Сотрудники.Следующий() Цикл
				Если НЕ Сотрудники.ПометкаУдаления Тогда
					СтрокаОтражения = Объект.ОтражениеВЗарплате.Добавить();
					СтрокаОтражения.Сотрудник = Сотрудники.Ссылка;	
				КонецЕсли;
			КонецЦикла;	
			
		КонецЕсли;
		
		КоличествоСотрудников = Объект.ОтражениеВЗарплате.Количество();
		Если КоличествоСотрудников = 0 Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("В справочнике нет сотрудников!");
			Сообщение.Поле 	= "ДеньгиПоРезультату";
			Сообщение.УстановитьДанные(Объект);
			Сообщение.Сообщить();
			
		Иначе
			СуммаНаКаждого = СуммаРазница / КоличествоСотрудников;
			Для Каждого СтрокаОтраженияВЗП Из Объект.ОтражениеВЗарплате Цикл
				СтрокаОтраженияВЗП.Сумма = СуммаНаКаждого;
			КонецЦикла;
			
		КонецЕсли;
		
	Иначе
		
		СуммаРазница = ОбщийМодульСервер.ПоКурсу(Объект.Товары.Итог("СуммаРазница"), Объект.Валюта, , Объект.Дата);
		
		Если СуммаРазница > 0 Тогда
			Объект.ВыбылоДенег 		= СуммаРазница;
			Объект.ПоступилоДенег 	= 0;
			Если НЕ ЗначениеЗаполнено(Объект.СтатьяВыбытия) Тогда
				Объект.СтатьяВыбытия = Справочники.СтатьиДвиженияДенег.ПрочееВыбытиеДенег ;
			КонецЕсли;
			
		Иначе
			Объект.ПоступилоДенег 	= -СуммаРазница;
			Объект.ВыбылоДенег 		= 0;
			Если НЕ ЗначениеЗаполнено(Объект.СтатьяПоступления) Тогда
				Объект.СтатьяПоступления = Справочники.СтатьиДвиженияДенег.ПрочееПоступлениеДенег;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	
	ЭтотОбъект = ДанныеФормыВзначение(Объект, Тип("ДокументОбъект.Инвентаризации"));
	ЭтотОбъект.Записать();
	ЗначениеВданныеФормы(ЭтотОбъект,Объект); 
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИзображение(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) 
		И Вопрос(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Сначала следует записать этот элемент. Записать?"), РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		
		Если глВерсияПлатформы < 803040000 Тогда ЗаписатьНаСервере(); Иначе Записать(); КонецЕсли;			
	КонецЕсли;
		
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПараметрыФормы = Новый Структура("СвязанныйОбъект", Объект.Ссылка);
		формаИзображения = ПолучитьФорму("Справочник.Изображения.ФормаОбъекта", ПараметрыФормы);	
		формаИзображения.Открыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНоменклатуруДругогоДокумента(Команда)
	
	СписокТиповДокументов = Новый СписокЗначений;
	СписокТиповДокументов.Добавить("Корректировки И Регистрация Остатков");
	СписокТиповДокументов.Добавить("Инвентаризации");
	СписокТиповДокументов.Добавить("Расходы Товара");
	СписокТиповДокументов.Добавить("Поступления Товара");
	СписокТиповДокументов.Добавить("Перемещения Товара");
	СписокТиповДокументов.Добавить("Установки Цен");
	СписокТиповДокументов.Добавить("Планы продаж");
	
	ТипДокументаДляДобавления = ВыбратьИзСписка(СписокТиповДокументов, , СписокТиповДокументов[0]);
	
	Если НЕ ТипДокументаДляДобавления = Неопределено тогда
		ТипДокументаДляДобавления = стрзаменить(ТипДокументаДляДобавления, " ", "");
		
		ФормаВыбораДокумента = ПолучитьФорму("Документ." + ТипДокументаДляДобавления + ".ФормаВыбора");
		
		ФормаВыбораДокумента.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите Документ для добавления его номенклатуры в Инвентаризацию") + ": ";
		ДругойДокумент = ФормаВыбораДокумента.ОткрытьМодально();
		
		Если ЗначениеЗаполнено(ДругойДокумент) Тогда
			Состояние(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Обработка и заполнение таблицы товаров.."));
			ДобавитьНоменклатуруДругогоДокументаНаСервере();      	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьНоменклатуруДругогоДокументаНаСервере()
	
	Если ЗначениеЗаполнено(ДругойДокумент) Тогда		
		
		Объект.Товары.Загрузить(ДругойДокумент.Товары.Выгрузить());
		ТаблицаОстатков = ОбщийМодульСервер.СформироватьТаблицуОстатков(Объект.Ссылка, Объект.Склад, Объект.Дата);
		
		Для Каждого строкаТовара из ТаблицаОстатков Цикл
			
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Номенклатура", строкаТовара.Номенклатура);			
			Если УчетПоСериям Тогда
				СтруктураОтбора.Вставить("СерияНоменклатуры", строкаТовара.СерияНоменклатуры);
			КонецЕсли;
			
			СтрокиДокумента = Объект.Товары.НайтиСтроки(СтруктураОтбора);			
			Если НЕ СтрокиДокумента.Количество() = 0 Тогда
				СтрокаДокумента = СтрокиДокумента[0];
				
				СтрокаДокумента.КоличествоУчет = строкаТовара.КоличествоОстатка;
				ПересчитатьСтрокуНаСервере(СтрокаДокумента);		
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНоменклатуруСОтрицательнымиОстатками(Команда)
	
	Состояние(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Обработка и заполнение таблицы товаров.."));
	ДобавитьНоменклатуруСОтрицательнымиОстаткамиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьНоменклатуруСОтрицательнымиОстаткамиНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыОстатки.Номенклатура,
	|	ТоварыОстатки.КоличествоОстаток,
	|	ТоварыОстатки.Номенклатура.Цена КАК Цена,
	|	ТоварыОстатки.СерияНоменклатуры
	|ИЗ
	|	РегистрНакопления.Товары.Остатки(
	|			&ДатаОстатка,
	|			&НетОтбораПоСкладу
	|				ИЛИ Склад = &Склад) КАК ТоварыОстатки
	|ГДЕ
	|	ТоварыОстатки.КоличествоОстаток < 0";
	
	Запрос.УстановитьПараметр("НетОтбораПоСкладу", не ВестиУчетПоСкладам ИЛИ Не ЗначениеЗаполнено(Объект.Склад));
	Запрос.УстановитьПараметр("Склад", Объект.Склад);
	Запрос.УстановитьПараметр("ДатаОстатка", Объект.Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
			Если УчетПоСериям Тогда
				СтруктураОтбора.Вставить("СерияНоменклатуры", ВыборкаДетальныеЗаписи.СерияНоменклатуры);
			КонецЕсли;
			
			СтрокиДокумента = Объект.Товары.НайтиСтроки(СтруктураОтбора);			
			Если СтрокиДокумента.Количество() = 0 Тогда
				
				НоваяСтрока = Объект.Товары.Добавить();
				НоваяСтрока.номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
				
				Если ИспользоватьСложныйМеханизмЦен Тогда
					НоваяСтрока.Цена = ОбщийМодульСервер.ПолучитьСложнуюЦену(НоваяСтрока.номенклатура, Объект.ВидЦен, Объект.Дата);
				Иначе
					НоваяСтрока.Цена = ВыборкаДетальныеЗаписи.Цена;
				КонецЕсли;
				
				НоваяСтрока.КоличествоУчет = ВыборкаДетальныеЗаписи.КоличествоОстаток;
				ПересчитатьСтрокуНаСервере(НоваяСтрока);
				
			Иначе
				ТакаяСтрока = СтрокиДокумента[0];
				ТакаяСтрока .КоличествоУчет = ВыборкаДетальныеЗаписи.КоличествоОстаток;				
				
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПо(Знач Режим = 0)
	
	Запрос = Новый Запрос;	
	Запрос.Текст = "ВЫБРАТЬ ТоварыОстатки.Номенклатура,
	|	ТоварыОстатки.СерияНоменклатуры,
	|	ТоварыОстатки.КоличествоОстаток,
	|	ТоварыОстатки.СуммаОстаток,
	|	ТоварыОстатки.Номенклатура.Цена КАК Цена
	|ИЗ РегистрНакопления.Товары.Остатки(
	|			&Дата,
	|			НЕ &ОтборПоСкладу
	|				ИЛИ Склад = &Склад) КАК ТоварыОстатки
	|ГДЕ ТоварыОстатки.КоличествоОстаток <> 0";
	
	Если режим = 0 тогда
		Запрос.Текст = Запрос.Текст +" И ТоварыОстатки.Номенклатура.Родитель = &Родитель ";		
		Запрос.УстановитьПараметр("Родитель", ГруппаНоменклатуры);	
		
	Иначеесли режим = 1 тогда
		Запрос.Текст = Запрос.Текст +" И ТоварыОстатки.Номенклатура.Производитель = &Производитель ";		
		Запрос.УстановитьПараметр("производитель", производитель);	
		
	Иначеесли режим = 2 тогда
		Запрос.Текст = Запрос.Текст +" И ТоварыОстатки.Номенклатура.НоменклатурнаяГруппа = &НоменклатурнаяГруппа ";		
		Запрос.УстановитьПараметр("НоменклатурнаяГруппа", НоменклатурнаяГруппа);	
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Склад", Объект.Склад);
	Запрос.УстановитьПараметр("ОтборПоСкладу", ВестиУчетПоСкладам и ЗначениеЗаполнено(Объект.Склад));
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Номенклатура", ВыборкаДетальныеЗаписи.Номенклатура);
			Если УчетПоСериям тогда
				СтруктураОтбора.Вставить("СерияНоменклатуры", ВыборкаДетальныеЗаписи.СерияНоменклатуры);
			КонецЕсли;
			
			Если Объект.Товары.НайтиСтроки(СтруктураОтбора).Количество() = 0 Тогда
				НоваяСтрока = Объект.Товары.Добавить();
				НоваяСтрока.номенклатура 		= ВыборкаДетальныеЗаписи.Номенклатура;
				НоваяСтрока.СерияНоменклатуры 	= ВыборкаДетальныеЗаписи.СерияНоменклатуры;				
				КоличествоОстаток 				= ВыборкаДетальныеЗаписи.КоличествоОстаток;
				
				Если НЕ КоличествоОстаток = 0 тогда
					НоваяСтрока.КоличествоУчет 	= КоличествоОстаток;
					НоваяСтрока.Цена 			= ВыборкаДетальныеЗаписи.СуммаОстаток / КоличествоОстаток;
				КонецЕсли;
				
				Если НоваяСтрока.Цена = 0 тогда
					Если ИспользоватьСложныйМеханизмЦен Тогда
						НоваяСтрока.Цена = ОбщийМодульСервер.ПолучитьСложнуюЦену(НоваяСтрока.номенклатура, Объект.ВидЦен, Объект.Дата);
					Иначе
						НоваяСтрока.Цена = ВыборкаДетальныеЗаписи.Цена;
					КонецЕсли;                     	
				КонецЕсли;
				
				НоваяСтрока.СуммаУчет = ВыборкаДетальныеЗаписи.СуммаОстаток;
				ПересчитатьСтрокуНаСервере(НоваяСтрока);		
				
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры //ДобавитьПо

&НаКлиенте
Процедура ДобавитьПоГруппеНоменклатуры(Команда)
	
	ФормаВыбораГруппыНоменклатуры = ПолучитьФорму("Справочник.Номенклатура.ФормаВыбораГруппы");
	ФормаВыбораГруппыНоменклатуры.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите Группу номенклатуры для добавления в инвентаризацию") + ": ";
	
	ГруппаНоменклатуры = ФормаВыбораГруппыНоменклатуры.ОткрытьМодально();
	Если ЗначениеЗаполнено(ГруппаНоменклатуры) Тогда
		Состояние(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Обработка и заполнение таблицы товаров.."));
		ДобавитьПогруппеНоменклатурыНаСервере();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПоГруппеНоменклатурыНаСервере()	
	ДобавитьПо(0);	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПозициюНоменклатуры(Знач НоменклатураВх)
	
	СерияНоменклатуры 	= Неопределено;
	ЕдиницаИзмерения = Неопределено;
	
	Если ТипЗнч(НоменклатураВх) = Тип("СправочникСсылка.Номенклатура") Тогда  		
		Номенклатура 	= НоменклатураВх;
		Количество 		= 1;	
		
	Иначе
		Номенклатура	= НоменклатураВх.Номенклатура;
		Количество 		= НоменклатураВх.Количество;
		НоменклатураВх.Свойство("СерияНоменклатуры", СерияНоменклатуры);
		НоменклатураВх.Свойство("ЕдиницаИзмерения", ЕдиницаИзмерения);
		Если ЗначениеЗаполнено(ЕдиницаИзмерения) Тогда
			Количество 		= ЕдиницаИзмерения.Количество * НоменклатураВх.Количество;
		КонецЕсли;
		
	КонецЕсли; 
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Номенклатура", Номенклатура);
	Если УчетПоСериям Тогда		
		ПараметрыОтбора.Вставить("СерияНоменклатуры", СерияНоменклатуры);
	КонецЕсли;
	
	СтрокаТовара = Объект.Товары.НайтиСтроки(ПараметрыОтбора);
	Если НЕ ДокументЗаблокирован Тогда
		
		Если ОбщийМодульПовтор.ЭтоНабор(Номенклатура) Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Нет возможности инвентаризировать Набор номенклатуры.");
			Сообщение.УстановитьДанные(Объект);
			Сообщение.Сообщить();
			
		Иначе		
			Если СтрокаТовара.Количество() = 0 Тогда
				
				Если УчетПоСериям
					И ЗначениеЗаполнено(СерияНоменклатуры)
					И НЕ СерииНоменклатурыВидны Тогда
					
					СерииНоменклатурыВидны = ИСТИНА;		
					Элементы.ТоварыСерияНоменклатуры.Видимость = ИСТИНА;	
				КонецЕсли;
				
				СтрокаТовара 		= Объект.Товары.Добавить();	
				СтрокаТовара.Номенклатура = Номенклатура;
				СтрокаТовара.Цена 	= ОбщийМодульСервер.ПолучитьЦенуНаСервере(СтрокаТовара.Номенклатура, Объект.ВидЦен, Объект.Дата, ИСТИНА, , , , , Объект.Ссылка);
				
			Иначе
				СтрокаТовара 		= СтрокаТовара[0];
			КонецЕсли;
			
			Если УчетПоСериям
				И ЗначениеЗаполнено(СерияНоменклатуры) Тогда
				
				СтрокаТовара.СерияНоменклатуры = СерияНоменклатуры;
				СтрокаТовара.КоличествоПоФакту = 1;
			Иначе
				СтрокаТовара.КоличествоПоФакту = СтрокаТовара.КоличествоПоФакту + Количество;
			КонецЕсли;						
			
			Если ОбщийМодульПовтор.ПолучитьПараметрСеанса("ИспользоватьСкидкиПС") Тогда
				
				ПроцентСкидки = ОбщийМодульСервер.ПолучитьПроцентСкидкиНаСервере(Номенклатура, строкатовара.количествопофакту, Объект.ВидЦен); //акция ном
				Если НЕ процентскидки = 0 
					И НЕ СтрокаТовара.Цена = 0 тогда
					
					СтрокаТовара.Цена  = СтрокаТовара.Цена - (СтрокаТовара.Цена / 100 * ПроцентСкидки);	
				КонецЕсли;
			КонецЕсли;
			
			ПересчитатьСтрокуНаСервере(СтрокаТовара);	
			
			Элементы.Товары.ТекущаяСтрока 	= СтрокаТовара.ПолучитьИдентификатор();
			Элементы.Товары.ТекущийЭлемент 	= Элементы.ТоварыКоличествоПоФакту;   	
		КонецЕсли;
		
	ИначеЕсли НЕ СтрокаТовара.Количество() = 0 Тогда //Встать на строку
		
		СтрокаТовара = СтрокаТовара[0];
		Элементы.Товары.ТекущаяСтрока 	= СтрокаТовара.ПолучитьИдентификатор();
		Элементы.Товары.ТекущийЭлемент 	= Элементы.ТоварыКоличествоПоФакту;
		
	КонецЕсли;   	
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПоНоменклатурнойГруппе(Команда)
	
	ФормаНоменклатурнойГруппы = ПолучитьФорму("Справочник.НоменклатурныеГруппы.ФормаВыбора");
	ФормаНоменклатурнойГруппы.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите Номенклатурную Группу для добавления её номенклатуры в инвентаризацию") + ": ";
	
	НоменклатурнаяГруппа = ФормаНоменклатурнойГруппы.ОткрытьМодально();
	Если ЗначениеЗаполнено(НоменклатурнаяГруппа) Тогда
		Состояние(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Обработка и заполнение таблицы товаров.."));
		ДобавитьПоНоменклатурнойГруппеНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПоНоменклатурнойГруппеНаСервере()	
	ДобавитьПо(2);	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПоПроизводителю(Команда)
	
	ФормаВыбораПроизводителя = ПолучитьФорму("Справочник.Производители.ФормаВыбора");
	ФормаВыбораПроизводителя.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите Производителя для добавления его номенклатуры в инвентаризацию") + ": ";
	
	Производитель = ФормаВыбораПроизводителя.ОткрытьМодально();
	Если ЗначениеЗаполнено(Производитель) Тогда
		Состояние(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Обработка и заполнение таблицы товаров.."));
		ДобавитьПоПроизводителюНаСервере();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПоПроизводителюНаСервере() 	
	ДобавитьПо(1);	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительнаяИнформацияВидИнформацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыФормы = Новый Структура("ТипВладельца", ДопИнфоТипВладельца);
	ФормаВыбораВидаИнформации = ПолучитьФорму("Справочник.ДополнительныеРеквизиты.ФормаВыбора", ПараметрыФормы, ЭтаФорма);	
	ВидИнформации = ФормаВыбораВидаИнформации.ОткрытьМодально();
	Если ЗначениеЗаполнено(ВидИнформации) Тогда
		Элементы.ДополнительнаяИнформация.ТекущиеДанные.ВидИнформации = ВидИнформации;
		Элементы.ДополнительнаяИнформация.ТекущиеДанные.Информация = ОбщийМодульКлиент.ПолучитьЗначениеПоУмолчаниюПоляДополнительнойИнформации(ВидИнформации);
		СтандартнаяОбработка = ЛОЖЬ;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительнаяИнформацияПриИзменении(Элемент)
	ДопИнформацияИзменена = ИСТИНА;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКоличествоПоФактуДаннымиИзУчетаДляВсехСтрокГдеФактНеУказан(Команда)
	ЗаполнитьКоличествоПоФактуДаннымиИзУчетаДляВсехСтрокГдеФактНеУказанНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКоличествоПоФактуДаннымиИзУчетаДляВсехСтрокГдеФактНеУказанНаСервере()
	
	Для Каждого строкаТовара из Объект.Товары Цикл
		Если строкатовара.КоличествоПоФакту = 0 Тогда
			
			строкатовара.КоличествоПоФакту 	= строкатовара.КоличествоУчет;
			СтрокаТовара.СуммаУчет 			= СтрокаТовара.КоличествоУчет * СтрокаТовара.Цена;
			СтрокаТовара.СуммаПоФакту 		= СтрокаТовара.КоличествоПоФакту * СтрокаТовара.Цена;
			СтрокаТовара.КоличествоРазница 	= СтрокаТовара.КоличествоПоФакту - СтрокаТовара.КоличествоУчет;
			СтрокаТовара.СуммаРазница 		= СтрокаТовара.СуммаПоФакту - СтрокаТовара.суммаУчет;	
			
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьУчетнымиДанными(Команда)
	
	Состояние(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Обработка и заполнение таблицы товаров.."));	
	ЗаполнитьУчетнымиДаннымиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУчетнымиДаннымиНаСервере()
	
	Объект.Товары.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыОстатки.СуммаОстаток,
	|	ТоварыОстатки.КоличествоОстаток,
	|	ТоварыОстатки.Склад,
	|	ТоварыОстатки.Номенклатура,
	|	ТоварыОстатки.СерияНоменклатуры
	|ИЗ
	|	РегистрНакопления.Товары.Остатки(
	|			&ДатаОстатка,
	|			&НетОтбораПоСкладу
	|				ИЛИ Склад = &Склад) КАК ТоварыОстатки";
	
	Запрос.УстановитьПараметр("НетОтбораПоСкладу", не ВестиУчетПоСкладам ИЛИ Не ЗначениеЗаполнено(Объект.Склад));
	Запрос.УстановитьПараметр("Склад", Объект.Склад);
	Запрос.УстановитьПараметр("ДатаОстатка", Объект.Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			строкатовары = Объект.Товары.Добавить();
			строкатовары.Номенклатура 		= ВыборкаДетальныеЗаписи.номенклатура;
			строкатовары.СерияНоменклатуры 	= ВыборкаДетальныеЗаписи.СерияНоменклатуры;
			строкатовары.КоличествоУчет 	= ВыборкаДетальныеЗаписи.КоличествоОстаток;			
			строкатовары.цена 				= ОбщийМодульСервер.ПолучитьЦенуНаСервере(строкатовары.Номенклатура, Объект.ВидЦен, Объект.Дата, , , , , , Объект.Ссылка);
			ПересчитатьСтрокуНаСервере(строкатовары);
			
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗафиксироватьРезультатыИнвентаризацииВКачествеРеализации(Команда)
	
	Если ПроверитьНаличиеОприходования()
		И Вопрос(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Создать расходный документ и заполнить его разницей данных инвентаризации?"), РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		
		ЗафиксироватьРезультатыИнвентаризацииВКачествеРеализацииНаСервере();
		ОткрытьЗначение(Объект.СвязанныйДокументРеализации);
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗафиксироватьРезультатыИнвентаризацииВКачествеРеализацииНаСервере()
	
	Объект.НеПроизводитьОприходованиеИСписаниеЭтимДокументом = ИСТИНА;
	
	Если ЗначениеЗаполнено(Объект.СвязанныйДокументРеализации) Тогда
		объектСвязанныйДокументРеализации = Объект.СвязанныйДокументРеализации.ПолучитьОбъект();
		объектСвязанныйДокументРеализации.ПометкаУдаления = ЛОЖЬ;
	Иначе
		объектСвязанныйДокументРеализации = Документы.РасходыТовара.СоздатьДокумент();
	КонецЕсли;
	
	объектСвязанныйДокументРеализации.Дата = Объект.Дата + 1;
	объектСвязанныйДокументРеализации.Валюта = Объект.Валюта;
	объектСвязанныйДокументРеализации.ВидДокумента = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Реализация за счет данных инвентаризации");
	объектСвязанныйДокументРеализации.ВидЦен = Объект.ВидЦен;
	//объектСвязанныйДокументРеализации.Договор
	объектСвязанныйДокументРеализации.КлиентПоставщик = ПредопределенноеЗначение("Справочник.Клиенты.ФизическоеЛицо");
	объектСвязанныйДокументРеализации.Комментарий = Объект.Комментарий;
	объектСвязанныйДокументРеализации.Курс = ОбщийМодульСервер.ПолучитьТекущийКурс(Объект.Валюта, Объект.Дата);
	объектСвязанныйДокументРеализации.Организация = ПредопределенноеЗначение("Справочник.Организации.ОсновноеПредприятие");
	объектСвязанныйДокументРеализации.ПоступилоДенег = Объект.ПоступилоДенег;
	объектСвязанныйДокументРеализации.Склад = Объект.Склад;
	объектСвязанныйДокументРеализации.ХранилищеДенег = Объект.ХранилищеДенег;
	Для Каждого СтрокаТовара из Объект.Товары Цикл
		Если СтрокаТовара.КоличествоРазница < 0 Тогда
			Количество = -СтрокаТовара.КоличествоРазница;
			СтрокаРеализации = объектСвязанныйДокументРеализации.Товары.Добавить();
			СтрокаРеализации.Номенклатура      = СтрокаТовара.Номенклатура;
			СтрокаРеализации.СерияНоменклатуры = СтрокаТовара.СерияНоменклатуры;
			СтрокаРеализации.Количество		   = Количество;
			СтрокаРеализации.Цена              = ОбщийМодульСервер.ПолучитьЦенуНаСервере(СтрокаТовара.Номенклатура, Объект.ВидЦен, Объект.Дата, ЛОЖЬ, Количество, , , , Объект.Ссылка);
			СтрокаРеализации.Сумма			   = СтрокаРеализации.Цена * Количество;
			СтрокаРеализации.ОСтроке = СтрокаТовара.Коментарий;
			
		КонецЕсли;	
	КонецЦикла;
	
	Попытка 
		объектСвязанныйДокументРеализации.Записать(РежимЗаписиДокумента.Проведение);
		Объект.СвязанныйДокументРеализации = объектСвязанныйДокументРеализации.Ссылка;
		
	Исключение 	
		ОбщийМодульСервисСервер.ДобавитьСообщениеПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Произошла ошибка при проведении документа реализации") + ": " + ОписаниеОшибки());
		
	КонецПопытки;
	
	ОбновитьВидимость();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимость()
	
	РазрешитьМеханизмРегистрацииРеализацииЗаСчетПериодическойИнвентаризацииСклада = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("РазрешитьМеханизмРегистрацииРеализацииЗаСчетПериодическойИнвентаризацииСклада", ИСТИНА);
	Элементы.ЗафиксироватьРезультатыИнвентаризацииВКачествеРеализации.Видимость   = НЕ Объект.Проведен И РазрешитьМеханизмРегистрацииРеализацииЗаСчетПериодическойИнвентаризацииСклада;
	ЗначениеЗаполненообъектСвязанныйДокументРеализации = ЗначениеЗаполнено(Объект.СвязанныйДокументРеализации);
	Элементы.СвязанныйДокументРеализации.Видимость 	   = ЗначениеЗаполненообъектСвязанныйДокументРеализации;
	Элементы.НеПроизводитьОприходованиеИСписаниеЭтимДокументом.Видимость = НЕ ЗначениеЗаполненообъектСвязанныйДокументРеализации;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьУчетныеДанныеВсехСтрок(Команда)
	
	Состояние(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Обработка и заполнение таблицы товаров.."));	
	ОбновитьУчетныеДанныеВсехСтрокНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьУчетныеДанныеВсехСтрокНаСервере()
	
	ТаблицаОстатков = ОбщийМодульСервер.СформироватьТаблицуОстатков(Объект.Ссылка, Объект.Склад, Объект.Дата);
		Для Каждого строкаТовара из ТаблицаОстатков Цикл
			
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Номенклатура", строкаТовара.Номенклатура);			
			Если УчетПоСериям Тогда
				СтруктураОтбора.Вставить("СерияНоменклатуры", строкаТовара.СерияНоменклатуры);
			КонецЕсли;
			
			СтрокиДокумента = Объект.Товары.НайтиСтроки(СтруктураОтбора);			
			Если НЕ СтрокиДокумента.Количество() = 0 Тогда
				СтрокаДокумента = СтрокиДокумента[0];
				
				СтрокаДокумента.КоличествоУчет = строкаТовара.КоличествоОстаток;
				ПересчитатьСтрокуНаСервере(СтрокаДокумента);		
			КонецЕсли;
		КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьБлокировку(Знач ПриСозданииФормы = ЛОЖЬ)
	
	Если ОбщийМодульСервер.ОбработатьБлокировку(Объект, ЭтаФорма, ПриСозданииФормы, "000312") Тогда			
		Элементы.ТоварыВводШтрихКода.Видимость	 	= ЛОЖЬ;
		Элементы.ДеньгиПоРезультату.Доступность 	= ЛОЖЬ;
		Элементы.ОбработкаТаблицы.Доступность 		= ЛОЖЬ;
		Элементы.ТоварыВводСКоличеством.Видимость	= ЛОЖЬ;
		Элементы.Декорация2.Видимость 				= ИСТИНА;
		Элементы.ЗафиксироватьРезультатыИнвентаризацииВКачествеРеализации.Доступность = ЛОЖЬ;
		Элементы.ОбработкаТаблицы.Видимость			= ЛОЖЬ;
		Элементы.ОтразитьВЗаработнойПлате.Видимость = ЛОЖЬ;
		Элементы.КачествоОтраженияРезультата.Видимость = ИСТИНА;
		Если Объект.ОтразитьВЗаработнойПлате Тогда
			Элементы.КачествоОтраженияРезультата.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Операция отражается на заработной плате..");
		Иначе
			Элементы.КачествоОтраженияРезультата.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Операция отражается движением денег..");
		КонецЕсли;		
		
	Иначе
		Элементы.ТоварыВводШтрихКода.Видимость	 	= ИСТИНА;
		Элементы.ДеньгиПоРезультату.Доступность 	= ИСТИНА;
		Элементы.ОбработкаТаблицы.Доступность 		= ИСТИНА;
		Элементы.ТоварыВводСКоличеством.Видимость	= ИСТИНА;
		Элементы.Декорация2.Видимость 				= ЛОЖЬ;
		Элементы.ЗафиксироватьРезультатыИнвентаризацииВКачествеРеализации.Доступность = ИСТИНА;
		Элементы.ОбработкаТаблицы.Видимость			= ИСТИНА;
		Элементы.ОтразитьВЗаработнойПлате.Видимость = ИСТИНА;
		Элементы.КачествоОтраженияРезультата.Видимость = ЛОЖЬ;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПолученныйШКНаклиенте(Знач ТекКод)
	
	Если НЕ ОбработатьПолученныйШКНаСервере(ТекКод) Тогда
		
		СканерЗаблокирован = ОбщийМодульКлиент.ВыдатьСигнал(ТекКод) и не ДокументЗаблокирован;
		Элементы.разблокироватьсканер.видимость = СканерЗаблокирован;
		
	Иначе
		ПересчитатьСтроку();
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция   ОбработатьПолученныйШКНаСервере(Знач ТекКод, Знач Количество = 1)
	
	Результат = ИСТИНА;
	
	РезультатОбработки 	= ОбщийМодульТоварСервер.ПолучитьНоменклатуруПоШтрихКоду(ТекКод, ИСТИНА, ИСТИНА, Объект.Дата);
	Номенклатура 		= РезультатОбработки.Номенклатура;
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		ДобавитьПозициюНоменклатуры(РезультатОбработки);
		СтрокаДисплеяПокупателя = РезультатОбработки;		
		
	Иначе
		ОбщегоНазначения.СообщитьПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Товар по Штрих-Коду не найден") + "(" + ТекКод + ").");
		Результат = ЛОЖЬ;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник = "ПодключаемоеОборудование"
		И ВводДоступен() Тогда
		
		Если НЕ СканерЗаблокирован
			И ИмяСобытия = "ScanData" Тогда
			
			Если Параметр[ 1 ] = Неопределено Тогда
				ТекКод = Параметр[ 0 ];
			Иначе
				ТекКод = Параметр[ 1 ][ 1 ];
			КонецЕсли;
			
			ОбработатьПолученныйШКНаКлиенте(ТекКод);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция   ОбщийМодульСерверПолучитьПроцентСкидкиНаСервере(Знач Номенклатура, Знач Количество)
	
	Если ОбщийМодульПовтор.ПолучитьПараметрСеанса("ИспользоватьСкидкиПС") Тогда
		Возврат ОбщийМодульСервер.ПолучитьПроцентСкидкиНаСервере(Номенклатура, Количество, Объект.ВидЦен);
	Иначе
		возврат 0;	
	КонецЕсли;
	
КонецФункции 

&НаКлиенте
Процедура ОтразитьВЗаработнойПлатеПриИзменении(Элемент)
	ОтразитьВЗаработнойПлатеПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтразитьВЗаработнойПлатеПриИзмененииНаСервере()
	
	Если УчетЗарплаты
		И Объект.ОтразитьВЗаработнойПлате Тогда
		
		Элементы.ОприходованиеИлиРасходДенег.Видимость 		= ЛОЖЬ;
		Элементы.ИлиУчестьВЗарплатеСотрудников.Видимость 	= ИСТИНА;
		
	Иначе
		Элементы.ОприходованиеИлиРасходДенег.Видимость 		= ИСТИНА;
		Элементы.ИлиУчестьВЗарплатеСотрудников.Видимость 	= ЛОЖЬ;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТаблицу(Команда)
	
	Если Вопрос(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Вы готовы очистить таблицу документа?"), РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		ОчиститьТаблицуНаСервере();	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьТаблицуНаСервере()
	
	Объект.Товары.Очистить();
	Объект.ТовараВКоличестве = 0;
	Объект.ТовараНаСумму 	 = 0;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ИспользоватьСторнированиеДокументов
		И Объект.Дата < ОбщийМодульКлиент.ПользователяТекущаяДата() Тогда
		
		Объект.Дата = ОбщийМодульКлиент.ПользователяТекущаяДата();
	КонецЕсли;
	
	Если УчетПоСериям Тогда
		Отказ = ПроверитьУчетПоСериям(Отказ);
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		Состояние(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Запись документа.."));	
	КонецЕсли;
	
	ПодготовкаКПроведению(Отказ);
	глПроверятьСообщения = ИСТИНА;

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если НЕ Отказ
		И ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Отказ = ПроверитьНаОтказ();
	КонецЕсли;
	
КонецПроцедуры

&наКлиенте
Процедура ПерезаполнитьУчетныеДанные(СтрокаТовара)
	
	Если ЗначениеЗаполнено(СтрокаТовара.номенклатура) Тогда
		
		СтруктураОстатков 			= ПолучитьСтруктуруОстатков(СтрокаТовара.номенклатура, Объект.Склад, Объект.Дата, СтрокаТовара.СерияНоменклатуры);
		СтрокаТовара.КоличествоУчет = СтруктураОстатков.КоличествоОстаток;
		СтрокаТовара.СуммаУчет 		= СтруктураОстатков.СуммаОстаток;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьДокументНаКлиенте()
	
	Объект.ТовараНаСумму 		= Объект.Товары.Итог("СуммаРазница");
	Объект.ТовараВКоличестве 	= Объект.Товары.Итог("КоличествоРазница");
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСтроку(Знач ИзКоличества = ЛОЖЬ)
	
	СтрокаТовара = Элементы.Товары.ТекущиеДанные;
	Если НЕ СтрокаТовара = Неопределено тогда
		
		Если ИзКоличества
			И УчетПоСериям
			И СтрокаТовара.КоличествоПоФакту > 0
			И значениезаполнено(СтрокаТовара.СерияНоменклатуры) Тогда
			
			СтрокаТовара.КоличествоПоФакту = 1;
		КонецЕсли;
		
		СтрокаТовара.СуммаУчет 			= СтрокаТовара.КоличествоУчет * СтрокаТовара.Цена;
		СтрокаТовара.СуммаПоФакту 		= СтрокаТовара.КоличествоПоФакту * СтрокаТовара.Цена;
		СтрокаТовара.КоличествоРазница 	= СтрокаТовара.КоличествоПоФакту - СтрокаТовара.КоличествоУчет;
		СтрокаТовара.СуммаРазница 		= СтрокаТовара.СуммаПоФакту - СтрокаТовара.суммаУчет;	
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьСтрокуНаСервере(СтрокаТовара)
	
	Если ОбщийМодульПовтор.ПолучитьПараметрСеанса("ИспользоватьСкидкиПС") Тогда
		
		ПроцентСкидки = ОбщийМодульСервер.ПолучитьПроцентСкидкиНаСервере(СтрокаТовара.Номенклатура, строкатовара.количествоПоФакту, Объект.видцен ); 
		Если НЕ процентскидки = 0 
			И НЕ СтрокаТовара.Цена = 0 тогда
			
			СтрокаТовара.Цена  = СтрокаТовара.Цена - (СтрокаТовара.Цена/100 * ПроцентСкидки);	
		КонецЕсли;                                     	
	КонецЕсли;
	
	Если УчетПоСериям
		И СтрокаТовара.КоличествоПоФакту > 0
		И значениезаполнено(СтрокаТовара.СерияНоменклатуры) Тогда
		
		СтрокаТовара.КоличествоПоФакту = 1;
	КонецЕсли;
	
	СтрокаТовара.СуммаУчет 			= СтрокаТовара.КоличествоУчет * СтрокаТовара.Цена;
	СтрокаТовара.СуммаПоФакту 		= СтрокаТовара.КоличествоПоФакту * СтрокаТовара.Цена;
	СтрокаТовара.КоличествоРазница 	= СтрокаТовара.КоличествоПоФакту - СтрокаТовара.КоличествоУчет;
	СтрокаТовара.СуммаРазница 		= СтрокаТовара.СуммаПоФакту - СтрокаТовара.суммаУчет;
	
КонецПроцедуры

&НаСервере
Процедура ПодготовкаКПроведению(Отказ)
	
	Если НЕ Отказ Тогда
		ДокументОбъект = РеквизитФормыВЗначение("Объект"); 
		ДокументОбъект.ПодготовкаКПроведению(Отказ);
		ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");	
	КонецЕсли;
	
КонецПроцедуры

функция   ПолучитьСтруктуруОстатков(Знач Номенклатура, Знач Склад, Знач Дата, Знач СерияНоменклатуры)
	
	СтруктураОстатков = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ТоварыОстатки.КоличествоОстаток,
	|	ТоварыОстатки.СуммаОстаток
	|ИЗ РегистрНакопления.Товары.Остатки(
	|			&ДатаОстатка,
	|			Номенклатура = &Номенклатура
	|				И Склад = &склад
	|				И СерияНоменклатуры = &СерияНоменклатуры) КАК ТоварыОстатки";
	
	Запрос.УстановитьПараметр("ДатаОстатка", Дата);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("СерияНоменклатуры", СерияНоменклатуры);
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса  = Запрос.Выполнить();	
	КоличествоОстаток = 0;
	СуммаОстаток 	  = 0;
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			КоличествоОстаток 	= КоличествоОстаток + ВыборкаДетальныеЗаписи.КоличествоОстаток;
			СуммаОстаток 		= СуммаОстаток + ВыборкаДетальныеЗаписи.СуммаОстаток;
		КонецЦикла;
	КонецЕсли;
	
	СтруктураОстатков.Вставить("КоличествоОстаток", КоличествоОстаток);
	СтруктураОстатков.Вставить("СуммаОстаток", СуммаОстаток);
	
	Возврат СтруктураОстатков;
	
КонецФункции

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	глЧислоОбъектов = глЧислоОбъектов + 1; глПроверятьСообщения = ИСТИНА;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если НЕ ПараметрыЗаписи.режимзаписи = РежимЗаписиДокумента.Запись тогда
		ОбработатьБлокировку();                                                	
	КонецЕсли;
	ОбновитьВидимость();
	
	Если ДопИнформацияИзменена Тогда
		ОбщийМодульСервисСервер.ЗаписатьДополнительнуюИнформацию(Объект.Ссылка, ДополнительнаяИнформация);
	КонецЕсли;  	
	
КонецПроцедуры	

&НаКлиенте
Процедура ПриЗакрытии()                                              // ПРИ ЗАКРЫТИИ   	
	
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
	
	Если ИспользоватьПодключаемоеОборудование Тогда
		
		ПоддерживаемыеТипыВО = Новый Массив ();
		ПоддерживаемыеТипыВО.Добавить("СчитывательМагнитныхКарт");
		ПоддерживаемыеТипыВО.Добавить("СканерШтрихКода");
		ПоддерживаемыеТипыВО.Добавить("ДисплейПокупателя");
		МенеджерОборудованияКлиент.ОтключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииНоменклатуры() 
	
	СтрокаТовара 		= Элементы.Товары.ТекущиеДанные;
	
	Номенклатура = СтрокаТовара.Номенклатура;
	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		
		СтрокаТовара.Цена 	= ОбщийМодульСервер.ПолучитьЦенуНаСервере(Номенклатура, Объект.ВидЦен, Объект.Дата, ИСТИНА, , , , , Объект.Ссылка);//, строкатовара.количествоПоФакту);
		ПроцентСкидки 		= ОбщийМодульСерверПолучитьПроцентСкидкиНаСервере(Номенклатура, строкатовара.количествоПоФакту); //акция ном
		
		Если УчетПоСериям 
			И НЕ СерииНоменклатурыВидны Тогда
			
			ТоварВедетсяПоСериям = ОбщийМодульПовтор.ТоварВедетсяПоСериям(Номенклатура);
			
			Если ТоварВедетсяПоСериям Тогда
				
				СерииНоменклатурыВидны = ИСТИНА;		
				Элементы.ТоварыСерияНоменклатуры.Видимость = ИСТИНА;	
			КонецЕсли;             	
			
		КонецЕсли;
		
		Если НЕ процентскидки = 0 
			И НЕ СтрокаТовара.Цена = 0 тогда
			
			СтрокаТовара.Цена  = СтрокаТовара.Цена - (СтрокаТовара.Цена / 100 * ПроцентСкидки);	
		КонецЕсли;		
	КонецЕсли;
	
	ПерезаполнитьУчетныеДанные(СтрокаТовара);
	ПересчитатьСтроку();
	
КонецПроцедуры //ПриИзмененииНоменклатуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)                                         // ПРИ ОТКРЫТИИ	
	
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0, Объект.Ссылка, ИСТИНА);
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбработатьБлокировку(ИСТИНА);		
	КонецЕсли;
	
	Если ИспользоватьПодключаемоеОборудование И 
		МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда
		
		ОписаниеОшибки = "" ;
		ПоддерживаемыеТипыВО = Новый Массив();
		ПоддерживаемыеТипыВО.Добавить("СчитывательМагнитныхКарт");
		ПоддерживаемыеТипыВО.Добавить("СканерШтрихКода");
		
		Если НЕ МенеджерОборудованияКлиент.ПодключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО, ОписаниеОшибки) Тогда
			ТекстСообщения = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке( "При подключении оборудования произошла ошибка") + ": " + ОписаниеОшибки + ".";
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)          // ПРИ СОЗДАНИИ НА СЕРВЕРЕ
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("000310", ЭтаФорма, Отказ, Объект);
	
	Если НЕ Отказ Тогда
		ОбъектСсылка = Объект.Ссылка;
		
		ДопИнфоТипВладельца = ОбщийМодульПовтор.ПолучитьТипВладельца(ОбъектСсылка); 	
		ОбщийМодульСервисСервер.ЗаполнитьДополнительнуюИнформацию(ОбъектСсылка, ДополнительнаяИнформация, ДопИнфоТипВладельца);
		
		ИспользоватьПодключаемоеОборудование = ПодключаемоеОборудованиеДСервер.ИспользоватьПодключаемоеОборудование();	
		ИспользоватьСложныйМеханизмЦен 		 = ОбщийМодульПовтор.ПолучитьПараметрСеанса("ИспользоватьСложныйМеханизмЦенПС");
		УчетЗарплаты 						 = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетЗарплатыСотрудников");
		ВестиУчетПоСкладам 					 = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетПоСкладам");
		ВестиУчетДвиженияДенег 				 = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетДвиженияДенег");
		УчетПоСериям						 = ОбщийМодульПовтор.ПолучитьПараметрСеанса("ВестиУчетПоСериямНоменклатуры");
		ИспользоватьСторнированиеДокументов  = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ИспользоватьСторнированиеДокументов");
		
		Элементы.ТоварыВводСКоличеством.Видимость 		  = не ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("НеПоказыватьКомандуДобавленияНоменклатурыСКоличеством");
		Элементы.ГруппаДополнительнаяИнформация.Видимость = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиДополнительнуюИнформациюДляИнвентаризации");
		
		Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВсеРеквизитыШапкиДокументовВПервуюЗакладкуРежимБольшихТаблицДляМалыхМониторов") Тогда
			Элементы.Переместить(Элементы.ГруппаШапки, Элементы.СтраницаШапки);
			Элементы.Переместить(Элементы.ГруппаВидаЦен, Элементы.СтраницаШапки);
			Элементы.Переместить(Элементы.ГруппаСтандартныхРеквизитов, Элементы.СтраницаШапки);			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.Склад) Тогда
			Объект.Склад = параметры.Склад;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ОбъектСсылка) Тогда
			
			Объект.Сторный = ЛОЖЬ; //При копировании
			Объект.ДокументСторно = Неопределено;				
			
			Если НЕ Значениезаполнено(Объект.ХранилищеДенег) Тогда
				Объект.ХранилищеДенег = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ОсновноеХранилищеДенег");
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Объект.Склад ) Тогда
				Объект.Склад = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("СкладПоУмолчанию");
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Объект.Валюта ) Тогда
				Объект.Валюта = ОбщийМодульПовтор.ЗначениеПредопределенного("Справочники.Валюты.ОсновнаяВалюта");
			КонецЕсли;
			
			Если УчетЗарплаты
				И НЕ ЗначениеЗаполнено(Объект.ВидЦен ) Тогда
				
				Объект.ВидЦен = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВидЦенДляОтпускаТоваровСобственнымСотрудникам");
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Объект.ВидЦен )
				И ЗначениеЗаполнено(Объект.Склад)
				И ЗначениеЗаполнено(Объект.Склад.ВидЦенРеализацииСЭтогоСклада) Тогда
				
				Объект.ВидЦен = Объект.Склад.ВидЦенРеализацииСЭтогоСклада;
			Иначе
				Объект.ВидЦен = ПредопределенноеЗначение("Справочник.ВидыЦен.ГлавныйВидЦен");
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Объект.ВидЦен) Тогда
				Объект.ВидЦен = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВидЦенПриходованияТовараПоУмолчанию");
			КонецЕсли;
			
			Объект.Дата = ОбщийМодульСервисСервер.ПользователяТекущаяДата();
			
			ВидЦенПриИзмененииНаСервере();
		КонецЕсли;
		
		Если НЕ ВестиУчетДвиженияДенег Тогда
			Элементы.ДвиженияДенегПоРезультату.Заголовок   = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Комментарий");
			Элементы.ОприходованиеИлиРасходДенег.Видимость = ЛОЖЬ;
		КонецЕсли;
		
		Если НЕ Объект.Проведен Тогда		
			ОтразитьВЗаработнойПлатеПриИзмененииНаСервере();	
			ВидЦенПриИзмененииНаСервере();	    	
		КонецЕсли;
		
		Если ОбщийМодульПовтор.ПолучитьПараметрСеанса("НеМожетМенятьЦены") Тогда
			Если ЗначениеЗаполнено(Объект.ВидЦен) Тогда
				Элементы.ВидЦен.Доступность = ЛОЖЬ;	
			КонецЕсли;
			
			Элементы.ТоварыЦена.Доступность = ЛОЖЬ;
		КонецЕсли;
		
		НаименованиеОсновнойВалюты = ПредопределенноеЗначение("Справочник.Валюты.ОсновнаяВалюта").Наименование ;
		СерииНоменклатурыВидны 	   = УчетПоСериям И ОбщийМодульТоварСервер.ПроверитьНаличиеСерийНоменклатуры(Объект.Ссылка);
		Элементы.ТоварыСерияНоменклатуры.Видимость = СерииНоменклатурыВидны;
		
		ОбщийМодульСервисСервер.ОформитьФорматКоличества(Элементы.ТоварыКоличество, , ИСТИНА);
		ОбщийМодульСервисСервер.ОформитьФорматКоличества(Элементы.ТоварыКоличествоПоФакту, , ИСТИНА);
		ОбщийМодульСервисСервер.ОформитьФорматКоличества(Элементы.ТоварыКоличествоРазница, , ИСТИНА);
		ОбщийМодульСервисСервер.ОформитьФорматКоличества(Элементы.ТоварыИтогКоличествоПоФакту, , ИСТИНА);
		ОбщийМодульСервисСервер.ОформитьФорматКоличества(Элементы.ТоварыИтогКоличествоРазница, , ИСТИНА);
		ОбщийМодульСервисСервер.ОформитьФорматКоличества(Элементы.ТоварыИтогКоличествоУчет, , ИСТИНА);
		
		ОбновитьВидимость();	
		
		НетПраваНаЗарплату = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("001450", ЭтаФорма, Отказ, Объект);
		Если НетПраваНаЗарплату Тогда
			Элементы.ОтражениеВЗарплате.Видимость 		= ЛОЖЬ;
			Элементы.ОтразитьВЗаработнойПлате.Видимость = ЛОЖЬ;
		КонецЕсли;
		
		Если ВестиУчетДвиженияДенег ТОгда
			СтруктураОтказа = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("000890", , , , ИСТИНА);
			Если СтруктураОтказа.УровеньДоступа = Перечисления.УровниДоступа.ТолькоЧтение Тогда
				Элементы.ОприходованиеИлиРасходДенег.ТолькоПросмотр = ИСТИНА;
				Элементы.ДеньгиПоРезультату.Видимость = ЛОЖЬ;
				
			ИначеЕсли СтруктураОтказа.Отказ Тогда
				Элементы.ОприходованиеИлиРасходДенег.Видимость = ЛОЖЬ;
				Элементы.ДеньгиПоРезультату.Видимость = ЛОЖЬ;
				
			КонецЕсли;
		КонецЕсли;
		
		ВидимостьСторно();		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВидимостьСторно()
	
	ЗначениеЗаполненоДокументСторнирован = ЛОЖЬ;
	
	Если ЗначениеЗаполнено(Объект.Ссылка)
		И Объект.Проведен
		И ИспользоватьСторнированиеДокументов Тогда
		
		Элементы.Декорация2.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Документ заблокирован");
		
		Если НЕ Объект.Сторный Тогда
		
			ДокументСторнирован = ОбщийМодульСервер.ПроверитьЧтоДокументСторнирован(Объект.Ссылка);
			
			ЗначениеЗаполненоДокументСторнирован = ЗначениеЗаполнено(ДокументСторнирован);
			Элементы.ФормаСторно.Видимость = НЕ ЗначениеЗаполненоДокументСторнирован;
			Если ЗначениеЗаполненоДокументСторнирован Тогда
				ПричинаСторнирования = ОбщийМодульСервисСервер.ПолучитьПричинуСторнирования(ДокументСторнирован);
				Если ЗначениеЗаполнено(ПричинаСторнирования) Тогда
					Элементы.ГруппаПричиныСторнирования.Видимость = ИСТИНА;
					Элементы.ПричинаСторнированияОписание.Видимость = ЗначениеЗаполнено(ПричинаСторнирования.Описание);	
				КонецЕсли;
			КонецЕсли;			
			
		Иначе
			Элементы.ФормаСторно.Видимость = ЛОЖЬ;
			ПричинаСторнирования = ОбщийМодульСервисСервер.ПолучитьПричинуСторнирования(Объект.Ссылка);
			Если ЗначениеЗаполнено(ПричинаСторнирования) Тогда
				Элементы.ГруппаПричиныСторнирования.Видимость = ИСТИНА;
				Элементы.ПричинаСторнированияОписание.Видимость = ЗначениеЗаполнено(ПричинаСторнирования.Описание);	
			КонецЕсли;
		КонецЕсли;
		
		Элементы.ФормаПровести.Видимость = ЛОЖЬ;
		Элементы.ФормаОтменаПроведения.Видимость = ЛОЖЬ;
		Элементы.ФормаЗаписатьИЗакрыть.Видимость = ЛОЖЬ;
		Элементы.ФормаПровестиИЗакрыть.Видимость = ЛОЖЬ;
		Элементы.ФормаЗаписать.Видимость = ЛОЖЬ;
			
	ИначеЕсли Объект.Проведен Тогда
		Элементы.ФормаСторно.Видимость = ЛОЖЬ;
		Элементы.ФормаПровести.Видимость = ЛОЖЬ;
		Элементы.ФормаОтменаПроведения.Видимость = ИСТИНА;
	Иначе
		Элементы.ФормаСторно.Видимость = ЛОЖЬ;
		Элементы.ФормаПровести.Видимость = ИСТИНА;
		Элементы.ФормаОтменаПроведения.Видимость = ЛОЖЬ;
	КонецЕсли;
	
	Элементы.ДокументСторно.Видимость = ЗначениеЗаполнено(Объект.ДокументСторно);
	Элементы.КартинкаСторно.Видимость = Объект.Сторный;
	Элементы.ДокументСторнирован.Видимость = ЗначениеЗаполненоДокументСторнирован;
	Элементы.КартинкаСторнирован.Видимость = ЗначениеЗаполненоДокументСторнирован;
	
КонецПроцедуры

&НаСервере
Функция   ПроверитьНаличиеОприходования()
	
	ЕстьОприходование = ЛОЖЬ;
	
	Для Каждого СтрокаТовара из Объект.Товары Цикл
		Если СтрокаТовара.КоличествоРазница > 0 Тогда
			ЕстьОприходование = ИСТИНА;
			Прервать;
		КонецЕсли;		
	КонецЦикла;
	
	Если ЕстьОприходование Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("В документе есть строки с оприходованием. Их нельзя отразить в реализации!");
		Сообщение.Поле  = "Товары";
		Сообщение.УстановитьДанные(Объект);
		Сообщение.Сообщить();
		
	КонецЕсли;
	
	Возврат НЕ ЕстьОприходование;
	
КонецФункции //ПроверитьНаличиеОприходования

&НаСервере
Функция   ПроверитьНаОтказ()
	
	отказ = ЛОЖЬ;
	
	//ДокументОбъект = РеквизитФормыВЗначение("Объект"); 
	//ДокументОбъект.ПодготовкаКПроведению(Отказ);
	//ЗначениеВРеквизитФормы(ДокументОбъект.Ссылка.ПолучитьОбъект(), "Объект");
	
	Ссылка = Объект.Ссылка;
	Валюта = Объект.Валюта;
	Дата   = Объект.Дата;
	видцен = Объект.ВидЦен;
	ХранилищеДенег = Объект.ХранилищеДенег;
	ВыбылоДенег    = Объект.ВыбылоДенег;
	ПоступилоДенег = Объект.ПоступилоДенег;	
	ОтразитьВЗаработнойПлате = Объект.ОтразитьВЗаработнойПлате;
	
	Если ЗначениеЗаполнено(видцен) Тогда
		Курс = ОбщийМодульПовтор.ПолучитьТекущийКурс(видцен.ВалютаЦены, Дата);
	Иначе
		Курс = 1;
	КонецЕсли;
	
	Если НЕ ОтразитьВЗаработнойПлате 
		И ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетДвиженияДенег") Тогда
		
		ВалютаДок = ?(ЗначениеЗаполнено(Валюта), Валюта, ПредопределенноеЗначение("Справочник.Валюты.ОсновнаяВалюта"));
		
		Если ЗначениеЗаполнено(ХранилищеДенег) Тогда
			ФормаОплаты = ХранилищеДенег.ФормаОплаты;
		Иначе
			ФормаОплаты = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ФормаОплатыДляДенегВДокументахРасходаИПриходаТоваров");
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ФормаОплаты) Тогда
			ФормаОплаты = перечисления.ФормыОплаты.Наличные;
		КонецЕсли;
		
		СуммаДенег = ВыбылоДенег - ПоступилоДенег;
		Если НЕ СуммаДенег = 0 тогда
			Отказ = ОбщийМодульСервер.ПроверитьОстатокДенежныхСредств(СуммаДенег, Дата, ФормаОплаты, ВалютаДок, Объект.ХранилищеДенег, , Объект.Ссылка);
		КонецЕсли;  	
	КонецЕсли;
	
	Возврат Отказ;
	
КонецФункции //ПроверитьНаОтказ

&НаСервере
Функция   ПроверитьУчетПоСериям(Отказ)
	
	Если НЕ Отказ Тогда
		
		МассивСерий = Новый Массив;
		Для Каждого СтрокаТовара Из Объект.Товары Цикл
			
			СерияНоменклатуры = СтрокаТовара.СерияНоменклатуры;
			Если ЗначениеЗаполнено(СерияНоменклатуры) Тогда
				Если МассивСерий.Найти(СерияНоменклатуры) = Неопределено Тогда
					МассивСерий.Добавить(СерияНоменклатуры);
					
				Иначе
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("В строке №") + СтрокаТовара.НомерСтроки + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке(" Серия повторяется!");
					Сообщение.Поле 	= "ТоварыСерияНоменклатуры";
					Сообщение.УстановитьДанные(Объект);
					Сообщение.Сообщить();
					
					Отказ = ИСТИНА;
					
				КонецЕсли;
				
			ИначеЕсли ОбщийМодульПовтор.ТоварВедетсяПоСериямИСерияОбязательна(СтрокаТовара.номенклатура) Тогда
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("В строке №") + СтрокаТовара.НомерСтроки + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке(" обязательная Серия НЕ указана!");
				Сообщение.Поле 	= "ТоварыСерияНоменклатуры";
				Сообщение.УстановитьДанные(Объект);
				Сообщение.Сообщить();
				
				Отказ = ИСТИНА;
				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат отказ;
	
КонецФункции //ПроверитьУчетПоСериям

&НаКлиенте
Процедура РазблокироватьСканер(Команда)
	
	СканерЗаблокирован = ЛОЖЬ;
	Элементы.разблокироватьсканер.видимость = СканерЗаблокирован;
	
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеИзображения(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) 
		И Вопрос(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Сначала следует записать этот элемент. Записать?"), РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			
		Если глВерсияПлатформы < 803040000 Тогда ЗаписатьНаСервере(); Иначе Записать(); КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПараметрыФормы = Новый Структура("СвязанныйОбъект", Объект.Ссылка);
		ОткрытьФорму("Справочник.Изображения.ФормаСписка", ПараметрыФормы);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	Если глВерсияПлатформы < 803040000 Тогда ЗаписатьНаСервере(); Иначе Записать(); КонецЕсли;
	Закрыть();
	
КонецПроцедуры

&НаКлиенте                             
Процедура СкладПриИзменении(Элемент)	
	
	СкладПриИзмененииНаСервере();
	
	Если Вопрос(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Заполнить учетными данными?"), РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		ЗаполнитьУчетнымиДаннымиНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СкладПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Склад) Тогда
		
		Если ЗначениеЗаполнено(Объект.Склад.ВидЦенРеализацииСЭтогоСклада) Тогда			
			Объект.ВидЦен = Объект.Склад.ВидЦенРеализацииСЭтогоСклада;             
		КонецЕсли;
		
		Если УчетЗарплаты тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	СотрудникиСклады.Ссылка
			|ИЗ
			|	Справочник.Сотрудники.Склады КАК СотрудникиСклады
			|ГДЕ
			|	СотрудникиСклады.Склад = &Склад";
			
			Запрос.УстановитьПараметр("Склад", Объект.Склад);
			
			РезультатЗапроса = Запрос.Выполнить();
			Если НЕ РезультатЗапроса.Пустой() Тогда
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					ПараметрыОтбора = Новый Структура;
					ПараметрыОтбора.Вставить("Сотрудник", ВыборкаДетальныеЗаписи.Ссылка);
					
					СтрокаСотрудника = Объект.ОтражениеВЗарплате.НайтиСтроки(ПараметрыОтбора);
					Если СтрокаСотрудника.Количество() = 0 тогда
						СтрокаСотрудника = Объект.ОтражениеВЗарплате.Добавить();
						СтрокаСотрудника.Сотрудник = ВыборкаДетальныеЗаписи.Ссылка;
					Иначе
						СтрокаСотрудника = СтрокаСотрудника[0];
					КонецЕсли;
					
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли; 		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПоФактуПриИзменении(Элемент)
	ПересчитатьСтроку(ИСТИНА);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ПересчитатьСтроку();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоРазницаПриИзменении(Элемент)
	ПересчитатьСтроку();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = ЛОЖЬ;
	
	ПараметрыФормы = Новый Структура;
	Если ИспользоватьСложныйМеханизмЦен
		И ЗначениеЗаполнено(Объект.ВидЦен) Тогда
		
		ПараметрыФормы.Вставить("ВидЦен", Объект.ВидЦен);
	КонецЕсли;	
	
	Если ВестиУчетПоСкладам
		И ЗначениеЗаполнено(Объект.Склад) Тогда
		
		ПараметрыФормы.Вставить("ОтборПоСкладу", Объект.Склад);
	КонецЕсли;	
	ПараметрыФормы.Вставить("ОтборПоДате", Объект.Дата);
	
	Если ОбщийМодульПовтор.ПолучитьТекущуюСредуВыполнения() = 1 Тогда
		ПараметрыФормы.Вставить("ТекущаяСтрока", Элементы.Товары.ТекущиеДанные.Номенклатура);	
	КонецЕсли;
	ФормаВыбора = ПолучитьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормы);
	
	Номенклатура = ФормаВыбора.ОткрытьМодально();
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		Элементы.Товары.ТекущиеДанные.Номенклатура = Номенклатура;	
		
		ПриИзмененииНоменклатуры();
		Элементы.Товары.ЗакончитьРедактированиеСтроки(ЛОЖЬ);
		Элементы.Товары.ТекущийЭлемент = Элементы.ТоварыКоличествоПоФакту;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	ОбщийМодульКлиент.ПоискОшибкиКодировки("Номенклатура", ДанныеВыбора, Текст, Элементы.Товары.ТекущиеДанные.Номенклатура);
	
	Если ЗначениеЗаполнено(ДанныеВыбора) Тогда
		ПриИзмененииНоменклатуры() 	;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)	
	ПриИзмененииНоменклатуры();	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПоФактуПриИзменении(Элемент)
	ПересчитатьСтроку();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	ПересчитатьСтроку();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаразницаПриИзменении(Элемент)
	ПересчитатьСтроку();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ПересчитатьСтроку();
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСтрокиВКоторыхНетРазницы(Команда)
	УдалитьСтрокиВКоторыхНетРазницыНаСервере();
КонецПроцедуры

&НаСервере
Процедура УдалитьСтрокиВКоторыхНетРазницыНаСервере()
	
	МассивСтрок = Новый Массив;
	Для Каждого строкаТовара из Объект.Товары Цикл
		Если строкатовара.КоличествоРазница = 0 Тогда
			МассивСтрок.добавить(строкатовара);
		КонецЕсли;	
	КонецЦикла;
	
	Для Каждого СтрокаТовара из МассивСтрок Цикл
		Объект.Товары.Удалить(СтрокаТовара);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НеПроизводитьОприходованиеИСписаниеЭтимДокументомПриИзменении(Элемент)
	СменитьВидДокумента();
КонецПроцедуры

&НаКлиенте
Процедура СменитьВидДокумента()
	
	Если Объект.НеПроизводитьОприходованиеИСписаниеЭтимДокументом Тогда
		Элементы.ФормаПровестиИЗакрыть.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Провести и закрыть");
	ИначеЕсли Элементы.ФормаПровестиИЗакрыть.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Провести и закрыть") Тогда
		Элементы.ФормаПровестиИЗакрыть.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Провести (списание / оприходование к факту) и закрыть");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Сторно(Команда)
	
	Если Вопрос(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Выполнить сторнирование (отмену текущим временем) документа?") + Символы.ПС + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Операция необратима!"), РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		Причина = ПредопределенноеЗначение("Справочник.ПричиныСторнированияДокументов.ПустаяСсылка");
		ВвестиЗначение(Причина, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите причину сторнирования.."));
		Если ЗначениеЗаполнено(Причина) Тогда
			ОткрытьЗначение( ОбщийМодульСервер.СоздатьДокументСторно(Объект.Ссылка, Причина));
			Закрыть();	
		Иначе
			Сообщить(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Сторнирование без причин запрещено!"));
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Если ИспользоватьСторнированиеДокументов
		И Объект.Дата < ОбщийМодульКлиент.ПользователяТекущаяДата() Тогда
		
		Объект.Дата = ОбщийМодульКлиент.ПользователяТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры
