//sza140420-1542 SZA: 
//sza130920-0118 : 

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("002350", , , );
	
	Если Не Отказ Тогда
		ПараметрыФормы = Новый Структура("", );
		ОткрытьФорму("Документ.УстановкиЦен.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);//, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	КонецЕсли;

КонецПроцедуры
