//sza140116-2102 : 
//sza131009-1747  

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)          // ПРИ СОЗДАНИИ НА СЕРВЕРЕ
	
	УчетВалют = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетВалют") ;
	УчитыватьДеньгиВНесколькихХранилищах = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("УчитыватьДеньгиВНесколькихХранилищах") ;
	Элементы.ОстаткиФормаОплаты.Видимость = НЕ УчитыватьДеньгиВНесколькихХранилищах;
	
	Элементы.ОстаткиВалюта.Видимость = УчетВалют;
	Элементы.ОстаткиСуммаВВалютеОстаток.Видимость = УчетВалют;
	Если не учетвалют Тогда
		Элементы.ОстатокВОсновнойВалюте.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Всего");
	КонецЕсли;
	ТекущаяДата = ОбщийМодульСервисСервер.ПользователяТекущаяДата();
	
	НаименованиеОсновнойВалюты = Справочники.Валюты.ОсновнаяВалюта.Наименование ;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)                                                                    // ПРИ ОТКРЫТИИ
	
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
	ОстатокВОсновнойВалюте = ОбновитьОбщийОстаток(ТекущаяДата);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()                                                  // ПРИ ЗАКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаСервереБезКонтекста
Функция   ОбновитьОбщийОстаток(ТекущаяДата)

	ОстатокВОсновнойВалюте = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ДеньгиОстатки.Валюта, ДеньгиОстатки.СуммаВВалютеОстаток
	|ИЗ РегистрНакопления.Деньги.Остатки(&ТекущаяДата, ) КАК ДеньгиОстатки";
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	если не РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ОстатокВОсновнойВалюте = 0;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ОстатокВОсновнойВалюте = ОстатокВОсновнойВалюте + ОбщийМодульСервер.ПоКурсу(ВыборкаДетальныеЗаписи.СуммаВВалютеОстаток, , ВыборкаДетальныеЗаписи.валюта);
		КонецЦикла;	
	КонецЕсли;
	
	Возврат ОстатокВОсновнойВалюте;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьПоказательДолга(Команда)
	
	ТекущаяДата = ОбщийМодульКлиент.ПользователяТекущаяДата();
	ОстатокВОсновнойВалюте = ОбновитьОбщийОстаток(ТекущаяДата);	
	Элементы.Остатки.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	форма = ПолучитьФорму("Документ.ДвиженияДенег.ФормаСписка");
	форма.открыть();
	
КонецПроцедуры

