// sza150209-1102
// sza140420-1345  
// sza131009-1747  

&НаКлиенте
Процедура ВыводНадписиПоФормуле()
	
	ПроизвольнаяНадписьФормыВидно = ЛОЖЬ;
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьФормулыАвтоНаименованияФормированияШтрихКодаИТекстаСШтрихКодом") Тогда
		
		СтруктураФормулы = ОбщийМодульПовтор.ОпределитьНужнуюФормулуДляНадписиНаФорме(ЭтаФорма.ИмяФормы);
		Если НЕ СтруктураФормулы = Неопределено Тогда
			
			Элементы.ОбновитьЗначениеПоФормулеНадписиФормы.Видимость = СтруктураФормулы.ВыводитьКнопкуОбновленияНадписи;
			Если СтруктураФормулы.ВыполнитьНаСервереСОбъектом Тогда
				Элементы.ПроизвольнаяНадписьФормы.Заголовок = ВыводНадписиПоФормулеНаСервере(СтруктураФормулы.Формула);
			Иначе
				Попытка 
					Выполнить(" Элементы.ПроизвольнаяНадписьФормы.Заголовок = " + СтруктураФормулы.Формула + ";");
				Исключение 	
				КонецПопытки;	
			КонецЕсли;
			
			ПроизвольнаяНадписьФормыВидно = ИСТИНА;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.ПроизвольнаяНадписьФормы.Видимость = ПроизвольнаяНадписьФормыВидно;
	
КонецПроцедуры

&НаСервере
Функция   ВыводНадписиПоФормулеНаСервере(Знач Формула)
	
	Результат = "";
	Попытка 
		Выполнить(" Результат = " + Формула + ";");
	Исключение 	
	КонецПопытки;	
	
	Возврат Результат;
	
КонецФункции //ВыводНадписиПоФормулеНаСервере

&НаКлиенте
Процедура ОбновитьЗначениеПоФормулеНадписиФормы(Команда)
	ВыводНадписиПоФормуле();
КонецПроцедуры

&НаСервереБезКонтекста
Функция   ОбновитьОбщийОстаток(Знач ТекущаяДата)
	
	ОстатокВОсновнойВалюте = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ДеньгиОстатки.Валюта, ДеньгиОстатки.СуммаВВалютеОстаток
	|ИЗ РегистрНакопления.Деньги.Остатки(&ТекущаяДата, ) КАК ДеньгиОстатки";
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ОстатокВОсновнойВалюте = 0;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ОстатокВОсновнойВалюте = ОстатокВОсновнойВалюте + ОбщийМодульСервер.ПоКурсу(ВыборкаДетальныеЗаписи.СуммаВВалютеОстаток, , ВыборкаДетальныеЗаписи.валюта);
		КонецЦикла;	
	КонецЕсли;
	
	Возврат ОстатокВОсновнойВалюте;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьПоказательДолга(Команда)
	
	ТекущаяДата = ОбщийМодульКлиент.ПользователяТекущаяДата();
	ОстатокВОсновнойВалюте = ОбновитьОбщийОстаток(ТекущаяДата);	
	Элементы.Остатки.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОстаткиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьФорму("Документ.ДвиженияДенег.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ПослеИзображенияОкнаФормы() // Когда окно уже нарисовано пользователю
	ЭтаФорма.Элементы.ФормаЗакрыть.Видимость = НЕ ЭтаФорма.Окно = Неопределено;	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()                                               // ПРИ ЗАКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)                                          // ПРИ ОТКРЫТИИ
	
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
	ОстатокВОсновнойВалюте = ОбновитьОбщийОстаток(ТекущаяДата);
	
	ВыводНадписиПоФормуле();
	
	ПодключитьОбработчикОжидания("ПослеИзображенияОкнаФормы", 0.3, ИСТИНА);	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)          // ПРИ СОЗДАНИИ НА СЕРВЕРЕ
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("000890", ЭтаФорма, Отказ, );
	
	Если НЕ Отказ Тогда	
		Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьСобственныйПереводЭлементовИнтерфейса") Тогда
			ОбщийМодульСервер.ПеревестиРеквизитыФормы(ЭтаФорма);	
		КонецЕсли;
		
		УчетВалют = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетВалют");
		ВестиУчетДенегВНесколькихХранилищах   = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетДенегВНесколькихХранилищах");
		Элементы.ОстаткиФормаОплаты.Видимость = НЕ ВестиУчетДенегВНесколькихХранилищах;
		
		Элементы.ОстаткиВалюта.Видимость = УчетВалют;
		Элементы.ОстаткиСуммаВВалютеОстаток.Видимость = УчетВалют;
		Элементы.СуммаБухОстаток.Видимость = НЕ УчетВалют;
		
		Если НЕ УчетВалют Тогда
			Элементы.ОстатокВОсновнойВалюте.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Всего");
		КонецЕсли;
		ТекущаяДата = ОбщийМодульСервисСервер.ПользователяТекущаяДата();
		
		НаименованиеОсновнойВалюты = "" + ПредопределенноеЗначение("Справочник.Валюты.ОсновнаяВалюта");
	КонецЕсли;
	
КонецПроцедуры
