//sza140420-2113 SZA: 
//sza131001-0326 : 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)          // ПРИ СОЗДАНИИ НА СЕРВЕРЕ
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("002350", ЭтаФорма, Отказ, );	
	
	Если НЕ ОТказ ТОгда
		Если НЕ ЗначениеЗаполнено(Запись.ВидЦен) Тогда
			Запись.ВидЦен = Справочники.ВидыЦен.ОсновнойВидЦен ;
			запись.Вручную = истина;
		КонецЕсли;	
		
		проверитьЗависимостьВидаЦен();	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьЗависимостьВидаЦен()
	
	Если ЗначениеЗаполнено(Запись.ВидЦен) Тогда
		ЭтоЗависимаяЦена = Запись.ВидЦен.Зависимая;
	Иначе
		ЭтоЗависимаяЦена = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаНачалоМесяца(Команда)
	
	Запись.Период = НачалоМесяца(Запись.Период);
	запись.Вручную = истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Сегодня(Команда)
	
	Запись.Период = ОбщийМодульКлиент.ПользователяТекущаяДата();
	запись.Вручную = истина;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ВидыЦен.Ссылка
	//|ИЗ
	//|	Справочник.ВидыЦен КАК ВидыЦен
	//|ГДЕ
	//|	ВидыЦен.Зависимая = Истина
	//|	И ВидыЦен.ОсновнойВидЦен = &ОсновнойВидЦен
	//|	И ВидыЦен.ПометкаУдаления = Ложь";
	//
	//Запрос.УстановитьПараметр("ОсновнойВидЦен", ТекущийОбъект.ВидЦен);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//если не РезультатЗапроса.Пустой() тогда
	//	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//	
	СтрокаТовара = Новый Структура;
	СтрокаТовара.Вставить("Номенклатура", ТекущийОбъект.Номенклатура);
	СтрокаТовара.Вставить("Цена", ТекущийОбъект.Цена);
	//	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//ОбщийМодульСервер.УстановитьЦенуИВсеЗависимые(ВыборкаДетальныеЗаписи.Ссылка, СтрокаТовара, , ТекущийОбъект.Комментарий, ТекущийОбъект.Период, Истина);
	ОбщийМодульСервер.УстановитьЦенуИВсеЗависимые(ТекущийОбъект.ВидЦен, СтрокаТовара, , ТекущийОбъект.Комментарий, ТекущийОбъект.Период, Истина, , , , , ТекущийОбъект.ЕдиницаИзмерения);
	//	КонецЦикла;            
	//	
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)                                         // ПРИ ОТКРЫТИИ
	
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0, Запись.Ответственный, истина);
	ПроверитьВидЦенЗависимый();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВидЦенЗависимый()
	
	Если ЭтоЗависимаяЦена
		И Вопрос(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("" + Запись.ВидЦен + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке(" - это Зависимый Вид Цен.") + символы.пс + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Редакция вручную не рекомендована. Все равно открыть для записи?")), РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
		
		Заблокироватьзапись();
	КонецЕсли;
	
КонецПроцедуры	

&НаКлиенте
Процедура ВидЦенПриИзменении(Элемент)
	
	проверитьЗависимостьВидаЦен();
	ПроверитьВидЦенЗависимый();
	запись.Вручную = истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаблокироватьЗапись()
	
	ОбщийМодульСервер.ОбработатьБлокировку(, ЭтаФорма);	
	элементы.Сегодня.Доступность 		= ложь;
	элементы.НаНачалоМесяца.Доступность = ложь;
	элементы.ВидЦен.Доступность 		= Ложь;
	элементы.Цена.Доступность 		  	= Ложь;
	элементы.Номенклатура.Доступность 	= Ложь;
	элементы.Период.Доступность 		= Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()                                                  // ПРИ ЗАКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаКлиенте
Процедура ЦенаПриИзменении(Элемент)
	запись.Вручную = истина;
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	запись.Вручную = истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	запись.Вручную = истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	глЧислоОбъектов = глЧислоОбъектов + 1; глПроверятьСообщения = Истина;
КонецПроцедуры
