//sza140420-2113  
//sza131001-0326 : 
&НаКлиенте
Процедура ВидЦенПриИзменении(Элемент)
	
	проверитьЗависимостьВидаЦен();
	ПроверитьВидЦенЗависимый();
	запись.Вручную = ИСТИНА;
	
КонецПроцедуры

&НаСервере
Процедура ЗаблокироватьЗапись()
	
	ОбщийМодульСервер.ОбработатьБлокировку(, ЭтаФорма);	
	Элементы.Сегодня.Доступность 		= ЛОЖЬ;
	Элементы.НаНачалоМесяца.Доступность = ЛОЖЬ;
	Элементы.ВидЦен.Доступность 		= ЛОЖЬ;
	Элементы.Цена.Доступность 		  	= ЛОЖЬ;
	Элементы.Номенклатура.Доступность 	= ЛОЖЬ;
	Элементы.Период.Доступность 		= ЛОЖЬ;
	
КонецПроцедуры

&НаКлиенте
Процедура НаНачалоМесяца(Команда)
	
	Запись.Период = НачалоМесяца(Запись.Период);
	запись.Вручную = ИСТИНА;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	запись.Вручную = ИСТИНА;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	запись.Вручную = ИСТИНА;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	глЧислоОбъектов = глЧислоОбъектов + 1; глПроверятьСообщения = ИСТИНА;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	СтрокаТовара = Новый Структура;
	СтрокаТовара.Вставить("Номенклатура", ТекущийОбъект.Номенклатура);
	СтрокаТовара.Вставить("Цена", ТекущийОбъект.Цена);
	ОбщийМодульСервер.УстановитьЦенуИВсеЗависимые(ТекущийОбъект.ВидЦен, СтрокаТовара, , ТекущийОбъект.Комментарий, ТекущийОбъект.Период, ИСТИНА, , , , , ТекущийОбъект.ЕдиницаИзмерения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()                                              // ПРИ ЗАКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)                                         // ПРИ ОТКРЫТИИ
	
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0, Запись.Ответственный, ИСТИНА);
	ПроверитьВидЦенЗависимый();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)          // ПРИ СОЗДАНИИ НА СЕРВЕРЕ
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("002350", ЭтаФорма, Отказ, );	
	
	Если НЕ Отказ Тогда
		Если НЕ ЗначениеЗаполнено(Запись.ВидЦен) Тогда
			Запись.ВидЦен  = ПредопределенноеЗначение("Справочник.ВидыЦен.ГлавныйВидЦен");
			запись.Вручную = ИСТИНА;
		КонецЕсли;	
		
		ПроверитьЗависимостьВидаЦен();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВидЦенЗависимый()
	
	Если ЭтоЗависимаяЦена
		И Вопрос("" + Запись.ВидЦен + " - " + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("это Зависимый Вид Цен.") + символы.пс + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Редакция вручную не рекомендована. Все равно открыть для записи?"), РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
		
		ЗаблокироватьЗапись();
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Процедура ПроверитьЗависимостьВидаЦен()
	
	Если ЗначениеЗаполнено(Запись.ВидЦен) Тогда
		ЭтоЗависимаяЦена = Запись.ВидЦен.Зависимая;
	Иначе
		ЭтоЗависимаяЦена = ЛОЖЬ;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Сегодня(Команда)
	
	Запись.Период = ОбщийМодульКлиент.ПользователяТекущаяДата();
	запись.Вручную = ИСТИНА;
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенаПриИзменении(Элемент)
	запись.Вручную = ИСТИНА;
КонецПроцедуры
