// sza140420-0404
// sza131005-0206 : 

&НаКлиенте
Процедура ДеревоПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("УстановитьОтборПоИерархииОбработчикОжидания", 0.2, ИСТИНА);
КонецПроцедуры

&НаКлиенте
Процедура ПослеИзображенияОкнаФормы() // Когда окно уже нарисовано пользователю
	ЭтаФорма.Элементы.ФормаЗакрыть.Видимость = НЕ ЭтаФорма.Окно = Неопределено;	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()                                         // ПРИ ЗАКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)                                    // ПРИ ОТКРЫТИИ
	
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
	ПодключитьОбработчикОжидания("ПослеИзображенияОкнаФормы", 0.3, ИСТИНА);	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("000800", ЭтаФорма, Отказ, );
		Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьСобственныйПереводЭлементовИнтерфейса") Тогда
			ОбщийМодульСервер.ПеревестиРеквизитыФормы(ЭтаФорма);	
		КонецЕсли;
		
	ОбщийМодульСервер.ОбеспечитьСписокОтборов(Список);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоИерархииОбработчикОжидания()
	
	ТекущиеДанные = Элементы.Дерево.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		ТекущиеДанныеНавигации = Элементы.Дерево.ТекущиеДанные.Ссылка;
		Если НЕ ТекущийРодитель = ТекущиеДанныеНавигации Тогда
			
			ТекущийРодитель = ТекущиеДанныеНавигации;
			
			ЗначениеОтбора = ?(ТекущиеДанныеНавигации <> Неопределено, ТекущиеДанныеНавигации, ПредопределенноеЗначение("Справочник.СтатьиДвиженияДенег.ПустаяСсылка"));
			ОбщийМодульКлиент.УстановитьЭлементОтбора(
			Список.Отбор,
			"Родитель",
			ЗначениеОтбора,
			ВидСравненияКомпоновкиДанных.Равно,
			,
			ИСТИНА
			);
			
			Если ТекущиеДанныеНавигации <> Неопределено Тогда
				Элементы.Наименование.Заголовок = СокрЛП(значениеотбора);
			Иначе
				Элементы.Наименование.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Наименование");
			КонецЕсли;	
		КонецЕсли;   	
	КонецЕсли;
	
КонецПроцедуры
