// sza150117-0347
// Суров С.В <s_surov@mail.ru>

Процедура ПереопределитьФормуУзла(ВыбраннаяФорма) Экспорт
	
	ОбменССайтомПереопределяемый.ПереопределитьФормуУзла(ВыбраннаяФорма);
	
КонецПроцедуры

// sza150117-0347
Процедура ПеререгистроватьВсеОбъекты() Экспорт
	
	УстановитьПривилегированныйРежим(ИСТИНА);
	МассивУзловТовары = ОбменССайтомПовтИсп.МассивУзловДляРегистрации(ИСТИНА);
	МассивУзловЗаказы = ОбменССайтомПовтИсп.МассивУзловДляРегистрации(,ИСТИНА);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Номенклатура.Ссылка
	|ИЗ Справочник.Номенклатура КАК Номенклатура";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл		
		ПланыОбмена.ЗарегистрироватьИзменения(МассивУзловТовары, ВыборкаДетальныеЗаписи.Ссылка);		
	КонецЦикла;
	
	Запрос.Текст = "ВЫБРАТЬ Изображения.Ссылка,
	|	Изображения.СвязанныйОбъект
	|ИЗ Справочник.Изображения КАК Изображения";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СвязанныйОбъект)
			ИЛИ НЕ ТипЗнч(ВыборкаДетальныеЗаписи.СвязанныйОбъект) = Тип("СправочникСсылка.Номенклатура") Тогда
			
			Продолжить;				
		КонецЕсли;
		
		ПланыОбмена.ЗарегистрироватьИзменения(МассивУзловТовары, ВыборкаДетальныеЗаписи.Ссылка);		
	КонецЦикла;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	РасходыТовара.Ссылка,
	|	РасходыТовара.Статус
	|ИЗ Документ.РасходыТовара КАК РасходыТовара
	|ГДЕ РасходыТовара.ЭтоЗаказ = ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ОбменССайтамиУТ.ВписатьСтатусЗаказа(ВыборкаДетальныеЗаписи.Ссылка, ВыборкаДетальныеЗаписи.Статус);
		
		Для Каждого УзелОбмена Из МассивУзловЗаказы Цикл
			ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена, ВыборкаДетальныеЗаписи.Ссылка);
		КонецЦикла;		
	КонецЦикла;
	
КонецПроцедуры
