// sza140420-1556
// sza131023-1656 : 

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("000650", , , );	
	
	Если НЕ Отказ Тогда
		ПараметрыФормы = Новый Структура("Поставщик", ПараметрКоманды);
		ОткрытьФорму("ЖурналДокументов.ДокументыПоставщика.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);// , ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	КонецЕсли;
	
КонецПроцедуры
