// sza150324-1458 
// sza141128-2308
// sza140420-0431  
// sza131115-1807
&НаКлиенте
Процедура ОтборПоКонтрагентуПриИзменении(Элемент)
	ОтборПоКонтрагентуПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтборПоКонтрагентуПриИзмененииНаСервере()
	
	НетОтбораПоКонтрагенту = не ЗначениеЗаполнено(ОтборПоКонтрагенту);
	Список.Параметры.УстановитьЗначениеПараметра("НетОтбораПоКонтрагенту", НетОтбораПоКонтрагенту);
	Список.Параметры.УстановитьЗначениеПараметра("КлиентПоставщик", ОтборПоКонтрагенту);
	
	Элементы.КлиентПоставщик.Видимость = НетОтбораПоКонтрагенту;
	
	НетОтбораПоЮрЛицу = не ЗначениеЗаполнено(ОтборПоЮридическомуЛицу);
	Список.Параметры.УстановитьЗначениеПараметра("НетОтбораПоЮрЛицу", НетОтбораПоЮрЛицу);
	Список.Параметры.УстановитьЗначениеПараметра("Организация", ОтборПоЮридическомуЛицу);
	
	Элементы.ОтборПоЮридическомуЛицу.Видимость = НетОтбораПоЮрЛицу;
	
	Элементы.ОтключитьОтборы.Видимость = НЕ НетОтбораПоЮрЛицу ИЛИ НЕ НетОтбораПоКонтрагенту;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоЮридическомуЛицуПриИзменении(Элемент)
	ОтборПоКонтрагентуПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
	ОтборПоКонтрагентуПриИзмененииНаСервере();
	
	ПодключитьОбработчикОжидания("ПослеИзображенияОкнаФормы", 0.3, ИСТИНА);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеИзображенияОкнаФормы() // Когда окно уже нарисовано пользователю
	ЭтаФорма.Элементы.ФормаЗакрыть.Видимость = НЕ ЭтаФорма.Окно = Неопределено;	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("000660", ЭтаФорма, Отказ, );
	
	Если НЕ Отказ Тогда
		Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьСобственныйПереводЭлементовИнтерфейса") Тогда
			ОбщийМодульСервер.ПеревестиРеквизитыФормы(ЭтаФорма);	
		КонецЕсли;
		
		ОтборПоКонтрагенту 		= Параметры.КлиентПоставщик;
		ОтборПоЮридическомуЛицу = параметры.ЮридическоеЛицо;
		ОтборПоКонтрагентуПриИзмененииНаСервере();
		ОбщийМодульСервер.ОбеспечитьСписокОтборов(Список);

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьОтборы(Команда)
	
	ОтборПоКонтрагенту = Неопределено;
	ОтборПоЮридическомуЛицу = ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка");
	ОтборПоКонтрагентуПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьДоговор(Команда)
	
	ПараметрыФормыДоговора = Новый Структура("КлиентПоставщик", ОтборПоКонтрагенту);
	ПараметрыФормыДоговора.Вставить("ЮрЛицо", ОтборПоЮридическомуЛицу);
	ОткрытьФорму("Справочник.Договора.ФормаОбъекта", ПараметрыФормыДоговора, ЭтаФорма);
	
КонецПроцедуры
