//sza140507-1152 SZA: 
//sza131117-0119

Процедура ШапкаДокументов(ТабДок, Ссылка) Экспорт
	
	ТабДок.Очистить();
	ОбщийМодульСервер.ДобавитьШапкуОрганизации(ТабДок, ссылка);
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если НЕ ОбщийМодульПовтор.ТекущийЯзыкРусский()
		и ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ПоддерживатьНаименованияНаДругихЯзыкахКромеРусского", Истина) Тогда
		
		ВозможноеПредставление = ОбщийМодульПовтор.получитьПредставлениеНаЯзыке(Данные.ссылка, , Истина);
		Если НЕ ВозможноеПредставление = Неопределено Тогда
			Представление = ВозможноеПредставление;
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура НаПечать(ТабДок, Ссылка) Экспорт
	
	Макет = Справочники.Организации.ПолучитьМакет("НаПечать");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Организации.Адрес,
	               |	Организации.ВидДеятельностиПоОКДП,
	               |	Организации.ВидЦен,
	               |	Организации.ГлавныйБухгалтер,
	               |	Организации.ДатаРедакции,
	               |	Организации.ДатаСоздания,
	               |	Организации.ДолжностьРуководителя,
	               |	Организации.Комментарий,
	               |	Организации.МФО,
	               |	Организации.НаименованиеБанка,
	               |	Организации.НаименованиеДляПечати,
	               |	Организации.НомерСвидетельстваПлательщикаНалогаНаДобавочнуюСтоимость,
	               |	Организации.НомерСчета,
	               |	Организации.ОКПО,
	               |	Организации.ОсновнойШтрихКод,
	               |	Организации.Ответственный,
	               |	Организации.ПоследнийНомерНалоговойНакладной,
	               |	Организации.ПравовойСтатус,
	               |	Организации.Регион,
	               |	Организации.Руководитель,
	               |	Организации.Склад,
	               |	Организации.Сотрудник,
	               |	Организации.СтавкаНДС,
	               |	Организации.Телефон,
	               |	Организации.ФормаВзаиморасчетовПоУмолчанию,
	               |	Организации.ХранилищеДенег,
	               |	Организации.ЭлектроннаяПочта,
	               |	Организации.ИНН
	               |ИЗ
	               |	Справочник.Организации КАК Организации
	               |ГДЕ
	               |	Организации.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		Если НЕ ЗначениеЗаполнено(Выборка.НаименованиеДляПечати) Тогда
			Шапка.Параметры.НаименованиеДляПечати = Выборка.Наименование;
		КонецЕсли;

		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	
КонецПроцедуры
