//sza140109-2352 : 
//sza131117-0146

Процедура ПередЗаписью(Отказ)
	
	Отказ = ОбщийМодульСервер.ПроверитьУникальностьОКПО(Отказ, "Организации", ЭтотОбъект.ОКПО, ЭтотОбъект.Ссылка);
	Отказ = ОбщийМодульСервер.ПроверитьУникальностьНаименование(Отказ, "Организации", ЭтотОбъект.Наименование, ЭтотОбъект.Ссылка);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ЭтотОбъект.комментарий = "";
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Сотрудники") Тогда
		// Заполнение шапки
		Адрес = ДанныеЗаполнения.Адрес;
		Комментарий = ДанныеЗаполнения.Комментарий;
		Наименование = ДанныеЗаполнения.Наименование;
		ОКПО = ДанныеЗаполнения.ОКПО;
		Сотрудник = ДанныеЗаполнения.Ссылка;
		Телефон = ДанныеЗаполнения.Телефон;
		ХранилищеДенег = ДанныеЗаполнения.ХранилищеДенег;
		ЭлектроннаяПочта = ДанныеЗаполнения.ЭлектроннаяПочта;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ХранилищаДенег") Тогда
		// Заполнение шапки
		Комментарий = ДанныеЗаполнения.Комментарий;
		МФО = ДанныеЗаполнения.МФО;
		Наименование = ДанныеЗаполнения.Наименование;
		НаименованиеБанка = ДанныеЗаполнения.НаименованиеБанка;
		НомерСчета = ДанныеЗаполнения.НомерСчета;
		ХранилищеДенег = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
	
КонецПроцедуры
