//sza140411-1701 : 
//sza131117-0146

Процедура ПередЗаписью(Отказ)
	
	Если НЕ Отказ 
		И Не ПометкаУдаления Тогда
		
		Отказ = ОбщийМодульСервер.ПроверитьУникальностьОКПО(Отказ, "Организации", ЭтотОбъект.ОКПО, ЭтотОбъект.Ссылка);
		Отказ = ОбщийМодульСервер.ПроверитьУникальностьНаименование(Отказ, "Организации", ЭтотОбъект.Наименование, ЭтотОбъект.Ссылка);
		ОбщийМодульСервер.ПроверитьСменуНаименованияНаТекущемЯзыке(Наименование, Ссылка, , Отказ);
		ОбщийМодульСервер.ПроверитьСменуНаименованияНаТекущемЯзыке(НаименованиеДляПечати, Ссылка, "НаименованиеДляПечати", Отказ);	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ЭтотОбъект.комментарий = "";
	ЭтотОбъект.НаименованиеДляПечати = "";
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Сотрудники") Тогда
		// Заполнение шапки
		Адрес = ДанныеЗаполнения.Адрес;
		Комментарий = ДанныеЗаполнения.Комментарий;
		Наименование = ДанныеЗаполнения.Наименование;
		ОКПО = ДанныеЗаполнения.ОКПО;
		Сотрудник = ДанныеЗаполнения.Ссылка;
		Телефон = ДанныеЗаполнения.Телефон;
		ХранилищеДенег = ДанныеЗаполнения.ХранилищеДенег;
		ЭлектроннаяПочта = ДанныеЗаполнения.ЭлектроннаяПочта;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ХранилищаДенег") Тогда
		// Заполнение шапки
		Комментарий = ДанныеЗаполнения.Комментарий;
		МФО = ДанныеЗаполнения.МФО;
		Наименование = ДанныеЗаполнения.Наименование;
		НаименованиеБанка = ДанныеЗаполнения.НаименованиеБанка;
		НомерСчета = ДанныеЗаполнения.НомерСчета;
		ХранилищеДенег = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
	
КонецПроцедуры
