// sza151210-2253 про
// sza140411-1701 : 
// sza131117-0146
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Сотрудники") Тогда
		// Заполнение шапки
		Адрес 			= ДанныеЗаполнения.Адрес;
		Комментарий 	= ДанныеЗаполнения.Комментарий;
		Наименование 	= ДанныеЗаполнения.Наименование;
		ОКПО 			= ДанныеЗаполнения.ОКПО;
		ИНН 			= ДанныеЗаполнения.ИНН;
		Сотрудник 		= ДанныеЗаполнения.Ссылка;
		Телефон 		= ДанныеЗаполнения.Телефон;
		Телефон2 		= ДанныеЗаполнения.Телефон2;
		Телефон3 		= ДанныеЗаполнения.Телефон3;
		Телефон4 		= ДанныеЗаполнения.Телефон4;
		Телефон5 		= ДанныеЗаполнения.Телефон5;
		ХранилищеДенег  = ДанныеЗаполнения.ХранилищеДенег;
		ЭлектроннаяПочта = ДанныеЗаполнения.ЭлектроннаяПочта;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ХранилищаДенег") Тогда
		// Заполнение шапки
		Комментарий 	= ДанныеЗаполнения.Комментарий;
		МФО 			= ДанныеЗаполнения.МФО;
		Наименование 	= ДанныеЗаполнения.Наименование;
		НаименованиеБанка = ДанныеЗаполнения.НаименованиеБанка;
		НомерСчета 		= ДанныеЗаполнения.НомерСчета;
		ХранилищеДенег 	= ДанныеЗаполнения.Ссылка;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если НЕ Отказ 
		И НЕ ПометкаУдаления Тогда
		
		Отказ = ОбщийМодульСервер.ПроверитьУникальностьОКПО(Отказ, "Организации", ОКПО, Ссылка);
		
		Отказ = ОбщийМодульСервер.ПроверитьУникальностьЗначенияРеквизита(Отказ, "Организации", Наименование, Ссылка);
		
		Отказ = ОбщийМодульСервер.ПроверитьУникальностьНомераТелефона(Отказ, "Организации", Телефон, Ссылка);
		Если НЕ ПустаяСтрока(Телефон2) Тогда
			Отказ = ОбщийМодульСервер.ПроверитьУникальностьНомераТелефона(Отказ, "Организации", Телефон2, Ссылка);
		КонецЕсли;			
		Если НЕ ПустаяСтрока(Телефон3) Тогда
			Отказ = ОбщийМодульСервер.ПроверитьУникальностьНомераТелефона(Отказ, "Организации", Телефон3, Ссылка);
		КонецЕсли;			
		Если НЕ ПустаяСтрока(Телефон4) Тогда
			Отказ = ОбщийМодульСервер.ПроверитьУникальностьНомераТелефона(Отказ, "Организации", Телефон4, Ссылка);
		КонецЕсли;			
		Если НЕ ПустаяСтрока(Телефон5) Тогда
			Отказ = ОбщийМодульСервер.ПроверитьУникальностьНомераТелефона(Отказ, "Организации", Телефон5, Ссылка);
		КонецЕсли;			
		
		ОбщийМодульСервер.ПроверитьСменуНаименованияНаТекущемЯзыке(Наименование, Ссылка, , Отказ);
		ОбщийМодульСервер.ПроверитьСменуНаименованияНаТекущемЯзыке(НаименованиеДляПечати, Ссылка, "НаименованиеДляПечати", Отказ);	
		
		Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ФормироватьОписаниеТаблицОбъектовДляИхСписков") Тогда				
			ОбщийМодульСервер.ОформитьОписаниеТаблицы(ЭтотОбъект, "ВидыДеятельности", "ВидДеятельности", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("видов деятельности"), "ВидДеятельности");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	комментарий = "";
	НаименованиеДляПечати = "";
КонецПроцедуры
