#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// sza131227-0155 :
Процедура Печать(ДокументДляПечати, Ссылка) Экспорт
	
	Макет = Справочники.ПодсистемаИЭДополнительноеПоведение.ПолучитьМакет("Печать");
	Макет.КодЯзыкаМакета = ОбщийМодульПовтор.ПолучитьТекущийЯзыкДокументов();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПодсистемаИЭДополнительноеПоведение.ВыполнитьПрограммныйКод,
	|	ПодсистемаИЭДополнительноеПоведение.ДатаРедакции,
	|	ПодсистемаИЭДополнительноеПоведение.ДатаСоздания,
	|	ПодсистемаИЭДополнительноеПоведение.ЗначениеРеквизита,
	|	ПодсистемаИЭДополнительноеПоведение.ИмяРеквизита,
	|	ПодсистемаИЭДополнительноеПоведение.Код,
	|	ПодсистемаИЭДополнительноеПоведение.Наименование,
	|	ВЫРАЗИТЬПодсистемаИЭДополнительноеПоведение.Описание КАК СТРОКА(1000)) КАК Описание,
	|	ПодсистемаИЭДополнительноеПоведение.Ответственный,
	|	ПодсистемаИЭДополнительноеПоведение.ПрограммныйКод,
	|	ПодсистемаИЭДополнительноеПоведение.УсловиеДополнительногоПоведенияПриИмпорте,
	|	ПодсистемаИЭДополнительноеПоведение.ТаблицаПоведения.(
	|		НомерСтроки,
	|		ИмяТаблицы,
	|		ИмяРеквизита,
	|		УсловиеДополнительногоПоведенияПриЭкспорте,
	|		ЗначениеРеквизита )
	|ИЗ Справочник.ПодсистемаИЭДополнительноеПоведение КАК ПодсистемаИЭДополнительноеПоведение
	|ГДЕ ПодсистемаИЭДополнительноеПоведение.Ссылка В (&Ссылка)";
	
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТаблицаПоведенияШапка = Макет.ПолучитьОбласть("ТаблицаПоведенияШапка");
	ОбластьТаблицаПоведения = Макет.ПолучитьОбласть("ТаблицаПоведения");
	Подвал = Макет.ПолучитьОбласть("Подвал");
	ДокументДляПечати.ИмяПараметровПечати  = "ИЭДопПоведение" + СокрЛП(ИмяКомпьютера());
	ДокументДляПечати.КлючПараметровПечати = ДокументДляПечати.ИмяПараметровПечати;
	
	ДокументДляПечати.Очистить();
	ВставлятьРазделительСтраниц = ЛОЖЬ;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ДокументДляПечати.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьЗаголовок);
		ДокументДляПечати.Вывести(ОбластьЗаголовок);
		Шапка.Параметры.Заполнить(Выборка);
		ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(Шапка);
		ДокументДляПечати.Вывести(Шапка, Выборка.Уровень());
		ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьТаблицаПоведенияШапка);
		ДокументДляПечати.Вывести(ОбластьТаблицаПоведенияШапка);
		ВыборкаТаблицаПоведения = Выборка.ТаблицаПоведения.Выбрать();
		Пока ВыборкаТаблицаПоведения.Следующий() Цикл
			ОбластьТаблицаПоведения.Параметры.Заполнить(ВыборкаТаблицаПоведения);
			ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьТаблицаПоведения);
			ДокументДляПечати.Вывести(ОбластьТаблицаПоведения, ВыборкаТаблицаПоведения.Уровень());
		КонецЦикла;
		Подвал.Параметры.Заполнить(Выборка);
		ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(Подвал);
		ДокументДляПечати.Вывести(Подвал);
		ВставлятьРазделительСтраниц = ИСТИНА;
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли