// sza131227-0155 : 
Процедура Печать(ТабДок, Ссылка) Экспорт
	
	Макет = Справочники.ПодсистемаИЭДополнительноеПоведение.ПолучитьМакет("Печать");
	Макет.КодЯзыкаМакета = ОбщийМодульПовтор.ПолучитьТекущийЯзыкДокументов();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПодсистемаИЭДополнительноеПоведение.ВыполнитьПрограммныйКод,
	|	ПодсистемаИЭДополнительноеПоведение.ДатаРедакции,
	|	ПодсистемаИЭДополнительноеПоведение.ДатаСоздания,
	|	ПодсистемаИЭДополнительноеПоведение.ЗначениеРеквизита,
	|	ПодсистемаИЭДополнительноеПоведение.ИмяРеквизита,
	|	ПодсистемаИЭДополнительноеПоведение.Код,
	|	ПодсистемаИЭДополнительноеПоведение.Наименование,
	|	ПодсистемаИЭДополнительноеПоведение.Описание,
	|	ПодсистемаИЭДополнительноеПоведение.Ответственный,
	|	ПодсистемаИЭДополнительноеПоведение.ПрограммныйКод,
	|	ПодсистемаИЭДополнительноеПоведение.УсловиеДополнительногоПоведенияПриИмпорте,
	|	ПодсистемаИЭДополнительноеПоведение.ТаблицаПоведения.(
	|		НомерСтроки,
	|		ИмяТаблицы,
	|		ИмяРеквизита,
	|		УсловиеДополнительногоПоведенияПриЭкспорте,
	|		ЗначениеРеквизита )
	|ИЗ Справочник.ПодсистемаИЭДополнительноеПоведение КАК ПодсистемаИЭДополнительноеПоведение
	|ГДЕ ПодсистемаИЭДополнительноеПоведение.Ссылка В (&Ссылка)";
	
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТаблицаПоведенияШапка = Макет.ПолучитьОбласть("ТаблицаПоведенияШапка");
	ОбластьТаблицаПоведения = Макет.ПолучитьОбласть("ТаблицаПоведения");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.ИмяПараметровПечати  = "ИЭДопПоведение" + СокрЛП(ИмяКомпьютера());
	ТабДок.КлючПараметровПечати = ТабДок.ИмяПараметровПечати;
	
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = ЛОЖЬ;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьЗаголовок);
		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(Шапка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьТаблицаПоведенияШапка);
		ТабДок.Вывести(ОбластьТаблицаПоведенияШапка);
		ВыборкаТаблицаПоведения = Выборка.ТаблицаПоведения.Выбрать();
		Пока ВыборкаТаблицаПоведения.Следующий() Цикл
			ОбластьТаблицаПоведения.Параметры.Заполнить(ВыборкаТаблицаПоведения);
			ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьТаблицаПоведения);
			ТабДок.Вывести(ОбластьТаблицаПоведения, ВыборкаТаблицаПоведения.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(Подвал);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = ИСТИНА;
	КонецЦикла;
	
КонецПроцедуры
