//sza140506-1727  
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Сотрудники") Тогда
		// Заполнение шапки
		Телефон 	 = ОбщийМодульСервер.ПолучитьТекстТелефонов(ДанныеЗаполнения);
		Организация  = ДанныеЗаполнения.Организация;
		Руководитель = ДанныеЗаполнения.Ссылка;
		
		СтрокаСостава = Состав.Добавить();
		СтрокаСостава.Сотрудник = ДанныеЗаполнения.Ссылка;
		СтрокаСостава.Должность = ДанныеЗаполнения.Должность;
		СтрокаСостава.ОСтроке   = ДанныеЗаполнения.Комментарий;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если НЕ Отказ 
		И НЕ ПометкаУдаления Тогда
		
		Отказ = ОбщийМодульСервер.ПроверитьУникальностьНаименование(Отказ, "Подразделения", Наименование, Ссылка);			
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Комментарий = "";
КонецПроцедуры
