//sza130923-1638 : 
&НаСервере
Процедура Друкувати(ТабДок, ПараметрКоманды)
	Справочники.ПодсистемаИЭИмпортЭкспортФСШаблоны.Друкувати(ТабДок, ПараметрКоманды);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "КАРТОЧКА_Ш";
	ТабДок.КлючПараметровПечати = ТабДок.ИмяПараметровПечати;
	
	Друкувати(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = ЛОЖЬ;
	ТабДок.Защита = ЛОЖЬ;
	ТабДок.ТолькоПросмотр = ЛОЖЬ;
	ТабДок.ОтображатьЗаголовки = ЛОЖЬ;
	ТабДок.Показать(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("печать: Шаблон И-Э"));
	
КонецПроцедуры



