//sza130923-1638 : 

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТабДок = Новый ТабличныйДокумент;
	Друкувати(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("печать: Шаблон И-Э"));
	
КонецПроцедуры

&НаСервере
Процедура Друкувати(ТабДок, ПараметрКоманды)
	Справочники.ПодсистемаИЭИмпортЭкспортФСШаблоны.Друкувати(ТабДок, ПараметрКоманды);
КонецПроцедуры
