// sza150131-0144

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Получатель = Неопределено;
	ПоказатьВводЗначения(Новый ОписаниеОповещения("ОбработкаКомандыЗавершение", ЭтотОбъект, Новый Структура("Получатель", Получатель)), Получатель, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите получателя") + ": ", тип("СправочникСсылка.Пользователи"));

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКомандыЗавершение(Значение, ДополнительныеПараметры) Экспорт
	
	Получатель = ?(Значение = Неопределено, ДополнительныеПараметры.Получатель, Значение);
	
	Если ЗначениеЗаполнено(Получатель) Тогда
		ПараметрыФормы = Новый Структура("Получатель", Получатель);
		ОткрытьФорму("РегистрСведений.СообщенияПользователюОтСистемы.Форма.ФормаЗаписи", ПараметрыФормы);// , ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);		
	КонецЕсли;
	
КонецПроцедуры
