//sza140521-0023 SZA: 
//sza131021-1347 : 

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = новый Структура;
	ПараметрыФормы.Вставить("ОбъектПечати", ПараметрКоманды[0]);
	ПараметрыФормы.Вставить("Контрагент", ПараметрКоманды[0]);
	ПараметрыФормы.Вставить("НаименованиеДокумента", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Карточка"));
	ФормаПечати = получитьформу("ОбщаяФорма.ФормаПечати", ПараметрыФормы);
	
	Печать(ФормаПечати.Результат, ПараметрКоманды);

	ФормаПечати.Результат.ОтображатьСетку 		= Ложь;
	ФормаПечати.Результат.Защита 				= Истина;
	ФормаПечати.Результат.ТолькоПросмотр 		= Истина;
	ФормаПечати.Результат.ОтображатьЗаголовки 	= Ложь;
	ФормаПечати.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("печать: карточка Клиента");
	ФормаПечати.открыть();
	
КонецПроцедуры

&НаСервере
Процедура Печать(ТабДок, Знач ПараметрКоманды)
	
	ОбщийМодульСервер.ДобавитьСобытиеЖурналаНаСервере(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Напечатал карточку клиента. "), 2);
	Справочники.Клиенты.Печать(ТабДок, ПараметрКоманды);
	
КонецПроцедуры
