// sza140420-1547  
// sza131212-0159  
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("001750", , , );
	
	Если НЕ Отказ Тогда
		ПараметрыФормы = Новый Структура("ЭтоЗаказ", ИСТИНА);
		ОткрытьФорму("Документ.ПоступленияТовара.Форма.ФормаСпискаЗаказов", ПараметрыФормы);// , ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);	
	КонецЕсли;
	
КонецПроцедуры



