//sza140420-1547 SZA: 
//sza131212-0159 SZA: 

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("001750", , , );
	
	Если НЕ Отказ Тогда
		ПараметрыФормы = Новый Структура("ЭтоЗаказ", Истина);
		ОткрытьФорму("Документ.ПоступленияТовара.Форма.ФормаСпискаЗаказов", ПараметрыФормы);//, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);	
	КонецЕсли;
	
КонецПроцедуры
