//sza140123-1405 
//sza131026-0132 

&НаКлиенте
Процедура ОтправитьПисьмо(Команда)
	
	ОтправитьПисьмоНаСервере();
	Закрыть();
	глПроверятьСообщения = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьПисьмоНаСервере()
	
	СтруктураПисьма = новый Структура;
	СтруктураПисьма.Вставить("ОтКого", ОтКого);
	СтруктураПисьма.Вставить("ТемаСообщения", ТемаСообщения);
	СтруктураПисьма.Вставить("ТекстСообщения", ТекстСообщения);
	СтруктураПисьма.Вставить("РегистрационныйКод", РегистрационныйКод);
	СтруктураПисьма.Вставить("Вручную", Истина);
	
	Если ЗначениеЗаполнено(ОтКого)
		и не ЗначениеЗаполнено(Константы.ЭлектроннаяПочтаОтправитель.Получить()) Тогда
		
		Константы.ЭлектроннаяПочтаОтправитель.Установить(ОтКого) ;
	КонецЕсли;
	
	ОбщийМодульСервисСервер.письмоавтору(СтруктураПисьма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)                                                                    // ПРИ ОТКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()                                                  // ПРИ ЗАКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РегистрационныйКод = ОбщийМодульСервисСервер.РегистрационныйКод();
	откого = Константы.ЭлектроннаяПочтаПользователь.Получить() ;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКСайтуПрограммыВИнтернетОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылка, СтандартнаяОбработка)
	ЗапуститьПриложение("http://www.ELTR.od.ua");
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКСайтуПрограммыВИнтернетНажатие(Элемент)
	ЗапуститьПриложение("http://www.ELTR.od.ua");
КонецПроцедуры
