// sza160211-0340
// sza140123-1405 
// sza131026-0132 

&НаКлиенте
Процедура Декорация3Нажатие(Элемент)
	Элементы.Декорация3.Видимость = ЛОЖЬ;
	Элементы.Декорация4.Видимость = ИСТИНА;
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПисьмо(Команда)
	
	ОтправитьПисьмоНаСервере();
	Закрыть();
	глПроверятьСообщения = ИСТИНА;
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьПисьмоНаСервере()
	
	СтруктураПисьма = Новый Структура;
	СтруктураПисьма.Вставить("ОтКого", ОтКого);
	СтруктураПисьма.Вставить("ТемаСообщения", "" + СокрЛП(ВашеИмя + " " + ТемаСообщения));
	СтруктураПисьма.Вставить("ТекстСообщения", ТекстСообщения);
	СтруктураПисьма.Вставить("РегистрационныйКод", РегистрационныйКод);
	СтруктураПисьма.Вставить("Вручную", ИСТИНА);
	
	Если ЗначениеЗаполнено(ОтКого)
		И НЕ ЗначениеЗаполнено(Константы.ЭлектроннаяПочтаОтправитель.Получить()) Тогда
		
		Константы.ЭлектроннаяПочтаОтправитель.Установить(ОтКого);
	КонецЕсли;
	
	ОбщийМодульСервисСервер.ПисьмоАвтору(СтруктураПисьма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКСайтуПрограммыВИнтернетНажатие(Элемент)
	
	Если глВерсияПлатформы < 806010000 Тогда 
		Выполнить(" ЗапуститьПриложение(""http://www.ELTR.od.ua""); ");
	Иначе
		Выполнить(" НачатьЗапускПриложения(Неопределено, ""http://www.ELTR.od.ua""); ");	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКСайтуПрограммыВИнтернетОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылка, СтандартнаяОбработка)
	
	Если глВерсияПлатформы < 806010000 Тогда 
		Выполнить(" ЗапуститьПриложение(""http://www.ELTR.od.ua""); ");
	Иначе
		Выполнить(" НачатьЗапускПриложения(Неопределено, ""http://www.ELTR.od.ua""); ");	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()              // ПРИ ЗАКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)         // ПРИ ОТКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьСобственныйПереводЭлементовИнтерфейса") Тогда
		ОбщийМодульСервер.ПеревестиРеквизитыФормы(ЭтаФорма);	
	КонецЕсли;
	
	РегистрационныйКод = ОбщийМодульСервисСервер.РегистрационныйКод();
	ОтКого = Константы.ЭлектроннаяПочтаПользователь.Получить();
	
	Элементы.ПрограммаЭлементарнаяТорговля.Заголовок =
	ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Конфигурация Элементарная торговля производится с октября 2013 года и постоянно развивается.") + Символы.ПС + Символы.ПС +
	ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Если Вы обнаружили ошибку в программе конфигурации или желаете добавить определенный функционал, то можете открыть в интернете сайт программы.") +
	ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("На этом сайте можно обнаружить документацию по программе, свежую версию программы, а также задать вопрос автору или другим пользователям на форуме.") + Символы.ПС + Символы.ПС +
	ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Конфигурация бесплатная. Гарантированная поддержка на неё продается отдельно.") + Символы.ПС + 
	ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Автор программы заинтересован в решении вопросов и поддержке пользователей, но не может гарантировать им своевременный и полный ответ.");
	
	Элементы.ОВозможности.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Убедитесь, что 1С не закрыта брандмауэром Windows. Если письмо не удается отправить, перейдите на сайт программы или отправьте его обычным способом по адресу") + " sza@ukr.net";	
	Элементы.ЕслиВыУкажитеВашЕмейл.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Если вы укажите ваш емейл, то реакция автора должна поступить в течении суток. Если реакции не последовало, значит автор Вашего письма не получил. Отправьте копию обычным способом.");
	
КонецПроцедуры
