//sza140123-1405 
//sza131026-0132 
&НаКлиенте
Процедура ОтправитьПисьмо(Команда)
	
	ОтправитьПисьмоНаСервере();
	Закрыть();
	глПроверятьСообщения = ИСТИНА;
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьПисьмоНаСервере()
	
	СтруктураПисьма = Новый Структура;
	СтруктураПисьма.Вставить("ОтКого", ОтКого);
	СтруктураПисьма.Вставить("ТемаСообщения", ТемаСообщения);
	СтруктураПисьма.Вставить("ТекстСообщения", ТекстСообщения);
	СтруктураПисьма.Вставить("РегистрационныйКод", РегистрационныйКод);
	СтруктураПисьма.Вставить("Вручную", ИСТИНА);
	
	Если ЗначениеЗаполнено(ОтКого)
		И НЕ ЗначениеЗаполнено(Константы.ЭлектроннаяПочтаОтправитель.Получить()) Тогда
		
		Константы.ЭлектроннаяПочтаОтправитель.Установить(ОтКого);
	КонецЕсли;
	
	ОбщийМодульСервисСервер.ПисьмоАвтору(СтруктураПисьма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКСайтуПрограммыВИнтернетНажатие(Элемент)
	ЗапуститьПриложение("http://www.ELTR.od.ua");
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКСайтуПрограммыВИнтернетОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылка, СтандартнаяОбработка)
	ЗапуститьПриложение("http://www.ELTR.od.ua");
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()                                                  // ПРИ ЗАКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)                                                                    // ПРИ ОТКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РегистрационныйКод = ОбщийМодульСервисСервер.РегистрационныйКод();
	откого = Константы.ЭлектроннаяПочтаПользователь.Получить();
	
КонецПроцедуры



