//sza150109-0210 
//sza141203-0351
//sza141130-1643 
//sza141106-1328 : 
//sza140914-1850 
//sza140913-2314
//sza140902-1631 ВывестиНаименованияНаДругомЯзыке
//sza140830-1635
//sza140710-2148  локац
//sza140701-1629  
//sza140613-1357 : 
//sza131003-1330 : 
Функция   ВычислитьИмяФормы(Знач ФормаСобытияТ) Экспорт
	
	ФормаСобытияТ = СтрЗаменить(ФормаСобытияТ, "Форма.ФормаЭлемента", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Карточка"));
	ФормаСобытияТ = СтрЗаменить(ФормаСобытияТ, "Форма.ФормаЗаписи", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Карточка"));
	ФормаСобытияТ = СтрЗаменить(ФормаСобытияТ, "Форма.ФормаСписка", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Список"));
	ФормаСобытияТ = СтрЗаменить(ФормаСобытияТ, "Форма.ФормаОтчета", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Окно отчета"));
	ФормаСобытияТ = СтрЗаменить(ФормаСобытияТ, "Форма.ФормаСпискаСОтборомПоГруппе", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Форма с отбором по группе"));
	ФормаСобытияТ = СтрЗаменить(ФормаСобытияТ, "ОбщаяФорма.НастройкиБазыДанных", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Форма настроек"));
	ФормаСобытияТ = СтрЗаменить(ФормаСобытияТ, ".", " ");
	
	Возврат ФормаСобытияТ;
	
КонецФункции //ВычислитьИмяФормы

&НаСервере
Функция   ВыяснитьПодходящийВидОбъекта(Знач ИсточникМетаданные, Знач режим) Экспорт
	
	Если режим = 1 тогда
		ВидОбъекта = Метаданные.ОбщиеРеквизиты.Ответственный.Состав.Найти(Метаданные.регистрынакопления[ИсточникМетаданные]);	
	Иначеесли режим = 2 тогда 
		ВидОбъекта = Метаданные.ОбщиеРеквизиты.Ответственный.Состав.Найти(Метаданные.справочники[ИсточникМетаданные]);	
	Иначеесли режим = 3 тогда 
		ВидОбъекта = Метаданные.ОбщиеРеквизиты.Ответственный.Состав.Найти(Метаданные.регистрысведений[ИсточникМетаданные]);	
	КонецЕсли;
	
	Возврат  НЕ ВидОбъекта = Неопределено 
	И ВидОбъекта.Использование = Метаданные.СвойстваОбъектов.ИспользованиеОбщегоРеквизита.Использовать
	И ПараметрыСеанса.ИспользоватьЖурналированиеСобытий;
	
КонецФункции //ВыяснитьПодходящийВидОбъекта

&НаСервере
функция   ЗапросВЦ() Экспорт
	
	ЗапросВЦР = Новый Запрос;
	ЗапросВЦР.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 ВидыЦен.Ссылка ИЗ Справочник.ВидыЦен КАК ВидыЦен ГДЕ ВидыЦен.ПометкаУдаления = ЛОЖЬ И ВидыЦен.Зависимая = ЛОЖЬ И ВидыЦен.ВалютаЦены = &ОсновнаяВалюта";
	
	ЗапросВЦР.УстановитьПараметр("ОсновнаяВалюта", ЗначениеПредопределенного("Справочники.Валюты.ОсновнаяВалюта"));
	
	Возврат ЗапросВЦР.Выполнить();
	
КонецФункции

&НаСервере
Функция   ЗначениеПредопределенного(Знач ТекстДляЗначения) Экспорт
	
	Результат = Неопределено;	
	Выполнить(" Результат = " + ТекстДляЗначения + ";");
	
	Возврат Результат;
	
КонецФункции //ЗначениеПредопределенного

&НаСервере
Функция   ОпределитьПользователя() Экспорт
	Возврат ОбщийМодульСерверПривилегия.ОпределитьПользователя();
КонецФункции

&НаСервере
Функция   ПлатнаяВерсия() Экспорт
	Возврат ОбщийМодульСервер.ПлатнаяВерсия();
КонецФункции

&НаСервере
Функция   ПолучитьАвтоХранилищеДенегПоВалюте(Знач Валюта, Знач ХранилищеДенег = Неопределено) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ХранилищеДенег)
		ИЛИ НЕ ХранилищеДенег.Валюта = Валюта Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 ХранилищаДенег.Ссылка
		|ИЗ Справочник.ХранилищаДенег КАК ХранилищаДенег
		|ГДЕ ХранилищаДенег.Валюта = &Валюта		
		|УПОРЯДОЧИТЬ ПО ХранилищаДенег.ПометкаУдаления";
		
		Запрос.УстановитьПараметр("Валюта", Валюта);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ХранилищеДенег = ВыборкаДетальныеЗаписи.Ссылка;
			КонецЦикла;	
		КонецЕсли;		
	КонецЕсли;
	
	Возврат ХранилищеДенег;
	
КонецФункции //ПолучитьАвтоХранилищеДенегПоВалюте

&НаСервере
Функция   ПолучитьГруппуНоменклатурыПоНаименованию(Знач наименование, Знач НеСоздавать = ЛОЖЬ) Экспорт
	Возврат ОбщийМодульТоварСервер.ПолучитьГруппуНоменклатурыПоНаименованию(наименование, НеСоздавать);
КонецФункции //ПолучитьГруппуНоменклатурыПоНаименованию

&НаСервере
Функция   ПолучитьДополнительныеРеквизитыНоменклатурныхГрупп(Знач НоменклатурнаяГруппа = Неопределено, Знач Сворачивать = ЛОЖЬ) Экспорт
	
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ НоменклатурныеГруппыРеквитыНоменклатуры.Ссылка,
	|	НоменклатурныеГруппыРеквитыНоменклатуры.НомерСтроки,
	|	НоменклатурныеГруппыРеквитыНоменклатуры.ДополнительныйРеквизит,
	|	НоменклатурныеГруппыРеквитыНоменклатуры.ЗначениеПоУмолчанию,
	|	НоменклатурныеГруппыРеквитыНоменклатуры.ОСтроке
	|ИЗ Справочник.НоменклатурныеГруппы.РеквитыНоменклатуры КАК НоменклатурныеГруппыРеквитыНоменклатуры ";
	
	Если ЗначениеЗаполнено(НоменклатурнаяГруппа) Тогда
		Запрос.Текст = Запрос.Текст + " ГДЕ НоменклатурныеГруппыРеквитыНоменклатуры.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", НоменклатурнаяГруппа);  	
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Результат = РезультатЗапроса.Выгрузить();
		
		Результат.Сортировать("НомерСтроки");
		
		Если Сворачивать Тогда
			
			РезультатСвернутый = Новый ТаблицаЗначений;			
			РезультатСвернутый.Колонки.Добавить("ИмяДопРеквизита");
			НомерСтроки = -1;
			
			Для Каждого СтрокаРезультата Из Результат Цикл
				Если НЕ СтрокаРезультата.НомерСтроки = НомерСтроки тогда
					
					СтрокаСвернутогоРезультата = РезультатСвернутый.Добавить();
					НомерСтроки = СтрокаРезультата.НомерСтроки;	
				КонецЕсли;
				ДополнительныйРеквизит = СокрЛП(СтрокаРезультата.ДополнительныйРеквизит);
				Если Найти(СтрокаСвернутогоРезультата.ИмяДопРеквизита, ДополнительныйРеквизит) = 0 Тогда
					СтрокаСвернутогоРезультата.ИмяДопРеквизита = СокрЛП("" + СтрокаСвернутогоРезультата.ИмяДопРеквизита + " " + ДополнительныйРеквизит);
				КонецЕсли;
				
			КонецЦикла;
			
			Результат = РезультатСвернутый;
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции //ПолучитьМассивНаименованийДополнительныхРеквизитов

Функция   ПолучитьЗначениеНастройкиИлиКонстанты(Знач ИмяКонстанты, Знач ТолькоКонстанта = ЛОЖЬ) Экспорт
	Возврат ОбщийМодульСервисСервер.ПолучитьЗначениеНастройкиИлиКонстантыНаСервере(ИмяКонстанты, ТолькоКонстанта);
КонецФункции //ПолучитьЗначениеНастройкиИлиКонстанты

&НаСервере
Функция   ПолучитьИмяДополнительногоРеквизита(Знач ОбъектВладелец) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ЭтоРеквизитДляОбъекта", Перечисления.ОбъектыДляДополнительныхРеквизитов.ПустаяСсылка());
	ТипЗнчОбъектВладелец = ТипЗнч(ОбъектВладелец);
	Результат.Вставить("НаименованиеОбъектаВладельца", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке(СокрЛП(ТипЗнчОбъектВладелец)));
	
	Если ТипЗнчОбъектВладелец = Тип("СправочникСсылка.ВидыЦен") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляСправочникаВидыЦен ;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("СправочникСсылка.НоменклатурныеГруппы") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляНоменклатурыНоменклатурнойГруппы;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("СправочникСсылка.Локации") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляСправочникаЛокаций;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("СправочникСсылка.Договора") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляСправочникаДоговора ;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("СправочникСсылка.ЗаметкиИНапоминания") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляЗаметокИНапоминаний;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("СправочникСсылка.Изображения") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляПрикрепленныхИзображений;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("СправочникСсылка.Клиенты") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляСправочникаКлиенты;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("СправочникСсылка.Номенклатура") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляСправочникаНоменклатура ;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("СправочникСсылка.Организации") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляСправочникаОрганизации;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("ДокументСсылка.ТаблицыДанных") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляДокументаТаблицыДанных;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("СправочникСсылка.ОбъектыКлиентов") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляСправочникаОбъектыКлиентов;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("СправочникСсылка.ПартииПриобретения") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляСправочникаПартииПриобретения ;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("СправочникСсылка.Поставщики") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляСправочникаПоставщики ;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("СправочникСсылка.Производители") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляСправочникаПроизводители ;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("СправочникСсылка.Регионы") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляСправочникаРегионы ;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("СправочникСсылка.Склады") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляСправочникаСклады ;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("СправочникСсылка.Сотрудники") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляСправочникаСотрудники ;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("СправочникСсылка.СредстваПредприятия") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляСправочникаСредств;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("СправочникСсылка.СтатьиДвиженияДенег") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляСправочникаСтатьиДвиженияДенег ;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("СправочникСсылка.ХранилищаДенег") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляСправочникаХранилищаДенег ;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("СправочникСсылка.Спецификации") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляСправочникаСпецификаций;		
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("СправочникСсылка.ГруппыАналогов") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляСправочникаГруппАналогов;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("СправочникСсылка.Подразделения") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляСправочникаПодразделений;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("СправочникСсылка.СертификатыГигиеническиеЗаключения") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляСправочникаСертификатов;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("ДокументСсылка.ДвиженияДенег") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляДокументаДвиженияДенег;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("ДокументСсылка.Инвентаризации") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляДокументаИнвентаризация;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("ДокументСсылка.КорректировкиИРегистрацияОстатков") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляДокументаКорректировкаИВводОстатков;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("ДокументСсылка.ПеремещенияТовара") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляДокументаПеремещенияТоваров;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("ДокументСсылка.ПланыПродаж") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляДокументаПланПродаж;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("ДокументСсылка.ПланыДоходовИРасходовДенег") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляДокументаПланДоходовИРасходов;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("ДокументСсылка.ПоступленияТовара") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляДокументаПоступлениеТовара;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("ДокументСсылка.РасходыТовара") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляДокументаРасходТовара;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("ДокументСсылка.ВыполненияРабот") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляДокументаВыполненияРабот;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("ДокументСсылка.УстановкиЦен") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляДокументаУстановкаЦен;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("ДокументСсылка.Комплектация") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляДокументаКомплектации;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("ДокументСсылка.ОтчетКомиссионера") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляДокументаОтчетКомиссионера;
	ИначеЕсли ТипЗнчОбъектВладелец = Тип("ДокументСсылка.ОказанияУслугЗаВремя") Тогда
		Результат.ЭтоРеквизитДляОбъекта = Перечисления.ОбъектыДляДополнительныхРеквизитов.ДляДокументаОказанияУслугЗаВремя;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции //ПолучитьИмяДополнительногоРеквизита

Функция   ПолучитьКрасивоеНаименованиеОбъекта(Знач НаименованиеОбъекта, Знач СПриставкой = ЛОЖЬ) Экспорт
	
	Если СПриставкой Тогда
		Наименование = СтрЗаменить(НаименованиеОбъекта, "СправочникСсылка.", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Справочник") + " ");
		Наименование = СтрЗаменить(Наименование, "ДокументСсылка.", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Документ") + " ");
	Иначе
		Наименование = СтрЗаменить(НаименованиеОбъекта, "СправочникСсылка.", "");
		Наименование = СтрЗаменить(Наименование, "ДокументСсылка.", "");
	КонецЕсли;
	
	с  = стрдлина(Наименование);
	сч = 1;
	Наименование2 = Лев(Наименование, 1);
	пока сч < с цикл
		сч = сч + 1;		
		СимволСтроки = Сред(Наименование, сч, 1);
		Если СимволСтроки = Врег(СимволСтроки) Тогда
			Наименование2 = Наименование2 + " " + НРег(СимволСтроки);
		Иначе
			Наименование2 = Наименование2 + СимволСтроки;
		КонецЕсли;
		
	КонецЦикла;
	
	Наименование = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке(Наименование2);
	
	Возврат Наименование;
	
КонецФункции //ПолучитьКрасивоеНаименованиеОбъекта

&НаСервере
Функция   ПолучитьНоменклатуруБыстрогоСпроса(Знач Позиция) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 НоменклатураЧастогоСпроса.Номенклатура
	|ИЗ РегистрСведений.НоменклатураЧастогоСпроса КАК НоменклатураЧастогоСпроса
	|ГДЕ НоменклатураЧастогоСпроса.Позиция = &Позиция";
	
	Запрос.УстановитьПараметр("Позиция", Позиция);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");	
		
	Иначе		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();   		
		ВыборкаДетальныеЗаписи.Следующий();
		
		Возврат ВыборкаДетальныеЗаписи.Номенклатура;	
		
	КонецЕсли;
	
КонецФункции //ПолучитьНоменклатуруБыстрогоСпроса

Функция   ПолучитьОсновноеИзображениеОбъекта(Знач СвязанныйОбъект) Экспорт	
	Возврат ОбщийМодульСервер.ПолучитьОсновноеИзображениеОбъекта(СвязанныйОбъект);	
КонецФункции //ПолучитьОсновноеИзображениеОбъекта

&НаСервере
Функция   ПолучитьОтборыДоступа(Знач ИмяОбъектаДляОтбора, Знач ТекущийПользователь = Неопределено, Знач ДопТип = "", Знач СвоеНаименованиеОбъектаОтбора = "") Экспорт
	
	СписокОтборов = Неопределено;
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьСистемуУправленияДоступом")
		И ЗначениеЗаполнено(ИмяОбъектаДляОтбора) Тогда
		
		Если ИмяОбъектаДляОтбора = "ЖурналДокументов.ДокументыДвиженийТовара" Тогда
			ИмяОбъектаДляОтбора = "Документ.РасходыТовара";
		ИначеЕсли ИмяОбъектаДляОтбора = "ЖурналДокументов.ДокументыКлиента" Тогда
			ИмяОбъектаДляОтбора = "Документ.РасходыТовара";
		ИначеЕсли ИмяОбъектаДляОтбора = "ЖурналДокументов.ДокументыПоставщика" Тогда
			ИмяОбъектаДляОтбора = "Документ.Документ.ПоступленияТовара";
		ИначеЕсли ИмяОбъектаДляОтбора = "ЖурналДокументов.ПолныйЖурнал" Тогда
			ИмяОбъектаДляОтбора = "Документ.РасходыТовара";
		КонецЕсли;
		
		Если ТекущийПользователь = Неопределено Тогда
			ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПользователиПринудительныйОтборДанных.ИмяОбластиОтбора,
		|	ПользователиПринудительныйОтборДанных.ЗначениеУсловия,
		|	ПользователиПринудительныйОтборДанных.УсловиеОтбора,
		|	ПользователиПринудительныйОтборДанных.РеквизитОбъекта,
		|	ПользователиПринудительныйОтборДанных.ОтборИспользуется
		|ИЗ Справочник.Пользователи.ПринудительныйОтборДанных КАК ПользователиПринудительныйОтборДанных
		|ГДЕ ПользователиПринудительныйОтборДанных.ИмяОбластиОтбора = &ОбластьОтбора
		|	И ПользователиПринудительныйОтборДанных.Ссылка = &Пользователь";
		
		Запрос.УстановитьПараметр("ОбластьОтбора", ?(СвоеНаименованиеОбъектаОтбора = "", ИмяОбъектаДляОтбора + ДопТип, СвоеНаименованиеОбъектаОтбора));
		Запрос.УстановитьПараметр("Пользователь", ТекущийПользователь);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			
			СписокОтборов = Новый СписокЗначений;
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ЭлементСписка = Новый Структура;		
				ЭлементСписка.Вставить("РеквизитОбъекта", ВыборкаДетальныеЗаписи.РеквизитОбъекта);
				
				УсловиеОтбора = СокрЛП(ВыборкаДетальныеЗаписи.УсловиеОтбора);
				
				ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.Равно;	
				Если УсловиеОтбора = "=" Тогда
					//
				ИначеЕсли УсловиеОтбора = "<>" Тогда
					ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.НеРавно;
				ИначеЕсли УсловиеОтбора = ">" Тогда
					ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.Больше;
				ИначеЕсли УсловиеОтбора = ">=" Тогда
					ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
				ИначеЕсли УсловиеОтбора = "<" Тогда
					ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.Меньше;
				ИначеЕсли УсловиеОтбора = "<=" Тогда
					ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
				ИначеЕсли УсловиеОтбора = "В" Тогда
					ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.ВСписке;
				ИначеЕсли УсловиеОтбора = "НВ" Тогда
					ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.НеВСписке;
				ИначеЕсли УсловиеОтбора = "С" Тогда
					ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.Содержит;
				ИначеЕсли УсловиеОтбора = "НС" Тогда
					ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.НеСодержит;
				ИначеЕсли УсловиеОтбора = "1" Тогда
					ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.Заполнено;
				ИначеЕсли УсловиеОтбора = "0" Тогда
					ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.НеЗаполнено;
				ИначеЕсли УсловиеОтбора = "ВИ" Тогда
					ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.ВИерархии;
				ИначеЕсли УсловиеОтбора = "СИ" Тогда
					ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.ВСпискеПоИерархии;
				ИначеЕсли УсловиеОтбора = "НИ" Тогда
					ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.НеВИерархии;
				ИначеЕсли УсловиеОтбора = "С-" Тогда
					ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.НеВСпискеПоИерархии;
				Иначе
					
					СисИнфо = Новый СистемнаяИнформация;
					Версияприложения = Лев(СтрЗаменить(СисИнфо.Версияприложения, ".", ""), 3);
					Попытка
						Версияприложения = Число(Версияприложения);
						Если Версияприложения >= 835 тогда
							
							Если УсловиеОтбора = "+С" Тогда
								ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.НачинаетсяС;
							ИначеЕсли УсловиеОтбора = "-С" Тогда
								ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.НеНачинаетсяС;
							ИначеЕсли УсловиеОтбора = "НП" Тогда
								ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.НеПодобно;
							ИначеЕсли УсловиеОтбора = "П" Тогда
								ВидСравненияОтбора = ВидСравненияКомпоновкиДанных.Подобно;					
							КонецЕсли;
						КонецЕсли;
					Исключение
					КонецПопытки;
				КонецЕсли;
				
				ЭлементСписка.Вставить("ВидСравненияКомпоновкиДанных", ВидСравненияОтбора);
				ЭлементСписка.Вставить("ОтборИспользуется", ВыборкаДетальныеЗаписи.ОтборИспользуется);
				ЭлементСписка.Вставить("ЗначениеУсловия", ВыборкаДетальныеЗаписи.ЗначениеУсловия);
				
				СписокОтборов.Добавить(ЭлементСписка);
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;	
	
	Возврат СписокОтборов;
	
КонецФункции //ПолучитьУровеньДоступа

Функция   ПолучитьПараметрСеанса(Знач ИмяПараметра) Экспорт	
	Возврат ОбщийМодульСервер.ПолучитьЗначениеПраметраСеанса(ИмяПараметра);	
КонецФункции //получитьПараметрСеанса

&НаСервере
Функция   ПолучитьПредставлениеНаЯзыке(Знач Данные, Знач ПолеЗначения = "Наименование", Знач ОтказатьсяПриОтсутствии = ЛОЖЬ, Знач ОпределенныйЯзык = Неопределено) Экспорт
	
	Если ПолучитьЗначениеНастройкиИлиКонстанты("ПоддерживатьНаименованияНаДругихЯзыкахКромеРусского") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 ЗначенияНаДругихЯзыках.НаЯзыке
		|ИЗ РегистрСведений.ЗначенияНаДругихЯзыках КАК ЗначенияНаДругихЯзыках
		|ГДЕ ЗначенияНаДругихЯзыках.ОбъектБазыДанных = &ОбъектБазыДанных
		|	И ЗначенияНаДругихЯзыках.Поле = &Поле
		|	И ЗначенияНаДругихЯзыках.Язык = &Язык";
		
		Запрос.УстановитьПараметр("ОбъектБазыДанных", Данные);
		Запрос.УстановитьПараметр("Поле", ПолеЗначения);
		Если ЗначениеЗаполнено(ОпределенныйЯзык) Тогда
			Запрос.УстановитьПараметр("Язык", ОпределенныйЯзык);		
		Иначе
			Запрос.УстановитьПараметр("Язык", ОбщийМодульПовтор.ПолучитьПараметрСеанса("ТекущийЯзыкИнтерфейсаПрограммы"));		
		КонецЕсли;
		
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			ВыборкаДетальныеЗаписи.Следующий();
			НаЯзыке = ВыборкаДетальныеЗаписи.НаЯзыке;
		ИначеЕсли НЕ ОтказатьсяПриОтсутствии Тогда
			НаЯзыке = Данные[ПолеЗначения];
		Иначе
			НаЯзыке = Неопределено;
		КонецЕсли;
		
		Возврат НаЯзыке;
	Иначе
		Возврат Данные[ПолеЗначения];
	КонецЕсли;
	
КонецФункции //ПолучитьПредставлениеНаЯзыке

Функция   ПолучитьПустоеЗначениеДополнительногоРеквизита(Знач ОбъектИлиТипДополнительногоРеквизита, Знач НаОснованииОбъекта = ЛОЖЬ) Экспорт	
	Возврат ОбщийМодульСервер.ПолучитьПустоеЗначениеДополнительногоРеквизита(ОбъектИлиТипДополнительногоРеквизита, НаОснованииОбъекта);	
КонецФункции

&НаСервере
Функция   ПолучитьСписокНоменклатурыБыстрогоСпроса(Знач ВернутьСписок = ИСТИНА) Экспорт
	возврат ОбщийМодульТоварСервер.ПолучитьСписокНоменклатурыБыстрогоСпроса(ВернутьСписок);
КонецФункции //ПолучитьСписокНоменклатурыБыстрогоСпроса

&НаСервере
Функция   ПолучитьТаблицуОбъектовДоступа() Экспорт
	
	СтрокаОтменаПроведенияДокументов	 = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Отмена проведения документов") + " ";
	СтрокаИзмененияПроведенныхДокументов = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Изменения проведенных документов") + " ";
	СтрокаСправочник 					 = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Справочник") + " ";
	СтрокаДокументы						 = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Документы") + " ";
	
	ТаблицаОбъектовДоступа = Новый ТаблицаЗначений;
	ТаблицаОбъектовДоступа.Колонки.Добавить("КодПрава");
	ТаблицаОбъектовДоступа.Колонки.Добавить("ОбъектДоступа");
	ТаблицаОбъектовДоступа.Колонки.Добавить("УровеньДоступаПоУмолчанию");
	
	СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
	СтрокаДоступа.КодПрава		= "000100";
	СтрокаДоступа.ОбъектДоступа = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Возможность управлять доступом пользователей");
	СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.НетДоступа;
	
	СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
	СтрокаДоступа.КодПрава		= "000150";
	СтрокаДоступа.ОбъектДоступа = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Возможность менять общие настройки");
	СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ТолькоЧтение;
	
	СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
	СтрокаДоступа.КодПрава		= "000170";
	СтрокаДоступа.ОбъектДоступа = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Валюты и курсы");
	СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
	
	СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
	СтрокаДоступа.КодПрава		= "000200";
	СтрокаДоступа.ОбъектДоступа = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Список Номенклатуры");
	СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
	
	СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
	СтрокаДоступа.КодПрава		= "000300";
	СтрокаДоступа.ОбъектДоступа = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Карточка Номенклатуры");
	СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
	
	СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
	СтрокаДоступа.КодПрава		= "000305";
	СтрокаДоступа.ОбъектДоступа = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Отчеты по движению товаров");
	СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
	
	СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
	СтрокаДоступа.КодПрава		= "000310";
	СтрокаДоступа.ОбъектДоступа = СтрокаДокументы + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Инвентаризации");
	СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ТолькоЧтение;
	
	СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
	СтрокаДоступа.КодПрава		= "000311";
	СтрокаДоступа.ОбъектДоступа = СтрокаОтменаПроведенияДокументов + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Инвентаризации");
	СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ТолькоЧтение;
	
	СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
	СтрокаДоступа.КодПрава		= "000312";
	СтрокаДоступа.ОбъектДоступа = СтрокаИзмененияПроведенныхДокументов + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Инвентаризации");
	СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ТолькоЧтение;
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетНоменклатурыВРазрезеНоменклатурныхГрупп") Тогда		
		СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
		СтрокаДоступа.КодПрава		= "000350";
		СтрокаДоступа.ОбъектДоступа = СтрокаСправочник + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Номенклатурные Группы");
		СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
	КонецЕсли;
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетСертификатовНоменклатуры") Тогда		
		СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
		СтрокаДоступа.КодПрава		= "000360";
		СтрокаДоступа.ОбъектДоступа = СтрокаСправочник + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Сертификатов и гигиенических заключений");
		СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
	КонецЕсли;
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьИнструментРабочееМестоОператораКассы") Тогда		
		СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
		СтрокаДоступа.КодПрава		= "000365";
		СтрокаДоступа.ОбъектДоступа = СтрокаСправочник + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ассортимент для рабочего места оператора Кассы");
		СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
	КонецЕсли;
	
	СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
	СтрокаДоступа.КодПрава		= "000370";
	СтрокаДоступа.ОбъектДоступа = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Доступ к журналу документов Движений товара");
	СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("УчетТоваровПереданныхОтНасКомиссионерамДляКомиссионнойТорговли") Тогда
		СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
		СтрокаДоступа.КодПрава		= "000380";
		СтрокаДоступа.ОбъектДоступа = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Доступ данным по товарам переданным на комиссию");
		СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;	
		
		СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
		СтрокаДоступа.КодПрава		= "000381";
		СтрокаДоступа.ОбъектДоступа = СтрокаОтменаПроведенияДокументов + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Отчеты Комиссионеров");
		СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;	
		
		СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
		СтрокаДоступа.КодПрава		= "000382";
		СтрокаДоступа.ОбъектДоступа = СтрокаИзмененияПроведенныхДокументов + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Отчеты Комиссионеров");
		СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;	
	КонецЕсли;
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьСложныйМеханизмЦен") Тогда
		СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
		СтрокаДоступа.КодПрава		= "000400";
		СтрокаДоступа.ОбъектДоступа = СтрокаСправочник + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Виды Цен");
		СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ТолькоЧтение;	
	КонецЕсли;
	
	ВестиУчетПоКлиентам = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетПоКлиентам");
	Если ВестиУчетПоКлиентам Тогда
		СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
		СтрокаДоступа.КодПрава		= "000500";
		СтрокаДоступа.ОбъектДоступа = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Список Клиентов");
		СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
		
		СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
		СтрокаДоступа.КодПрава		= "000600";
		СтрокаДоступа.ОбъектДоступа = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Карточка Клиента");
		СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
		
		СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
		СтрокаДоступа.КодПрава		= "000605";
		СтрокаДоступа.ОбъектДоступа = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Отчет по взаиморасчетам с Клиентами");
		СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
		
		СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
		СтрокаДоступа.КодПрава		= "000607";
		СтрокаДоступа.ОбъектДоступа = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Доступ к журналу документов Клиента");
		СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
	КонецЕсли;
	
	ВестиУчетПоПоставщикам = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетПоПоставщикам");
	Если ВестиУчетПоПоставщикам Тогда		
		СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
		СтрокаДоступа.КодПрава		= "000650";
		СтрокаДоступа.ОбъектДоступа = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Список Поставщиков");
		СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
		
		СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
		СтрокаДоступа.КодПрава		= "000655";
		СтрокаДоступа.ОбъектДоступа = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Карточка Поставщика");
		СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
		
		СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
		СтрокаДоступа.КодПрава		= "000656";
		СтрокаДоступа.ОбъектДоступа = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Отчет по взаиморасчетам с Поставщиками");
		СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
		
		СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
		СтрокаДоступа.КодПрава		= "00065A";
		СтрокаДоступа.ОбъектДоступа = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Доступ к журналу документов Поставщика");
		СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
	КонецЕсли;
	
	Если ВестиУчетПоКлиентам 
		ИЛИ ВестиУчетПоПоставщикам Тогда
		
		Если ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ИспользоватьПредставлениеТоваровКонтрагентами") Тогда
			СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
			СтрокаДоступа.КодПрава		= "00065B";
			СтрокаДоступа.ОбъектДоступа = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Доступ к представлению товаров Контрагентами");
			СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
		КонецЕсли;
		
		СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
		СтрокаДоступа.КодПрава		= "000657";
		СтрокаДоступа.ОбъектДоступа = СтрокаДокументы + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Взаимозачета долга контрагентов");
		СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ТолькоЧтение;	
		
		СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
		СтрокаДоступа.КодПрава		= "000658";
		СтрокаДоступа.ОбъектДоступа = СтрокаИзмененияПроведенныхДокументов + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Взаимозачеты долга контрагентов");
		СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ТолькоЧтение;	
	КонецЕсли;
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетОтдельныхДоговоровСКонтрагентами") Тогда
		СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
		СтрокаДоступа.КодПрава		= "000660";
		СтрокаДоступа.ОбъектДоступа = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Список Договоров с Контрагентами");
		СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
		
		СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
		СтрокаДоступа.КодПрава		= "000665";
		СтрокаДоступа.ОбъектДоступа = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Карточка Договора с Контрагентом");
		СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
	КонецЕсли;
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьДокументыВыполненияРабот") Тогда
		СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
		СтрокаДоступа.КодПрава		= "000690";
		СтрокаДоступа.ОбъектДоступа = СтрокаДокументы + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Выполнения работ");
		СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
		
		СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
		СтрокаДоступа.КодПрава		= "000691";
		СтрокаДоступа.ОбъектДоступа = СтрокаОтменаПроведенияДокументов + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Выполнения работ");
		СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
		
		СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
		СтрокаДоступа.КодПрава		= "000692";
		СтрокаДоступа.ОбъектДоступа = СтрокаИзмененияПроведенныхДокументов + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Выполнения работ");
		СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
		
		Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетОбъектовКлиентов") Тогда
			СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
			СтрокаДоступа.КодПрава		= "000700";
			СтрокаДоступа.ОбъектДоступа = СтрокаСправочник + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Объектов Клиентов");
			СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
		КонецЕсли;	
	КонецЕсли;
	
	СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
	СтрокаДоступа.КодПрава		= "000790";
	СтрокаДоступа.ОбъектДоступа = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Доступ к Полному журналу документов");
	СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетПоСкладам") Тогда
		СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
		СтрокаДоступа.КодПрава		= "000800";
		СтрокаДоступа.ОбъектДоступа = СтрокаСправочник + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Склады");
		СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ТолькоЧтение;
		
		СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
		СтрокаДоступа.КодПрава		= "000810";
		СтрокаДоступа.ОбъектДоступа = СтрокаДокументы + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Перемещения товаров");
		СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ТолькоЧтение;	
		
		СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
		СтрокаДоступа.КодПрава		= "000811";
		СтрокаДоступа.ОбъектДоступа = СтрокаОтменаПроведенияДокументов + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Перемещения товаров");
		СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ТолькоЧтение;	
		
		СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
		СтрокаДоступа.КодПрава		= "000812";
		СтрокаДоступа.ОбъектДоступа = СтрокаИзмененияПроведенныхДокументов + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Перемещения товаров");
		СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ТолькоЧтение;	
	КонецЕсли;
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетДвиженияДенег") Тогда
		СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
		СтрокаДоступа.КодПрава		= "000890";
		СтрокаДоступа.ОбъектДоступа = СтрокаДокументы + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Движения денег");
		СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
		
		СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
		СтрокаДоступа.КодПрава		= "000891";
		СтрокаДоступа.ОбъектДоступа = СтрокаОтменаПроведенияДокументов + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Движения Денег");
		СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
		
		СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
		СтрокаДоступа.КодПрава		= "000892";
		СтрокаДоступа.ОбъектДоступа = СтрокаИзмененияПроведенныхДокументов + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Движения Денег");
		СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
		
		Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьРегистрациюПриемаИВыдачиДенегПрямоВДокументахРасходаИПрихода") Тогда
			СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
			СтрокаДоступа.КодПрава		= "000892";
			СтрокаДоступа.ОбъектДоступа = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Приходование денег при реализации");
			СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
			
			СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
			СтрокаДоступа.КодПрава		= "000894";
			СтрокаДоступа.ОбъектДоступа = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Расходование денег при оприходовании");
			СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
		КонецЕсли;
		
		СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
		СтрокаДоступа.КодПрава		= "000895";
		СтрокаДоступа.ОбъектДоступа = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Отчеты по движению денег");
		СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
		
		СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
		СтрокаДоступа.КодПрава		= "000900";
		СтрокаДоступа.ОбъектДоступа = СтрокаСправочник + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Статьи движения денег");
		СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
		
		Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетДенегВНесколькихХранилищах") Тогда
			СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
			СтрокаДоступа.КодПрава		= "000950";
			СтрокаДоступа.ОбъектДоступа = СтрокаСправочник + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Хранилищ денег");
			СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ТолькоЧтение;	
		КонецЕсли;
		
		Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетЗарплатыСотрудников") Тогда
			СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
			СтрокаДоступа.КодПрава		= "001400";
			СтрокаДоступа.ОбъектДоступа = СтрокаСправочник + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Сотрудников");
			СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
			
			СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
			СтрокаДоступа.КодПрава		= "001450";
			СтрокаДоступа.ОбъектДоступа = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Заработная плата сотрудников");
			СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.НетДоступа;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьФормулыАвтоНаименованияФормированияШтрихКодаИТекстаСШтрихКодом") Тогда
		СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
		СтрокаДоступа.КодПрава		= "001000";
		СтрокаДоступа.ОбъектДоступа = СтрокаСправочник + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Формул");
		СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
	КонецЕсли;
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетСобственныхЮридическихЛиц") Тогда
		СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
		СтрокаДоступа.КодПрава		= "001100";
		СтрокаДоступа.ОбъектДоступа = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Список Собственных юридических лиц");
		СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
		
		СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
		СтрокаДоступа.КодПрава		= "001150";
		СтрокаДоступа.ОбъектДоступа = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Карточка Организации");
		СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ТолькоЧтение;
	КонецЕсли;	
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетПартийПриобретения") Тогда
		СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
		СтрокаДоступа.КодПрава		= "001200";
		СтрокаДоступа.ОбъектДоступа = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Список Партий приобретения");
		СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
		
		СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
		СтрокаДоступа.КодПрава		= "001250";
		СтрокаДоступа.ОбъектДоступа = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Карточка Партии приобретения");
		СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.НетДоступа;
	КонецЕсли;	
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетОказанияУслугЗаВремя") Тогда
		СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
		СтрокаДоступа.КодПрава		= "001290";
		СтрокаДоступа.ОбъектДоступа = СтрокаДокументы + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Оказания услуг за время");
		СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
		
		СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
		СтрокаДоступа.КодПрава		= "001291";
		СтрокаДоступа.ОбъектДоступа = СтрокаОтменаПроведенияДокументов + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Оказания услуг за время");
		СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
		
		СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
		СтрокаДоступа.КодПрава		= "001292";
		СтрокаДоступа.ОбъектДоступа = СтрокаИзмененияПроведенныхДокументов + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Оказания услуг за время");
		СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
		
		Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетОказанияУслугЗаВремяСОпределеннымиПозициямиНомерами") Тогда
			СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
			СтрокаДоступа.КодПрава		= "001300";
			СтрокаДоступа.ОбъектДоступа = СтрокаСправочник + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Позиций оказания услуг за время");
			СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;	
		КонецЕсли;
	КонецЕсли;
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьКомплектацию") Тогда
		СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
		СтрокаДоступа.КодПрава		= "001500";
		СтрокаДоступа.ОбъектДоступа = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Список Спецификаций");
		СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
		
		СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
		СтрокаДоступа.КодПрава		= "001550";
		СтрокаДоступа.ОбъектДоступа = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Карточка Спецификации");
		СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
		
		СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
		СтрокаДоступа.КодПрава		= "001560";
		СтрокаДоступа.ОбъектДоступа = СтрокаДокументы + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Комплектации");
		СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
		
		СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
		СтрокаДоступа.КодПрава		= "001561";
		СтрокаДоступа.ОбъектДоступа = СтрокаОтменаПроведенияДокументов + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Комплектации");
		СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
		
		СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
		СтрокаДоступа.КодПрава		= "001562";
		СтрокаДоступа.ОбъектДоступа = СтрокаИзмененияПроведенныхДокументов + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Комплектации");
		СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
	КонецЕсли;	
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетСредствПредприятия") Тогда
		СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
		СтрокаДоступа.КодПрава		= "001600";
		СтрокаДоступа.ОбъектДоступа = СтрокаСправочник + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Средств предприятия");
		СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
	КонецЕсли;
	
	СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
	СтрокаДоступа.КодПрава		= "001700";
	СтрокаДоступа.ОбъектДоступа = СтрокаДокументы + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Поступления товаров и услуг");
	СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
	
	СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
	СтрокаДоступа.КодПрава		= "001701";
	СтрокаДоступа.ОбъектДоступа = СтрокаОтменаПроведенияДокументов + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Поступления товаров и услуг");
	СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
	
	СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
	СтрокаДоступа.КодПрава		= "001702";
	СтрокаДоступа.ОбъектДоступа = СтрокаИзмененияПроведенныхДокументов + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Поступления товаров и услуг");
	СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетЗаказовПоставщикам") Тогда
		СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
		СтрокаДоступа.КодПрава		= "001750";
		СтрокаДоступа.ОбъектДоступа = СтрокаДокументы + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Заказы Поставщикам");
		СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
		
		СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
		СтрокаДоступа.КодПрава		= "001751";
		СтрокаДоступа.ОбъектДоступа = СтрокаОтменаПроведенияДокументов + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Заказов Поставщикам");
		СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
		
		СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
		СтрокаДоступа.КодПрава		= "001752";
		СтрокаДоступа.ОбъектДоступа = СтрокаИзмененияПроведенныхДокументов + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Заказов Поставщикам");
		СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
	КонецЕсли;
	
	СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
	СтрокаДоступа.КодПрава		= "001800";
	СтрокаДоступа.ОбъектДоступа = СтрокаДокументы + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Расходования товаров и реализации услуг");
	СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
	
	СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
	СтрокаДоступа.КодПрава		= "001801";
	СтрокаДоступа.ОбъектДоступа = СтрокаОтменаПроведенияДокументов + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Расходования товаров и реализации услуг");
	СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
	
	СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
	СтрокаДоступа.КодПрава		= "001802";
	СтрокаДоступа.ОбъектДоступа = СтрокаИзмененияПроведенныхДокументов + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Расходования товаров и реализации услуг");
	СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетЗаказовПоставщикам") Тогда
		СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
		СтрокаДоступа.КодПрава		= "001850";
		СтрокаДоступа.ОбъектДоступа = СтрокаДокументы + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Заказы Клиентов");
		СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
		
		СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
		СтрокаДоступа.КодПрава		= "001851";
		СтрокаДоступа.ОбъектДоступа = СтрокаОтменаПроведенияДокументов + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Заказов Клиентов");
		СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
		
		СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
		СтрокаДоступа.КодПрава		= "001852";
		СтрокаДоступа.ОбъектДоступа = СтрокаИзмененияПроведенныхДокументов + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Заказов Клиентов");
		СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
	КонецЕсли;
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ЕстьПринтер") Тогда
		СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
		СтрокаДоступа.КодПрава		= "002100";
		СтрокаДоступа.ОбъектДоступа = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Печать документов и карточек справочников");
		СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
	КонецЕсли;
	
	СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
	СтрокаДоступа.КодПрава		= "002200";
	СтрокаДоступа.ОбъектДоступа = СтрокаДокументы + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Корректировки");
	СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ТолькоЧтение;
	
	СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
	СтрокаДоступа.КодПрава		= "002201";
	СтрокаДоступа.ОбъектДоступа = СтрокаОтменаПроведенияДокументов + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Корректировки и Взаимозачетов контрагентов");
	СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ТолькоЧтение;
	
	СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
	СтрокаДоступа.КодПрава		= "002202";
	СтрокаДоступа.ОбъектДоступа = СтрокаИзмененияПроведенныхДокументов + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Корректировки");
	СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ТолькоЧтение;
	
	СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
	СтрокаДоступа.КодПрава		= "002300";
	СтрокаДоступа.ОбъектДоступа = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Изменение цен в документах");
	СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
	
	СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
	СтрокаДоступа.КодПрава		= "002350";
	СтрокаДоступа.ОбъектДоступа = СтрокаДокументы + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Установки Цен");
	СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ТолькоЧтение;
	
	СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
	СтрокаДоступа.КодПрава		= "002351";
	СтрокаДоступа.ОбъектДоступа = СтрокаОтменаПроведенияДокументов + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Установки Цен");
	СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ТолькоЧтение;
	
	СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
	СтрокаДоступа.КодПрава		= "002352";
	СтрокаДоступа.ОбъектДоступа = СтрокаИзмененияПроведенныхДокументов + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Установки Цен");
	СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ТолькоЧтение;
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетПлановыхПоказателейПродаж") Тогда
		СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
		СтрокаДоступа.КодПрава		= "002400";
		СтрокаДоступа.ОбъектДоступа = СтрокаДокументы + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Планы продаж");
		СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ТолькоЧтение;
	КонецЕсли;
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетПлановДоходовИРасходов") Тогда
		СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
		СтрокаДоступа.КодПрава		= "002450";
		СтрокаДоступа.ОбъектДоступа = СтрокаДокументы + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Планы расходов и доходов денег");
		СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ТолькоЧтение;
	КонецЕсли;
	
	Если ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ИспользоватьСторнированиеДокументов") Тогда
		СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
		СтрокаДоступа.КодПрава		= "002460";
		СтрокаДоступа.ОбъектДоступа = СтрокаДокументы + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Право на сторнирование документов");
		СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ТолькоЧтение;
		
		СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
		СтрокаДоступа.КодПрава		= "002470";
		СтрокаДоступа.ОбъектДоступа = СтрокаДокументы + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Отчет по Сторнированным документам");
		СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ТолькоЧтение;
	КонецЕсли;
	
	СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
	СтрокаДоступа.КодПрава		= "002500";
	СтрокаДоступа.ОбъектДоступа = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Полный журнал документов");
	СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ТолькоЧтение;
	
	СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
	СтрокаДоступа.КодПрава		= "002600";
	СтрокаДоступа.ОбъектДоступа = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Экономические отчеты, отчет руководителю");
	СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.НетДоступа;
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ПодсистемаИЭИмпортЭкспорт") Тогда
		СтрокаДоступа = ТаблицаОбъектовДоступа.Добавить();
		СтрокаДоступа.КодПрава		= "002700";
		СтрокаДоступа.ОбъектДоступа = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Импорт - экспорт");
		СтрокаДоступа.УровеньДоступаПоУмолчанию = Перечисления.УровниДоступа.ПолныйДоступ;
	КонецЕсли;
	
	Возврат ТаблицаОбъектовДоступа;
	
КонецФункции 

Функция   ПолучитьТекстЗапросаПоискаСпецСправочника(Знач ТипСправочника) Экспорт
	
	Результат = "";
	
	ТипСправочника = Врег(ТипСправочника);
	Если ТипСправочника = "НОМЕНКЛАТУРА"
		И ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьШтрихКоды")
		И НЕ ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("НеПроверятьУникальностьШтрихКода") Тогда
		
		Результат = "НШК";
		
	ИначеЕсли (ТипСправочника = "КЛИЕНТЫ" 
		ИЛИ ТипСправочника = "ПОСТАВЩИКИ" 
		ИЛИ ТипСправочника = "ОРГАНИЗАЦИИ" 
		ИЛИ ТипСправочника = "СОТРУДНИКИ")
		И ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ЗапретитьИспользоватьОдинаковыеКодыИНН") Тогда
		
		Результат = "ВЫБРАТЬ ПЕРВЫЕ 1 С.Ссылка ИЗ Справочник." + ТипСправочника + " КАК С ГДЕ С.ОКПО = &СпецКод ";
		
	ИначеЕсли ТипСправочника = "СЕРИИНОМЕНКЛАТУРЫ"
		И ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьШтрихКоды")
		И НЕ ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("НеПроверятьУникальностьШтрихКода") Тогда
		
		Результат = "ВЫБРАТЬ ПЕРВЫЕ 1 ШтрихКоды.СерияНоменклатуры Как Ссылка
		|ИЗ РегистрСведений.ШтрихКоды КАК ШтрихКоды
		|ГДЕ ШтрихКоды.ШтрихКод = &СпецКод";
		
	Иначе
		Результат = "ВЫБРАТЬ ПЕРВЫЕ 1 С.Ссылка ИЗ Справочник." + ТипСправочника + " КАК С ГДЕ С.Наименование = &СпецКод ";// И С.Код = &ЗначениеКод";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

Функция   ПолучитьТекстНаЯзыке(Знач ТекстНаРусском, Знач КонкретныйЯзык = Неопределено) Экспорт 	
	Возврат ОбщийМодульТекстСервер.ПолучитьТекстНаЯзыке(ТекстНаРусском, КонкретныйЯзык);	
КонецФункции //ПолучитьТекстНаЯзыке

Функция   ПолучитьТекущийКурс(Знач Валюта = Неопределено, Знач Дата = Неопределено) Экспорт  	
	Возврат ОбщийМодульСервер.ПолучитьТекущийКурс(Валюта, Дата);	
КонецФункции //ПолучитьТекущийКурс

Функция   ПолучитьТекущуюСредуВыполнения() Экспорт
	
	#Если ТолстыйКлиентОбычноеПриложение ИЛИ ТолстыйКлиентУправляемоеПриложение Тогда
		
		Возврат 1;
	#ИначеЕсли Сервер Тогда
		
		Возврат 2;
	#ИначеЕсли ВнешнееСоединение Тогда
		
		Возврат 3;
	#ИначеЕсли ТонкийКлиент Тогда
		
		Возврат 4;
	#ИначеЕсли ВебКлиент Тогда
		
		Возврат 5;
	#Иначе
		
		Возврат 0;
	#КонецЕсли	
	
КонецФункции   

Функция   ПолучитьТипВладельца(Знач ОбъектСсылка) Экспорт	
	Возврат ОбщийМодульПовтор.ПолучитьИмяДополнительногоРеквизита(ОбъектСсылка).ЭтоРеквизитДляОбъекта;	
КонецФункции //ПолучитьТипВладельца

Функция   ПолучитьТипДополнительногоРеквизита(Знач ТипОбъектаДляДополнительныхРеквизитов) Экспорт
	Возврат ОбщийМодульСервер.ПолучитьТипДополнительногоРеквизита(ТипОбъектаДляДополнительныхРеквизитов);
КонецФункции

&НаСервере
Функция   ПолучитьУровеньДоступа(Знач КодПрава, Знач ТекущийПользователь = Неопределено) Экспорт
	
	Результат = Новый Структура("УровеньДоступа", перечисления.УровниДоступа.ПолныйДоступ);
	Результат.Вставить("ОбъектДоступа", "");
	
	Если ТекущийПользователь = Неопределено Тогда
		ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущийПользователь) Тогда
		НайтиПраво = ТекущийПользователь.Доступ.Найти(КодПрава, "КодПрава");
		Если НЕ НайтиПраво = Неопределено Тогда
			Результат.УровеньДоступа = НайтиПраво.УровеньДоступа;
			Результат.ОбъектДоступа  = НайтиПраво.ОбъектДоступа;
			Результат.Вставить("УсловиеДоступа", НайтиПраво.УсловиеДоступа);			
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции //ПолучитьУровеньДоступа

&НаСервере
Функция   ПолучитьШтрихКодНоменклатурыИлиСерии(Знач Ссылка, Знач ЭтоСерия = ЛОЖЬ) Экспорт
	
	Результат = "";
	Если НЕ этосерия тогда
		Результат = СокрЛП(ссылка.ОсновнойШтрихКод);
		
		Если ПустаяСтрока(Результат) Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 ШтрихКоды.ШтрихКод
			|ИЗ РегистрСведений.ШтрихКоды КАК ШтрихКоды
			|ГДЕ ШтрихКоды.Номенклатура = &Номенклатура";
			
			Запрос.УстановитьПараметр("Номенклатура", Ссылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			Если НЕ РезультатЗапроса.Пустой() Тогда
				ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
				
				ВыборкаДетальныеЗаписи.Следующий();
				Результат = ВыборкаДетальныеЗаписи.ШтрихКод;
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 ШтрихКоды.ШтрихКод
		|ИЗ РегистрСведений.ШтрихКоды КАК ШтрихКоды
		|ГДЕ ШтрихКоды.СерияНоменклатуры = &СерияНоменклатуры";
		
		Запрос.УстановитьПараметр("СерияНоменклатуры", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			ВыборкаДетальныеЗаписи.Следующий();
			Результат = ВыборкаДетальныеЗаписи.ШтрихКод;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат
	
КонецФункции //ПолучитьШтрихКодНоменклатурыИлиСерии

&НаСервере
Функция   РегистрационныйКод() Экспорт
	Возврат Метаданные.Комментарий;
КонецФункции //РегистрационныйКод

Функция   СпецСправочник(Знач ТипСправочника) Экспорт
	
	ТипСправочника = Врег(ТипСправочника);
	Возврат ТипСправочника = "НОМЕНКЛАТУРА"
	ИЛИ ТипСправочника = "КЛИЕНТЫ" 
	ИЛИ ТипСправочника = "ПОСТАВЩИКИ" 
	ИЛИ ТипСправочника = "ОРГАНИЗАЦИИ" 
	ИЛИ ТипСправочника = "СЕРИИНОМЕНКЛАТУРЫ" 
	ИЛИ ТипСправочника = "СОТРУДНИКИ";
	
КонецФункции //СпецСправочник

&НаСервере
Функция   СформироватьВидыУсловийДляОтбора() Экспорт
	
	ВидыУсловийДляОтбора = Новый СписокЗначений;
	
	ВидыУсловийДляОтбора.Добавить("=", "=  (" + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("равно") + ")", ЛОЖЬ);
	ВидыУсловийДляОтбора.Добавить("<>", "!= (" + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("НЕ равно") + ")", ЛОЖЬ);
	ВидыУсловийДляОтбора.Добавить(">", ">  (" + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("больше") + ")", ЛОЖЬ);
	ВидыУсловийДляОтбора.Добавить(">=", ">= (" + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("больше либо равно") + ")", ЛОЖЬ);
	ВидыУсловийДляОтбора.Добавить("<", "<  (" + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("меньше") + ")", ЛОЖЬ);
	ВидыУсловийДляОтбора.Добавить("<=", "<=  (" + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("меньше либо равно") + ")", ЛОЖЬ);
	ВидыУсловийДляОтбора.Добавить("1", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Заполнено"), ЛОЖЬ);
	ВидыУсловийДляОтбора.Добавить("0", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("НЕ заполнено"), ЛОЖЬ);
	ВидыУсловийДляОтбора.Добавить("В", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("В списке"), ЛОЖЬ);
	ВидыУсловийДляОтбора.Добавить("НВ", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("НЕ в списке"), ЛОЖЬ);
	ВидыУсловийДляОтбора.Добавить("С", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Содержит"), ЛОЖЬ);
	ВидыУсловийДляОтбора.Добавить("НС", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("НЕ содержит"), ЛОЖЬ);
	
	ВидыУсловийДляОтбора.Добавить("ВИ", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("В Иерархии"), ЛОЖЬ);
	ВидыУсловийДляОтбора.Добавить("НИ", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("НЕ В Иерархии"), ЛОЖЬ);
	ВидыУсловийДляОтбора.Добавить("СИ", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("В списке по Иерархии"), ЛОЖЬ);
	ВидыУсловийДляОтбора.Добавить("С-", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("НЕ В списке по Иерархии"), ЛОЖЬ);
	
	СисИнфо = Новый СистемнаяИнформация;
	Версияприложения = Лев(СтрЗаменить(СисИнфо.Версияприложения, ".", ""), 3);
	Попытка
		Версияприложения = Число(Версияприложения);
		Если Версияприложения >= 835 тогда
			ВидыУсловийДляОтбора.Добавить("+С", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("начинается С"), ЛОЖЬ);
			ВидыУсловийДляОтбора.Добавить("-С", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("НЕ начинается С"), ЛОЖЬ);
			ВидыУсловийДляОтбора.Добавить("П", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("подобно"), ЛОЖЬ);
			ВидыУсловийДляОтбора.Добавить("НП", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("НЕ подобно"), ЛОЖЬ);	
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Возврат ВидыУсловийДляОтбора;
	
КонецФункции

&НаСервере
Функция   СформироватьПереченьОбъектовБазыДанных() Экспорт
	
	ОбъектыБазыДанных = Новый СписокЗначений;
	
	ОбъектыБазыДанных.Добавить("", "		" + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("СПРАВОЧНИКИ") + "..", ЛОЖЬ);
	
	Для Каждого СправочникИзМетаДанных Из Метаданные.Справочники Цикл
		ОбъектыБазыДанных.Добавить(СправочникИзМетаДанных.Имя, СправочникИзМетаДанных.Синоним, ЛОЖЬ);
	КонецЦикла;
	
	ОбъектыБазыДанных.Добавить("", " ", ЛОЖЬ);
	ОбъектыБазыДанных.Добавить("", "		" + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("ДОКУМЕНТЫ") + "..", ЛОЖЬ);
	
	Для Каждого СправочникИзМетаДанных Из Метаданные.Документы Цикл
		ОбъектыБазыДанных.Добавить(СправочникИзМетаДанных.Имя, СправочникИзМетаДанных.Синоним, ЛОЖЬ);
	КонецЦикла;
	Если Константы.ВестиУчетЗаказовКлиентов.Получить() Тогда
		ОбъектыБазыДанных.Добавить("РасходыТовара" + "ЗаказКлиента", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Заказы Клиентов"), ЛОЖЬ);
	КонецЕсли;
	Если Константы.ВестиУчетЗаказовПоставщикам.Получить() Тогда
		ОбъектыБазыДанных.Добавить("ПоступленияТовара" + "ЗаказПоставщику", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Заказы Поставщикам"), ЛОЖЬ);
	КонецЕсли;
	Если Константы.ВестиУчетЗарплатыСотрудников.Получить() Тогда
		ОбъектыБазыДанных.Добавить("ДвиженияДенег" + "Зарплата", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Документы заработной платы"), ЛОЖЬ);
	КонецЕсли;
	ОбъектыБазыДанных.Добавить("КорректировкиИРегистрацияОстатков" + "Взаимозачет", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Документы взаимозачета"), ЛОЖЬ);
	
	ОбъектыБазыДанных.Добавить("", " ", ЛОЖЬ);
	ОбъектыБазыДанных.Добавить("", "		" + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("РЕГИСТРЫ") + "..", ЛОЖЬ);
	
	Для Каждого СправочникИзМетаДанных Из Метаданные.РегистрыСведений Цикл
		ОбъектыБазыДанных.Добавить(СправочникИзМетаДанных.Имя, СправочникИзМетаДанных.Синоним, ЛОЖЬ);
	КонецЦикла;
	Для Каждого СправочникИзМетаДанных Из Метаданные.РегистрыНакопления Цикл
		ОбъектыБазыДанных.Добавить(СправочникИзМетаДанных.Имя, СправочникИзМетаДанных.Синоним, ЛОЖЬ);
	КонецЦикла;
	
	Возврат ОбъектыБазыДанных;
	
КонецФункции 

&НаСервере
Функция   ТекущийЯзыкРусский() Экспорт
	Возврат НЕ ЗначениеЗаполнено(ПараметрыСеанса.ТекущийЯзыкИнтерфейсаПрограммы) ИЛИ ПараметрыСеанса.ТекущийЯзыкИнтерфейсаПрограммы = ПредопределенноеЗначение("Справочник.Языки.Русский");	
КонецФункции //ТекущийЯзыкРусский

Функция   ТоварВедетсяПоСериям(Знач Номенклатура) Экспорт	
	Возврат ОбщийМодульСервисСервер.ПолучитьЗначениеРеквизита(Номенклатура, "СерийныйУчет");	
КонецФункции //ТоварВедетсяПоСериям

Функция   ТоварВедетсяПоСериямИСерияОбязательна(Знач Номенклатура) Экспорт
	
	Результат = ЛОЖЬ;
	
	Если ЗначениеЗаполнено(Номенклатура)
		И Номенклатура.СерийныйУчет
		И Номенклатура.ЗапретитьУказаниеБезСерии Тогда
		
		Результат = ИСТИНА;
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции //ТоварВедетсяПоСериямИСерияОбязательна

&НаСервере
Функция   ТоварНеУчитываетсяПоКоличеству(Знач Номенклатура) Экспорт
	//%16.8	
	Если Номенклатура.НеОтслеживатьОстаток 
		ИЛИ Номенклатура = Справочники.Номенклатура.ТоварНаСумму
		ИЛИ Номенклатура = Справочники.Номенклатура.УслугиНаСумму Тогда
		
		возврат ИСТИНА;
	Иначе
		возврат ЛОЖЬ;
	КонецЕсли;
	
КонецФункции //ТоварНеУчитываетсяПоКоличеству

Функция   УНоменклатурыЕстьАналоги(Знач Номенклатура) Экспорт
	Возврат ОбщийМодульСервер.УНоменклатурыЕстьАналоги(Номенклатура);
КонецФункции

Функция   УНоменклатурыЕстьЕдиницыИзмерения(Знач Номенклатура) Экспорт
	Возврат ОбщийМодульСервер.УНоменклатурыЕстьАналоги(Номенклатура);
КонецФункции 

Функция   ЭтоНабор(Знач Номенклатура) Экспорт
	
	#Если Клиент Тогда
		Возврат ОбщийМодульСервер.ПолучитьЗначениеПраметраСеанса("ИспользоватьНаборыТоваровПС") И ОбщийМодульТоварСервер.ЭтоНабор(Номенклатура);
	#КонецЕсли
	
	#Если НЕ Клиент Тогда
		Возврат ПараметрыСеанса.ИспользоватьНаборыТоваровПС И Номенклатура.ЭтоНабор;		
	#КонецЕсли	
	
КонецФункции //ЭтоНабор

&НаСервере
Функция   ПолучитьСписокИзМетаданных(Знач ЭтоСправочник = ЛОЖЬ) Экспорт
	
	СписокЭлементовМетаданных = Новый СписокЗначений;
	
	Если ЭтоСправочник Тогда
		Для Каждого ЭлементМетаданных Из Метаданные.Справочники Цикл
			СписокЭлементовМетаданных.Добавить(ЭлементМетаданных.Имя, ЭлементМетаданных.Синоним);	
		КонецЦикла;	
	Иначе
		Для Каждого ЭлементМетаданных Из Метаданные.Документы Цикл
			СписокЭлементовМетаданных.Добавить(ЭлементМетаданных.Имя, ЭлементМетаданных.Синоним);	
		КонецЦикла;	
	КонецЕсли;
	
	Возврат СписокЭлементовМетаданных;
	
КонецФункции //ПолучитьСписокИзМетаданных

Функция   ВывестиНаименованияНаДругомЯзыке() Экспорт	
	Возврат ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ПоддерживатьНаименованияНаДругихЯзыкахКромеРусского", ИСТИНА) И НЕ ОбщийМодульПовтор.ТекущийЯзыкРусский();	
КонецФункции //ВывестиНаименованияНаДругомЯзыке

&НаСервере
Функция   ПолучитьТекущийЯзыкДокументов(Знач Контрагент = Неопределено, Знач ЯзыкПечати = Неопределено, Знач ВернутьКод = ИСТИНА) Экспорт
	
	Результат = ПредопределенноеЗначение("Справочник.Языки.Русский");
	
	Если НЕ ЗначениеЗаполнено(ЯзыкПечати) Тогда
		
		Если ЗначениеЗаполнено(Контрагент)
			И ЗначениеЗаполнено(Контрагент.ЯзыкДокументов) Тогда
			
			Результат = Контрагент.ЯзыкДокументов;
			
		Иначе
			
			Результат = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ЯзыкПечатныхФорм");
			Если НЕ ЗначениеЗаполнено(Результат) Тогда
				Результат = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ТекущийЯзыкИнтерфейса");
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		Результат = ЯзыкПечати;
		
	КонецЕсли;
	
	Если ВернутьКод Тогда
		Возврат Результат.Код;
	Иначе
		Возврат Результат;
	КонецЕсли;
	
КонецФункции //ПолучитьТекущийЯзыкДокументов()

&НаСервере
Функция   ПолучитьДополнительныеРеквизитыКлиентов() Экспорт
	
	Результат = Неопределено;
	ДопРеквизит = Неопределено;
	
	Для Счетчик = 1 по 10 Цикл
		
		Выполнить(" ДопРеквизит = Справочники.ДополнительныеРеквизиты.ДополнительныйРеквизитСправочникаКлиентов" + СокрЛП(Счетчик) + ";");
		Наименование = ДопРеквизит.Наименование;
		РеквизитВыбран = ЗначениеЗаполнено(Наименование);
		
		Если НЕ РеквизитВыбран Тогда
			Прервать;
			
		Иначе
			Если Результат = Неопределено Тогда
				Результат = Новый ТаблицаЗначений;			
				Результат.Колонки.Добавить("ИмяДопРеквизита");	
				Результат.Колонки.Добавить("ДополнительныйРеквизит");
			КонецЕсли;
			СтрокаРезультата = Результат.Добавить();
			СтрокаРезультата.ИмяДопРеквизита = Наименование;
			СтрокаРезультата.ДополнительныйРеквизит = ДопРеквизит;
			
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат Результат;
	
КонецФункции //ПолучитьДополнительныеРеквизитыКлиентов

&НаСервере
Функция   ПолучитьЗапретНаНастройкиОтчета(Знач НаименованиеОтчета, Знач ТекущийПользователь) Экспорт
	
	Запрет = ЛОЖЬ;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 ПользователиСкрытьНастройкиОтчетов.СкрытьНастройки
	|ИЗ Справочник.Пользователи.СкрытьНастройкиОтчетов КАК ПользователиСкрытьНастройкиОтчетов
	|ГДЕ ПользователиСкрытьНастройкиОтчетов.Ссылка = &ТекущийПользователь
	|	И ПользователиСкрытьНастройкиОтчетов.НаименованиеОтчета = &НаименованиеОтчета";
	
	Запрос.УстановитьПараметр("НаименованиеОтчета", НаименованиеОтчета);
	Запрос.УстановитьПараметр("ТекущийПользователь", ТекущийПользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ВыборкаДетальныеЗаписи.Следующий();
		Запрет = ВыборкаДетальныеЗаписи.СкрытьНастройки;
	КонецЕсли;
	
	Возврат Запрет;
	
КонецФункции //ПолучитьЗапретНаНастройкиОтчета

&НаСервере
Функция   ПолучитьНоменклатуруПоПредставлениюКонтрагента(Знач КлиентПоставщик, Знач Поле = Неопределено, Знач Текст, Знач НаЯзыке = Неопределено) Экспорт
	
	Результат = Неопределено;
	
	Если ЗначениеЗаполнено(КлиентПоставщик)
		И НЕ ПустаяСтрока(Текст) Тогда
		
		Если НЕ ЗначениеЗаполнено(Поле = Неопределено) Тогда
			Поле = ПредопределенноеЗначение("Перечисление.ПоляПредставленийНоменклатуры.Наименование");
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 ПредставлениеТоваровКонтрагентами.Номенклатура
		               |ИЗ РегистрСведений.ПредставлениеТоваровКонтрагентами КАК ПредставлениеТоваровКонтрагентами
		               |ГДЕ (ПредставлениеТоваровКонтрагентами.КлиентПоставщик = &КлиентПоставщик
		               |	ИЛИ ПредставлениеТоваровКонтрагентами.КлиентПоставщик В ИЕРАРХИИ(&КлиентПоставщик))
		               |	И ПредставлениеТоваровКонтрагентами.Поле = &Поле";
		
		Если НЕ НаЯзыке = Неопределено Тогда
			Запрос.Текст = Запрос.Текст + " И ПредставлениеТоваровКонтрагентами.Язык = &НаЯзыке ";
		КонецЕсли;
		
		Запрос.Текст = Запрос.Текст + "	И ПредставлениеТоваровКонтрагентами.ЗначениеПредставления = &Текст
		|УПОРЯДОЧИТЬ ПО ПредставлениеТоваровКонтрагентами.Номенклатура";
		
		Запрос.УстановитьПараметр("КлиентПоставщик", КлиентПоставщик);
		Запрос.УстановитьПараметр("Поле", Поле);
		Запрос.УстановитьПараметр("Текст", Текст);
		
		Если НЕ НаЯзыке = Неопределено Тогда
			Запрос.УстановитьПараметр("НаЯзыке", НаЯзыке);
		КонецЕсли;	
		
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Результат = ВыборкаДетальныеЗаписи.Номенклатура;
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции //ПолучитьНоменклатуруПоПредставлениюКонтрагента

&НаСервере
Функция   НаЭтотТоварНеРаспределяютсяДополнительныеРасходыПриПриобретении(Знач Номенклатура) Экспорт
	Возврат Номенклатура.НаЭтотТоварНеРаспределяютсяДополнительныеРасходыПриПриобретении;
КонецФункции //НаЭтотТоварНеРаспределяютсяДополнительныеРасходыПриПриобретении

&НаСервере
Функция   ПроверитьЧтоТипДокументаПроводимыйИМожетБытьЗаблокирован(Знач ТипЗнчИсточник) Экспорт
	
	Если ТипЗнчИсточник = СокрЛП(Тип("ДокументОбъект.ВыполненияРабот"))
		ИЛИ ТипЗнчИсточник = СокрЛП(Тип("ДокументОбъект.ВыполненияРабот")) 
		ИЛИ ТипЗнчИсточник = СокрЛП(Тип("ДокументОбъект.Инвентаризации"))
		ИЛИ ТипЗнчИсточник = СокрЛП(Тип("ДокументОбъект.Комплектация"))
		ИЛИ ТипЗнчИсточник = СокрЛП(Тип("ДокументОбъект.КорректировкиИРегистрацияОстатков"))
		ИЛИ ТипЗнчИсточник = СокрЛП(Тип("ДокументОбъект.ОказанияУслугЗаВремя"))
		ИЛИ ТипЗнчИсточник = СокрЛП(Тип("ДокументОбъект.ОтчетКомиссионера"))
		ИЛИ ТипЗнчИсточник = СокрЛП(Тип("ДокументОбъект.ПеремещенияТовара"))
		ИЛИ ТипЗнчИсточник = СокрЛП(Тип("ДокументОбъект.ПоступленияТовара"))
		ИЛИ ТипЗнчИсточник = СокрЛП(Тип("ДокументОбъект.РасходыТовара")) Тогда
		
		Возврат ИСТИНА;
	Иначе
		Возврат ЛОЖЬ;			
	КонецЕсли;
	
КонецФункции
