//sza080123
Процедура ПередОткрытием(Отказ, СтандартнаяОбработка) //поиск всех объектов метаданных для показателей
	тт=ТабличноеПоле1.Найти(сейчас,"Кодировка");
	если не тт=неопределено тогда  //установка на текущую позицию
		ЭтаФорма.ЭлементыФормы.ТабличноеПоле1.ТекущаяСтрока= тт;
	конецесли;	
КонецПроцедуры

Процедура ТабличноеПоле1ВыборЗначения(Элемент, СтандартнаяОбработка, Значение)
	этаформа.Закрыть(ЭтаФорма.ЭлементыФормы.ТабличноеПоле1.ТекущаяСтрока.Кодировка);
КонецПроцедуры

Процедура ТабличноеПоле1Выбор(Элемент, ВыбраннаяСтрока, Колонка, СтандартнаяОбработка)
	этаформа.Закрыть(ЭтаФорма.ЭлементыФормы.ТабличноеПоле1.ТекущаяСтрока.Кодировка);
КонецПроцедуры
