//sza140420-1356 SZA: 
//sza130918-0138 : 

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("000200", , , );
	
	Если НЕ Отказ Тогда	
		Если ЗначениеЗаполнено(ПараметрКоманды)
			и НЕ ОбщийМодульСервер.ПроверитьДокументПроведен(ПараметрКоманды)
			и Вопрос(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Очистить таблицу Товары документа?"), РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			
			ОбщийМодульКлиент.ДобавитьСобытиеЖурнала(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Очистил таблицу Товары"), 2, ПараметрКоманды);
			ОбщийМодульКлиент.ОчиститьТовары(ПараметрКоманды);
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры
