// sza140420-1356
// sza130918-0138 : 

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("000200", , , );
	
	Если НЕ Отказ Тогда	
		Если ЗначениеЗаполнено(ПараметрКоманды)
			И НЕ ОбщийМодульСервер.ПроверитьДокументПроведен(ПараметрКоманды) Тогда
			
			ПоказатьВопрос(Новый ОписаниеОповещения("ОбработкаКомандыЗавершение", ЭтотОбъект, Новый Структура("ПараметрКоманды", ПараметрКоманды)), ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Очистить таблицу Товары документа?"), РежимДиалогаВопрос.ДаНет);
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКомандыЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ПараметрКоманды = ДополнительныеПараметры.ПараметрКоманды;	
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		ОбщийМодульКлиент.ДобавитьСобытиеЖурнала(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Очистил таблицу Товары"), 2, ПараметрКоманды);
		ОбщийМодульКлиент.ОчиститьТовары(ПараметрКоманды);	
	КонецЕсли;
	
КонецПроцедуры
