// sza150728-0334 

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("00065D", , , );
	
	Если НЕ Отказ Тогда
		ПараметрыФормы = Новый Структура("ДляЦенПоставщика", ИСТИНА);
		ОткрытьФорму("Документ.УстановкиЦен.ФормаСписка", ПараметрыФормы); // , ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	КонецЕсли;

КонецПроцедуры
