//sza140509-0114 SZA: 
//sza140216-2145

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	ТекущаяСтраница = Элементы.ГруппаСтраниц.ТекущаяСтраница;
	СтраницыПанели  = Элементы.ГруппаСтраниц.ПодчиненныеЭлементы;
	СтраницаПанели  = СтраницыПанели.Индекс(ТекущаяСтраница);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
	
	Если ЗначениеЗаполнено(СтраницаПанели)Тогда
		
		попытка
			СтраницыПанели  = Элементы.ГруппаСтраницСправа.ПодчиненныеЭлементы;
			ТекущаяСтраница = СтраницыПанели.получить(СтраницаПанели);
			элементы.ГруппаСтраницСправа.ТекущаяСтраница = ТекущаяСтраница;
		Исключение
		конецпопытки;	
	КонецЕсли;
	ПроверитьЗаполнениеПараметров() 	;
	ПриСменеВИдаОкна();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаКлиенте
Процедура НастройкиОказанияУслугЗаВремя(Команда)
	
	ПараметрыФормы = Новый Структура("ВидЦен", ВидЦен);
	ПараметрыФормы.Вставить("МинимальнаяСуммаОказанияУслуг", МинимальнаяСуммаОказанияУслуг);
	ПараметрыФормы.Вставить("МинимальныйОбъемОказанияУслуг", МинимальныйОбъемОказанияУслуг);
	ПараметрыФормы.Вставить("ОказываемаяУслуга", ОказываемаяУслуга);
	ПараметрыФормы.Вставить("Организация", Организация);
	ПараметрыФормы.Вставить("ОткрыватьНовыйДокументОказанияУслугПриЗавершении", ОткрыватьНовыйДокументОказанияУслугПриЗавершении);
	ПараметрыФормы.Вставить("Сотрудник", Сотрудник);
	
	ФормаНастроек = ПолучитьФорму("Документ.ОказанияУслугЗаВремя.Форма.ФормаНастроек", ПараметрыФормы);
	ПараметрыФормы = ФормаНастроек.ОткрытьМодально();
	Если НЕ ПараметрыФормы = Неопределено Тогда
		ВидЦен = ПараметрыФормы.ВидЦен;
		МинимальнаяСуммаОказанияУслуг = ПараметрыФормы.МинимальнаяСуммаОказанияУслуг;
		МинимальныйОбъемОказанияУслуг = ПараметрыФормы.МинимальныйОбъемОказанияУслуг;
		ОказываемаяУслуга = ПараметрыФормы.ОказываемаяУслуга;
		Организация = ПараметрыФормы.Организация;
		ОткрыватьНовыйДокументОказанияУслугПриЗавершении = ПараметрыФормы.ОткрыватьНовыйДокументОказанияУслугПриЗавершении;
		Сотрудник = ПараметрыФормы.Сотрудник;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СменитьВидОкна(Команда)
	
	ПредставитьДвумяКолонками = не ПредставитьДвумяКолонками;
	ПриСменеВИдаОкна();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриСменеВИдаОкна()
	
	Элементы.ГруппаСтраниц.Видимость 	= НЕ ПредставитьДвумяКолонками;
	Элементы.ГруппаОбщегоВида.Видимость = ПредставитьДвумяКолонками;
	
	Этаформа.ОбновитьОтображениеДанных();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьЗаполнениеПараметров() 	
	
	Если НЕ ЗначениеЗаполнено(ВидЦен) Тогда
		ВидЦен = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВидЦенРасходованияПоУмолчанию");
		Если не ЗначениеЗаполнено(ВидЦен) Тогда
			ВидЦен = ПредопределенноеЗначение("Справочник.ВидыЦен.ОсновнойВидЦен");
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ОказываемаяУслуга) Тогда
		ОказываемаяУслуга = ПредопределенноеЗначение("Справочник.Номенклатура.УслугиНаСумму");
		Если не ЗначениеЗаполнено(ОказываемаяУслуга.ПериодОказанияУслугиЗаВремя) Тогда
			ОказываемаяУслуга = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
		КонецЕсли;
	КонецЕсли;
	
	Если МинимальнаяСуммаОказанияУслуг = 0 Тогда
		МинимальнаяСуммаОказанияУслуг = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("МинимальнаяСуммаОказанияУслуг") ;
	КонецЕсли;	
	
	Если МинимальныйОбъемОказанияУслуг = 0 Тогда
		МинимальныйОбъемОказанияУслуг = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("МинимальныйОбъемОказанияУслуг") ;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Организация = ПредопределенноеЗначение("Справочник.Организации.ОсновноеПредприятие");
	КонецЕсли;
	
	Если ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетПродажПоСотрудникам")
		и не ЗначениеЗаполнено(Сотрудник) Тогда
		
		Сотрудник = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("СотрудникРеализацииПоУмолчанию") ;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("001290", ЭтаФорма, Отказ, );
	
	Если Не Отказ Тогда
		ОбщийМодульСервисСервер.ОформитьФорматКоличества(Элементы.НачалоОказанияУслуг1ТовараВКоличестве, , Истина);
		ОбщийМодульСервисСервер.ОформитьФорматКоличества(Элементы.ОкончаниеОказанияУслуг1ТовараВКоличестве, , Истина);
		ОбщийМодульСервисСервер.ОформитьФорматКоличества(Элементы.ТовараВКоличестве, , Истина);	
		ОбщийМодульСервер.ОбеспечитьСписокОтборов(Список);
		ОбщийМодульСервер.ОбеспечитьСписокОтборов(ОкончаниеОказанияУслуг);
		ОбщийМодульСервер.ОбеспечитьСписокОтборов(НачалоОказанияУслуг);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьНачалоОказанияУслуги(Команда)
	
	ПараметрыФормы = новый Структура("Номенклатура", ОказываемаяУслуга);
	ПараметрыФормы.Вставить("Организация", Организация);
	ПараметрыФормы.Вставить("ВидЦен", ВидЦен);
	ПараметрыФормы.Вставить("Сотрудник", Сотрудник);
	ПараметрыФормы.Вставить("МинимальнаяСуммаОказанияУслуг", МинимальнаяСуммаОказанияУслуг);
	ПараметрыФормы.Вставить("МинимальныйОбъемОказанияУслуг", МинимальныйОбъемОказанияУслуг);
	ПараметрыФормы.Вставить("ОткрыватьНовыйДокументОказанияУслугПриЗавершении", ОткрыватьНовыйДокументОказанияУслугПриЗавершении);
	ПараметрыФормы.Вставить("ПоУмолчаниюУслугаОказана", ПоУмолчаниюУслугаОказана);
	
	ФормаДокумента = ПолучитьФорму("Документ.ОказанияУслугЗаВремя.ФормаОбъекта", ПараметрыФормы);
	ФормаДокумента.Открыть();
	
КонецПроцедуры
