// sza131119-1411
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура("", );
	Если ОбщийМодульСервисСервер.ПолучитьВерсиюПлатформы() < 803040000 Тогда
		ОткрытьФорму("Справочник.ЗаметкиИНапоминания.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	Иначе
		Выполнить(" ОткрытьФорму(""Справочник.ЗаметкиИНапоминания.ФормаСписка"", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка); ");
	КонецЕсли;
	
КонецПроцедуры
