//sza140613-1404 : 
//sza140206-0029 

Процедура ПриКопировании(ОбъектКопирования)
	ЭтотОбъект.комментарий = "";
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	если не отказ 
		и Модифицированность() 
		и РежимЗаписи = РежимЗаписиДокумента.Проведение тогда
		
		Если НЕ ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ПриАвтоматическомПерепроведенииДокументовОтменитьПроверкиНаОтказ") Тогда
			ПодготовкаКПроведению(Отказ);	
		КонецЕсли;
		
		//если ТовараВКоличестве 	= 0
		//	и ТовараНаСумму 	= 0
		//	и ПоступилоДенег 	= 0
		//	и РежимЗаписи 		= РежимЗаписиДокумента.Проведение тогда
		//	
		//	РежимЗаписи = РежимЗаписиДокумента.Запись;
		//КонецЕсли;	
		Если НЕ Актуален Тогда
			РежимЗаписи = РежимЗаписиДокумента.Запись;
		КонецЕсли;
		
	КонецЕсли;		
	
КонецПроцедуры

Процедура ПодготовкаКПроведению(Отказ) Экспорт
	
	//если не ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("НеСворачиватьТоварыПоКоличествуВоВсехДокументах") тогда
	//	
	//	если ОбщийМодульПовтор.ПолучитьПараметрСеанса("ИспользоватьСкидкиПС") тогда
	//		Товары.Свернуть("Номенклатура, СерияНоменклатуры, Цена, ПроцентСкидки", "Количество, Сумма, СуммаБезСкидки");
	//	иначе
	//		Товары.Свернуть("Номенклатура, СерияНоменклатуры, Цена", "Количество, Сумма");	
	//	КонецЕсли;	
	//КонецЕсли;
	//
	//массивпустыхстрок  = новый массив;
	//массивноменклатуры = Новый массив;
	//
	//для каждого СтрокаТовары из товары цикл
	//	
	//	Если НЕ ЗначениеЗаполнено(СтрокаТовары.Номенклатура) Тогда
	//		массивпустыхстрок.Добавить(СтрокаТовары);
	//		
	//	иначеесли не массивноменклатуры.Найти(СтрокаТовары.Номенклатура) = Неопределено тогда
	//		
	//		если ОбщийМодульПовторВТеченииСервера.ВыводитьСообщенияМожно() тогда
	//			//Сообщение = Новый СообщениеПользователю;
	//			//Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("На строке №") + " " + СтрокаТовары.НомерСтроки + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке(" повторяется номенклатура:" + СтрокаТовары.Номенклатура);
	//			//Сообщение.Сообщить();                                               	
	//			ОбщийМодульСервисСервер.ДобавитьСообщениеПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("На строке №") + " " + СтрокаТовары.НомерСтроки + " " + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("повторяется номенклатура:" + СтрокаТовары.Номенклатура), , Ссылка);
	//		КонецЕсли;
	//		
	//	иначе
	//		массивноменклатуры.Добавить(СтрокаТовары.Номенклатура);
	//		
	//	КонецЕсли;                                    	
	//КонецЦикла;
	//
	//для каждого СтрокаТовары из массивпустыхстрок цикл
	//	товары.Удалить(СтрокаТовары);	
	//КонецЦикла;	
	//
	//		ОбщийМодульТоварСервер.ПроверитьИСортироватьТаблицуТовары(ЭтотОбъект);
	//
	//Если ЗначениеЗаполнено(ВидЦен)
	//	и ЗначениеЗаполнено(видцен.ВалютаЦены) Тогда
	//	
	//	ТовараНаСумму 		= ОбщийМодульСервер.ПоКурсу(товары.Итог("Сумма"), , видцен.ВалютаЦены, Дата);
	//иначе
	//	ТовараНаСумму 		= товары.Итог("Сумма");
	//КонецЕсли;
	Если ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетДвиженияДенег")
		И не ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетДенегВНесколькихХранилищах")
		И ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетВалют")
		И Не Валюта = ПредопределенноеЗначение("Справочник.Валюты.ОсновнаяВалюта") Тогда
		
		ХранилищеДенег = ОбщийМодульПовтор.ПолучитьАвтоХранилищеДенегПоВалюте(Валюта, ХранилищеДенег);
	КонецЕсли;
	
	Если не отказ Тогда
		
		Если Актуален
			и ОбщийМодульПовтор.ПолучитьПараметрСеанса("ВестиУчетОтдельныхДоговоровСКонтрагентамиПС")
			и ЗначениеЗаполнено(договор) ТОгда
			
			Если НЕ ЗначениеЗаполнено(Клиент) ТОгда
				Клиент = договор.КлиентПоставщик;
			ИначеЕСли НЕ Клиент = договор.КлиентПоставщик Тогда
				Договор = ПредопределенноеЗначение("Справочник.Договора.ПустаяСсылка") ;	
			КонецЕсли;			
			
			Если ЗначениеЗаполнено(договор) 
				и ЗначениеЗаполнено(Организация) 
				и не Организация = договор.Организация Тогда
				
				Организация = ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка");
			КонецЕсли;	
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если НеПроводить Тогда
		НеПроводить = Ложь;
	Иначе
		
		Если не отказ Тогда
			
			движения.ВаловаяПрибыль.Записать();
			движения.ОплатаПоЗаказам.Записать();
			движения.Деньги.Записать();
			движения.ЗаказыКлиентов.Записать();
			движения.Продажи.Записать();
			движения.РасчетыСПоставщиками.Записать();
			движения.РасчетыСОтсрочкой.Записать();
			движения.РасчетыСПоставщикамиСОтсрочкой.Записать();
			движения.Товары.Записать();
			движения.Зарплата.Записать();
			
			Если Актуален Тогда
				
				ДвиженияСОтсрочкой = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ИспользоватьМеханизмОтсрочкиПлатежа");
				
				ВидДвиженияНакопленияРасход = ВидДвиженияНакопления.Расход;
				ВидДвиженияНакопленияПриход = ВидДвиженияНакопления.Приход;
				
				Если ЗначениеЗаполнено(Номенклатура) Тогда
					
					Если ЗначениеЗаполнено(ДатаПоступленияОбъектаРаботНаНашСклад) Тогда					
						Движение = Движения.Товары.Добавить();
						Движение.ВидДвижения 	= ВидДвиженияНакопленияПриход;
						Движение.Период 		= ДатаПоступленияОбъектаРаботНаНашСклад ;
						Движение.Номенклатура 	= Номенклатура;
						Движение.Склад 			= СкладДляОбъектаВыполненияРабот;
						Движение.Количество 	= 1;
						Движение.Сумма 			= ОценочнаяСтоимостьОбъектаРабот;
						Движение.Комментарий	= КомментарийПриПоступленииОбъектаРабот;
						Движение.СерияНоменклатуры = СерияНоменклатуры;	
						Движение.СписаниеИлиОприходование = Истина;
					КонецЕсли;
					
					Если ЗначениеЗаполнено(ДатаПоступленияОбъектаРаботНаНашСклад) Тогда					
						Движение = Движения.Товары.Добавить();
						Движение.ВидДвижения 	= ВидДвиженияНакопленияРасход;
						Движение.Период 		= ДатаВыдачиОбъектаРаботКлиентуОбратно;
						Движение.Номенклатура 	= Номенклатура;
						Движение.Склад 			= СкладДляОбъектаВыполненияРабот;
						Движение.Количество 	= 1;
						Движение.Сумма 			= ОценочнаяСтоимостьОбъектаРабот;
						Движение.Комментарий	= КомментарийПриВыдачеОбъектаРабот;
						Движение.СерияНоменклатуры = СерияНоменклатуры;	
						Движение.СписаниеИлиОприходование = Истина;
					КонецЕсли;
				КонецЕсли;
				
				ТовараНаСумму 	  = 0;
				Для Каждого ТекСтрокаТовары Из Товары Цикл
					СуммаТов = ОбщийМодульСервер.ПоКурсу(ТекСтрокаТовары.Сумма, , ТекСтрокаТовары.Валюта, ТекСтрокаТовары.Дата);			
					ТовараНаСумму = ТовараНаСумму + СуммаТов;	
				КонецЦикла;
				
				ТовараВКоличестве = Товары.Итог("Количество");
				ПоступилоДенег = 0;
				Для Каждого СтрокаОплаты Из Оплаты Цикл		
					ПоступилоДенег = ПоступилоДенег + СтрокаОплаты.Сумма * СтрокаОплаты.Курс;
				КонецЦикла;	 
				
				ЗначениеЗаполненоКлиентПоставщик = ЗначениеЗаполнено(Клиент);
				ЭтоКлиент						 = ЗначениеЗаполненоКлиентПоставщик;
				ВестиУчетЗаказовКлиентов 		 = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетЗаказовКлиентов") ;
				
				ВестиУчетПродажСотрудников  = Актуален И ЭтоКлиент и ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетПродажПоСотрудникам") И ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетЗарплатыСотрудников");
				ОтменитьПроверкиНаОтказ 	= ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ПриАвтоматическомПерепроведенииДокументовОтменитьПроверкиНаОтказ");
				
				Движения.ЗаказыКлиентов.Записывать = ВестиУчетЗаказовКлиентов;
				
				Если не ОтменитьПроверкиНаОтказ
					И ОбщийМодульПовтор.ПолучитьПараметрСеанса("ВестиУчетОтдельныхДоговоровСКонтрагентамиПС")
					и ЗначениеЗаполнено(Договор) Тогда
					
					Отказ = ОбщийМодульСервер.ПроверитьОтказПоСуммеИлиКоличествуДляДоговора(Отказ, Договор, ЭтоКлиент, Дата, ТовараНаСумму, ТовараВКоличестве, Ложь, ПоступилоДенег, Ссылка);
				КонецЕсли;
				
				Если Не Отказ ТОгда
					
					ИспользоватьСложныйМеханизмЦен = ОбщийМодульПовтор.ПолучитьПараметрСеанса("ИспользоватьСложныйМеханизмЦенПС");
					ВестиУчетВаловойПрибыли 	   = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетВаловойПрибыли");				
					ВестиУчетПоСкладам 			   = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетПоСкладам");				
					
					Если ИспользоватьСложныйМеханизмЦен
						и ЗначениеЗаполнено(видцен)
						и ЗначениеЗаполнено(видцен.ВалютаЦены) Тогда
						
						ВалютаЦены = видцен.ВалютаЦены ;
					иначе
						ВалютаЦены = ОбщийМодульПовтор.ЗначениеПредопределенного("Справочники.Валюты.ОсновнаяВалюта") ;
					КонецЕсли;
					
					ПоведениеПрограммыПриРасходеТоваровНижеРекомендованногоМинимальногоОстатка = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ПоведениеПрограммыПриРасходеТоваровНижеРекомендованногоМинимальногоОстатка");
					ПоведениеПрограммыПриРасходеТоваровБезОстатка = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ПоведениеПрограммыПриРасходеТоваровБезОстатка");
					
					ОстаткиСледуетПроверять = (ЗначениеЗаполнено(ПоведениеПрограммыПриРасходеТоваровНижеРекомендованногоМинимальногоОстатка)
					И НЕ ПоведениеПрограммыПриРасходеТоваровНижеРекомендованногоМинимальногоОстатка = Перечисления.ИгнорироватьРазрешитьЗапретить.Игнорировать )
					ИЛИ (ЗначениеЗаполнено(ПоведениеПрограммыПриРасходеТоваровБезОстатка)
					И НЕ ПоведениеПрограммыПриРасходеТоваровБезОстатка = Перечисления.ИгнорироватьРазрешитьЗапретить.Игнорировать) ;
					
					былопополнение     = ложь;	
					
					Для Каждого ТекСтрокаТовары Из Товары Цикл
						
						Склад = ТекСтрокаТовары.Склад;
						ДатаТ = ТекСтрокаТовары.Дата;
						НоменклатураТ = ТекСтрокаТовары.Номенклатура;
						
						Если не ОтменитьПроверкиНаОтказ
							И ВестиУчетПоСкладам
							и НЕ ЗначениеЗаполнено(Склад) Тогда
							
							если ОбщийМодульПовторВТеченииСервера.ВыводитьСообщенияМожно() тогда
								//Сообщение = Новый СообщениеПользователю;
								//Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Не указан склад!");
								//Сообщение.Поле 	= "Склад";
								//Сообщение.Сообщить();	
								ОбщийМодульСервисСервер.ДобавитьСообщениеПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Не указан склад!"), , Ссылка);
							КонецЕсли;
							
							Отказ = Истина;						
						КонецЕсли;
						СтруктураТаблиц    = ОбщийМодульСервер.ПолучитьТаблицыЦенСписанияИОстатков(, склад, датаТ, ОстаткиСледуетПроверять, НоменклатураТ);
						ТаблицаЦенСписания = СтруктураТаблиц.ТаблицаЦенСписания;
						
						если ОстаткиСледуетПроверять тогда
							ГТ = СтруктураТаблиц.ТаблицаОстатков;	
						КонецЕсли;	
						
						если ВестиУчетПоСкладам  
							и ЗначениеЗаполнено(склад.СкладПополнения) тогда
							
							ДоступенСкладПополнения = истина;
							СкладПополнения 		= склад.СкладПополнения;
							
						иначе
							ДоступенСкладПополнения = ложь;
						КонецЕсли;			
						
						
						СерияНоменклатурыТ = ТекСтрокаТовары.СерияНоменклатуры;
						Количество 		  = ?(ЗначениеЗаполнено(ТекСтрокаТовары.ЕдиницаИзмерения), ТекСтрокаТовары.ЕдиницаИзмерения.Количество * ТекСтрокаТовары.Количество, ТекСтрокаТовары.Количество);
						КомментарийСтроки = ?(ЗначениеЗаполнено(текстрокатовары.ОСтроке), текстрокатовары.ОСтроке, Комментарий);
						КоличествоОстаток = 0;
						
						если ВестиУчетЗаказовКлиентов тогда
							
							ЗаказКлиентаКлиентПоставщик = Неопределено;
							Если ЗначениеЗаполнено(ЗаказКлиента) тогда
								ЗаказКлиентаКлиентПоставщик = ЗаказКлиента.КлиентПоставщик;
							КонецЕсли;
							
							Если ЗначениеЗаполнено(ЗаказКлиентаКлиентПоставщик) Тогда
								ЗаписьРегистра = Движения.ЗаказыКлиентов.ДобавитьРасход();
								ЗаписьРегистра.Активность 	= Истина;
								ЗаписьРегистра.Количество   = Количество;
								ЗаписьРегистра.Номенклатура = НоменклатураТ;
								ЗаписьРегистра.Период       = ДатаТ;
								ЗаписьРегистра.Клиент    	= ЗаказКлиентаКлиентПоставщик;
							КонецЕсли;
							
						КонецЕсли;
						
						если ОстаткиСледуетПроверять тогда
							СтрокаОстаток = ГТ.найти(номенклатура, "Номенклатура");
							
							Если не СтрокаОстаток = Неопределено Тогда
								
								КоличествоОстаток 	  = СтрокаОстаток.КоличествоОстаток;
								СуммаОстаток 		  = СтрокаОстаток.СуммаОстаток;
								ПредопределенныйТовар = СтрокаОстаток.НеОтслеживатьОстаток или СтрокаОстаток.Предопределенный;
								ЭтоНабор 			  = СтрокаОстаток.ЭтоНабор;
								
							иначе
								ЭтоНабор 			  = ОбщийМодульПовтор.ЭтоНабор(НоменклатураТ);
								ПредопределенныйТовар = ОбщийМодульПовтор.ТоварНеУчитываетсяПоКоличеству(НоменклатураТ);
								СуммаОстаток		  = 0;
								КоличествоОстаток 	  = 0;
								
							КонецЕсли;			
							
						иначе 			
							ЭтоНабор 			  = ОбщийМодульПовтор.ЭтоНабор(НоменклатураТ);
							ПредопределенныйТовар = ОбщийМодульПовтор.ТоварНеУчитываетсяПоКоличеству(НоменклатураТ);
							СуммаОстаток 		  = 0;
							КоличествоОстаток 	  = 0;
							
						КонецЕсли;		
						
						если не ПредопределенныйТовар
							и не этонабор тогда
							
							если ДоступенСкладПополнения  тогда //необходимость в дооприходовании товаров из склада пополнения
								Останется = КоличествоОстаток - Количество;
								
								Если останется < 0 Тогда
									
									необходимопополнить = -Останется;
									
									СтруктураОстатка = ОбщийМодульСервер.ОстатокТовара(СкладПополнения, НоменклатураТ, датаТ, истина);
									ОстатокНаСкладеПополнения = СтруктураОстатка.Количество;
									
									Если ОстатокНаСкладеПополнения >= необходимопополнить Тогда
										переносить = необходимопополнить;
									Иначе //остатка и там не хватает
										переносить = ОстатокНаСкладеПополнения;					
									КонецЕсли;
									
									Движение = Движения.Товары.Добавить();					
									Движение.Количество 	= переносить;	
									Движение.ВидДвижения 	= ВидДвиженияНакопленияРасход;
									Движение.Период 		= ДатаТ ;
									Движение.Номенклатура 	= НоменклатураТ;
									Движение.Склад 			= СкладПополнения;
									Движение.Комментарий	= ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Пополнение") + " " + КомментарийСтроки;
									Движение.СерияНоменклатуры = СерияНоменклатурыТ;
									
									ЦенаСписания   = ОбщийМодульСервер.ПолучитьЦенуСписания(НоменклатураТ, переносить, датаТ, СтруктураОстатка);
									СуммаСписания  = ЦенаСписания * переносить;
									Движение.Сумма = СуммаСписания;
									
									Движение = Движения.Товары.Добавить();
									Движение.ВидДвижения 	= ВидДвиженияНакопленияПриход;
									Движение.Период 		= ДатаТ ;
									Движение.Номенклатура 	= НоменклатураТ;
									Движение.Склад 			= Склад;
									Движение.Количество 	= переносить;					
									Движение.Сумма 			= СуммаСписания;
									Движение.Комментарий	= ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Пополнение") + " " + КомментарийСтроки;
									Движение.СерияНоменклатуры = СерияНоменклатурыТ;
									
									КоличествоОстаток = КоличествоОстаток + переносить; 
									СуммаОстаток 	  = СуммаОстаток + СуммаСписания;
									
									былопополнение 	  = истина;
									
								КонецЕсли;
							КонецЕсли;
							
							если не ОтменитьПроверкиНаОтказ
								И ОстаткиСледуетПроверять тогда
								
								Отказ = ОбщийМодульСервер.ПроверитьОстатокТоваров(ПоведениеПрограммыПриРасходеТоваровНижеРекомендованногоМинимальногоОстатка, ПоведениеПрограммыПриРасходеТоваровБезОстатка, Склад, НоменклатураТ, Количество, ДатаТ, Истина, КоличествоОстаток, Ссылка);	
							КонецЕсли;
							
						КонецЕсли;
						
						Если Не отказ тогда
							
							сумма 	 = ТекСтрокаТовары.Сумма;
							цена 	 = ТекСтрокаТовары.цена;					
							СуммаТов = ОбщийМодульСервер.ПоКурсу(Сумма, , ТекСтрокаТовары.Валюта, ДатаТ);			
							
							если НЕ ЭтоНабор Тогда 				
								
								если не ТаблицаЦенСписания = Неопределено тогда
									
									СтрокаЦеныСписания = ТаблицаЦенСписания.найти(номенклатура, "Номенклатура");
									Если не СтрокаЦеныСписания = Неопределено Тогда					
										ЦенаСписания = СтрокаЦеныСписания.Цена;					
									иначе
										ЦенаСписания = ОбщийМодульСервер.ПолучитьЦенуНаСервере(номенклатураТ, истина, датаТ, ложь, , , , , Ссылка, , ТекСтрокаТовары.ЕдиницаИзмерения);
									КонецЕсли;
									
								иначе
									ЦенаСписания = ОбщийМодульСервер.ПолучитьЦенуНаСервере(номенклатураТ, истина, датаТ, ложь, , , , , Ссылка, , ТекСтрокаТовары.ЕдиницаИзмерения);
								КонецЕсли;
								
								Если НЕ отказ
									И НЕ ПредопределенныйТовар тогда
									
									Движение = Движения.Товары.Добавить();					
									Движение.Количество   = Количество;  						
									Движение.Номенклатура = НоменклатураТ;
									Движение.ВидДвижения  = ВидДвиженияНакопленияРасход;
									Движение.Период 	  = ДатаТ;
									Движение.Склад 		  = Склад;
									Движение.Комментарий  = КомментарийСтроки;
									Движение.СерияНоменклатуры = СерияНоменклатурыТ;
									
									Движение.Сумма = ЦенаСписания * Количество;
									Движение.СписаниеИлиОприходование = НЕ ЗначениеЗаполненоКлиентПоставщик;					
									
									Если ВестиУчетВаловойПрибыли Тогда
										
										Если ЭтоКлиент Тогда //нормальная реализация
											
											Если ЦенаСписания = 0 
												или не (СуммаТов - (ЦенаСписания * Количество) = 0) Тогда
												
												Движение = Движения.ВаловаяПрибыль.Добавить();
												Движение.ВидДвижения = ВидДвиженияНакопленияПриход;
												
												Если ЦенаСписания = 0 Тогда
													Движение.Сумма 			= СуммаТов;
													Движение.ПроцентНаценки = 100;
													
												Иначе
													Движение.Сумма 			= СуммаТов - (ЦенаСписания * Количество);
													ЦенаПоКурсу 			= ОбщийМодульСервер.ПоКурсу(Цена, , ВалютаЦены, ДатаТ);
													Движение.ПроцентНаценки = (ЦенаПоКурсу / (ЦенаСписания / 100)) - 100 ;
													Движение.РентабельностьПродаж = (ЦенаСписания / ?(ЦенаПоКурсу = 0, 1, ЦенаПоКурсу)) * 100;
													
												КонецЕсли; 			
												
												Движение.Склад		  = Склад;
												Движение.Период 	  = ДатаТ;
												Движение.Номенклатура = НоменклатураТ;
												Движение.Комментарий  = КомментарийСтроки;
												
											КонецЕсли;
											
										ИначеЕсли не ЗначениеЗаполненоКлиентПоставщик Тогда
											Движение = Движения.ВаловаяПрибыль.Добавить();
											Движение.ВидДвижения 	= ВидДвиженияНакопленияРасход;
											Движение.Склад			= Склад;
											Движение.Сумма 			= СуммаТов;
											Движение.ПроцентНаценки = 100;
											Движение.Период 		= ДатаТ;
											Движение.Номенклатура 	= НоменклатураТ;
											Движение.Комментарий	= КомментарийСтроки;
											
										КонецЕсли;
										
									КонецЕсли;
								КонецЕсли;
								
							иначе //этоабор
								отказ = обработатьдвижениядлянабора(НоменклатураТ, Количество, СуммаТов, ВестиУчетВаловойПрибыли, ЭтоКлиент, ЗначениеЗаполненоКлиентПоставщик, отказ, ПоведениеПрограммыПриРасходеТоваровНижеРекомендованногоМинимальногоОстатка, ПоведениеПрограммыПриРасходеТоваровБезОстатка, ОтменитьПроверкиНаОтказ, ДатаТ, Склад);
								
							КонецЕсли;
							
							Если не отказ
								и ЗначениеЗаполненоКлиентПоставщик Тогда
								
								Если ЭтоКлиент Тогда
									Движение = Движения.Продажи.Добавить();
									Движение.Клиент 	= Клиент;
									Движение.Количество = Количество;
									Движение.Сумма 		= СуммаТов;							
									Движение.Договор	= Договор;
									Движение.Период 	= ДатаТ;
									Движение.Номенклатура = НоменклатураТ;
									Движение.Комментарий = КомментарийСтроки;
								КонецЕсли;
								
							КонецЕсли;
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЕсли;
				
				Если не ПоступилоДенег = 0 
					и ЗначениеЗаполнено(ЗаказКлиента)
					и ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетОплатПоОтдельнымЗаказам") Тогда
					
					ЗаписьРегистра = Движения.ОплатаПоЗаказам.ДобавитьРасход();
					ЗаписьРегистра.Период	  = Дата;
					ЗаписьРегистра.Активность = Истина;
					ЗаписьРегистра.Заказ   	  = Ссылка;
					ЗаписьРегистра.Сумма 	  = ПоступилоДенег;// * Курс;
					
				КонецЕсли;
				
				Если не отказ
					И былопополнение Тогда
					
					Если ОбщийМодульПовторВТеченииСервера.ВыводитьСообщенияМожно() 
						И НЕ ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("НеСообщатьОПополненииТовараИлиДенег") тогда
						//Сообщение = Новый СообщениеПользователю;
						//Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Произведено пополнение за счет склада:") + " " + СкладПополнения;
						//Сообщение.Сообщить();                                               	
						ОбщийМодульСервисСервер.ДобавитьСообщениеПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Произведено пополнение за счет склада:") + " " + СкладПополнения, , Ссылка);
					КонецЕсли;
					
				КонецЕсли;
				
				Если не отказ 
					и ЗначениеЗаполненоКлиентПоставщик Тогда
					
					если ЭтоКлиент тогда
						Движение = Движения.Расчеты.Добавить();
						Движение.ВидДвижения = ВидДвиженияНакопленияПриход;
						Движение.Клиент 	 = Клиент;			
						Движение.Договор 	 = Договор;
						Движение.Период 	 = Дата;
						Движение.Комментарий = Комментарий;					
						Движение.Сумма 		 = ТовараНаСумму;
						
						Если ДвиженияСОтсрочкой Тогда
							Движение = Движения.РасчетыСОтсрочкой.Добавить();
							Движение.ВидДвижения = ВидДвиженияНакопленияПриход;
							Движение.Клиент 	 = Клиент;			
							Движение.Договор 	 = Договор;
							Движение.Период 	 = Дата + ?(ЗначениеЗаполнено(Договор), ?(Договор.УстанавливаетСрокОплатыВДнях = 0, ДнейОтсрочки, Договор.УстанавливаетСрокОплатыВДнях) * 3600 * 24, 0);
							Движение.Комментарий = Комментарий;					
							Движение.Сумма 		 = ТовараНаСумму;	
						КонецЕсли;
					КонецЕсли;
					
				КонецЕсли;	
				
				если НЕ ПоступилоДенег = 0 Тогда
					Для каждого Оплата из Оплаты ЦИкл
						Если ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетДвиженияДенег") тогда
							
							Если ЗначениеЗаполнено(Оплата.ХранилищеДенег) Тогда
								ФормаОплаты = Оплата.ХранилищеДенег.ФормаОплаты;
							ИначеЕсли ЗначениеЗаполнено(Оплата.ФормаОплаты) Тогда
								ФормаОплаты = Оплата.ФормаОплаты;
							Иначе					
								ФормаОплаты = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ФормаОплатыДляДенегВДокументахРасходаИПриходаТоваров") ;
							КонецЕсли;
							
							Отказ = ОбщийМодульСервер.ПроверитьОстатокДенежныхСредств( -Оплата.Сумма, Оплата.Дата, Оплата.ФормаОплаты, Оплата.Валюта, Оплата.ХранилищеДенег, , Ссылка, ОтменитьПроверкиНаОтказ);
							
							если не отказ тогда			
								
								Движение = Движения.Деньги.Добавить();
								Движение.ВидДвижения 	= ВидДвиженияНакопленияПриход;
								Движение.Период 		= Оплата.Дата;
								Движение.Статья 		= ОбщийМодульПовтор.ЗначениеПредопределенного("Справочники.СтатьиДвиженияДенег.ДоходОтРеализации");
								Движение.Валюта 		= Оплата.Валюта;
								Движение.СуммаВВалюте 	= Оплата.Сумма;
								Движение.Сумма 			= Оплата.Сумма * ?(Оплата.Курс = 0, 1, Оплата.Курс);
								Движение.ХранилищеДенег = Оплата.ХранилищеДенег;
								Движение.ФормаОплаты 	= Оплата.ФормаОплаты;	
								
							КонецЕсли;			             	
						КонецЕсли;
						
						если ЭтоКлиент тогда
							
							Движение = Движения.Расчеты.Добавить();
							Движение.ВидДвижения = ВидДвиженияНакопленияРасход;
							Движение.Клиент 	 = Клиент;					
							Движение.Договор	 = Договор;
							Движение.Период 	 = Оплата.Дата;
							Движение.Комментарий = Комментарий;						
							Движение.Сумма 		 = Оплата.Сумма * ?(Оплата.Курс = 0, 1, Оплата.Курс);
							
							Если ДвиженияСОтсрочкой Тогда
								Движение = Движения.РасчетыСОтсрочкой.Добавить();
								Движение.ВидДвижения = ВидДвиженияНакопленияРасход;
								Движение.Клиент 	 = Клиент;					
								Движение.Договор	 = Договор;
								Движение.Период 	 = Оплата.Дата;
								Движение.Комментарий = Комментарий;						
								Движение.Сумма 		 = Оплата.Сумма * ?(Оплата.Курс = 0, 1, Оплата.Курс);
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
					
				КонецЕсли;
				
				если не отказ и
					НЕ расходы.Количество() = 0 Тогда			
					
					Для каждого Расход из Расходы ЦИкл
						Если ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетДвиженияДенег") тогда
							
							Если ЗначениеЗаполнено(Расход.ХранилищеДенег) Тогда
								ФормаОплаты = Расход.ХранилищеДенег.ФормаОплаты;
							ИначеЕсли ЗначениеЗаполнено(Расход.ФормаОплаты) Тогда
								ФормаОплаты = Расход.ФормаОплаты;
							Иначе					
								ФормаОплаты = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ФормаОплатыДляДенегВДокументахРасходаИПриходаТоваров") ;
							КонецЕсли;
							
							Отказ = ОбщийМодульСервер.ПроверитьОстатокДенежныхСредств(Расход.Сумма, Расход.Дата, Расход.ФормаОплаты, Расход.Валюта, Расход.ХранилищеДенег, , Ссылка, ОтменитьПроверкиНаОтказ);
							
							если не отказ тогда										
								Движение = Движения.Деньги.Добавить();
								Движение.ВидДвижения 	= ВидДвиженияНакопленияРасход;
								Движение.Период 		= Расход.Дата;
								Движение.Статья 		= Расход.Статья;
								Движение.Валюта 		= Расход.Валюта;
								Движение.СуммаВВалюте 	= Расход.Сумма;
								Движение.Сумма 			= Расход.Сумма * ?(Расход.Курс = 0, 1, Расход.Курс);
								Движение.ХранилищеДенег = Расход.ХранилищеДенег;
								Движение.ФормаОплаты 	= Расход.ФормаОплаты;								
							КонецЕсли;			             	
						КонецЕсли;
						
						если ЗначениеЗаполнено(Расход.Поставщик) тогда						
							Движение = Движения.РасчетыСПоставщиками.Добавить();
							Движение.ВидДвижения = ВидДвиженияНакопленияРасход;
							Движение.Поставщик 	 = Расход.Поставщик; 					
							Движение.Договор	 = Расход.Договор;
							Движение.Период 	 = Расход.Дата;
							Движение.Комментарий = Расход.ОСтроке;
							Движение.Сумма 		 = Расход.Сумма * ?(Расход.Курс = 0, 1, Расход.Курс);
							
							Если ДвиженияСОтсрочкой Тогда
								Движение = Движения.РасчетыСПоставщиками.Добавить();
								Движение.ВидДвижения = ВидДвиженияНакопленияРасход;
								Движение.Поставщик 	 = Расход.Поставщик;
								Движение.Договор	 = Расход.Договор;
								Движение.Период 	 = Расход.Дата + ?(ЗначениеЗаполнено(Расход.Договор), Расход.Договор.УстанавливаетСрокОплатыВДнях * 3600 * 24, 0);
								Движение.Комментарий = Расход.ОСтроке;
								Движение.Сумма 		 = Расход.Сумма * ?(Расход.Курс = 0, 1, Расход.Курс);
							КонецЕсли;
							
						КонецЕсли;
						
						Если ЗначениеЗаполнено(Расход.Сотрудник) Тогда
							Движение = Движения.Зарплата.Добавить();
							Движение.ВидДвижения = ВидДвиженияНакопленияПриход;
							Движение.Валюта      	= Расход.Валюта;
							Движение.ВидНачисления 	= Перечисления.ВидыНачислений.Другое;
							Движение.Комментарий 	= Расход.ОСтроке;
							Движение.ОписаниеНачисления = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Возмещение за расходы при выполнении работ для ") + " " + Клиент + Расход.Дата;
							Движение.Период 		= расход.Дата;
							Движение.Сотрудник 		= расход.Сотрудник;
							Движение.Сумма		 	= Расход.Сумма * ?(Расход.Курс = 0, 1, Расход.Курс);
							Движение.СуммаВВалюте 	= Расход.Сумма;
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Движения.ОплатаПоЗаказам.Записывать  = НЕ Отказ;
		Движения.ВаловаяПрибыль.Записывать   = НЕ Отказ;
		Движения.ЗаказыКлиентов.Записывать   = НЕ Отказ;
		Движения.РасчетыСОтсрочкой.Записывать= НЕ Отказ;
		Движения.Деньги.Записывать    = НЕ Отказ;
		Движения.Расчеты.Записывать   = НЕ Отказ;
		Движения.Продажи.Записывать   = НЕ Отказ;
		Движения.Товары.Записывать    = НЕ Отказ;
		Движения.Зарплата.Записывать  = НЕ Отказ;
		Движения.РасчетыСПоставщиками.Записывать   = НЕ Отказ;
		Движения.РасчетыСПоставщикамиСОтсрочкой.Записывать   = НЕ Отказ;	
	КонецЕсли;
	
КонецПроцедуры

Функция   обработатьдвижениядлянабора(НоменклатураТ, КоличествоВх, Сумма, ВестиУчетВаловойПрибыли, ЭтоКлиент, ЗначениеЗаполненоКлиентПоставщик, отказ, ПоведениеПрограммыПриРасходеТоваровНижеРекомендованногоМинимальногоОстатка, ПоведениеПрограммыПриРасходеТоваровБезОстатка, ОтменитьПроверкиНаОтказ, ДатаТ, склад) //для вложенных наборов
	
	общкво = Номенклатура.Состав.Итог("Количество");
	Если общкво = 0 Тогда
		общкво = 1;
	КонецЕсли;
	
	ВидДвиженияНакопленияРасход = ВидДвиженияНакопления.Расход;
	ВидДвиженияНакопленияПриход = ВидДвиженияНакопления.Приход;
	
	для каждого СтрокаСоставаНабора из НоменклатураТ.Состав цикл
		СуммаЭлемента = (Сумма / общкво) * СтрокаСоставаНабора.количество;
		НоменклатураСостава = СтрокаСоставаНабора.Номенклатура;
		
		Если НоменклатураСостава.ЭтоНабор = ИСТИНА Тогда
			отказ = обработатьдвижениядлянабора(НоменклатураСостава, КоличествоВх * СтрокаСоставаНабора.количество, СуммаЭлемента, ВестиУчетВаловойПрибыли, ЭтоКлиент, ЗначениеЗаполненоКлиентПоставщик, отказ, ПоведениеПрограммыПриРасходеТоваровНижеРекомендованногоМинимальногоОстатка, ПоведениеПрограммыПриРасходеТоваровБезОстатка, ОтменитьПроверкиНаОтказ, ДатаТ, Склад);
		иначе
			
			количество = СтрокаСоставаНабора.количество * КоличествоВх;
			
			ПредопределенныйТовар = ОбщийМодульПовтор.ТоварНеУчитываетсяПоКоличеству(НоменклатураСостава);
			
			Если не ОтменитьПроверкиНаОтказ
				И НЕ ПредопределенныйТовар Тогда
				
				Отказ = ОбщийМодульСервер.ПроверитьОстатокТоваров(ПоведениеПрограммыПриРасходеТоваровНижеРекомендованногоМинимальногоОстатка, ПоведениеПрограммыПриРасходеТоваровБезОстатка, Склад, НоменклатураСостава, Количество, ДатаТ, Истина, , Ссылка);
			КонецЕсли;
			
			если не отказ тогда
				
				СуммаТов = СуммаЭлемента;//ОбщийМодульСервер.ПоКурсу(СуммаЭлемента, Валюта, , ДатаТ);
				
				ЦенаСписания = ОбщийМодульСервер.ПолучитьЦенуСписания(НоменклатураСостава, Количество, ДатаТ);
				
				если не ПредопределенныйТовар тогда
					Движение = Движения.Товары.Добавить();
					
					Движение.Количество   = Количество;  						
					Движение.Номенклатура = НоменклатураСостава;
					Движение.ВидДвижения  = ВидДвиженияНакопленияРасход;
					Движение.Период 	  = ДатаТ;
					Движение.Склад 		  = Склад;		
					Движение.Комментарий  = Комментарий;
					Движение.Сумма = ЦенаСписания * Количество;
					Движение.СписаниеИлиОприходование = НЕ ЗначениеЗаполненоКлиентПоставщик;
				КонецЕсли;
				
				Если ВестиУчетВаловойПрибыли Тогда
					Если ЭтоКлиент Тогда //нормальная реализация
						
						Если ЦенаСписания = 0 
							или не (СуммаТов - (ЦенаСписания * Количество) = 0) Тогда
							
							Движение = Движения.ВаловаяПрибыль.Добавить();
							Движение.ВидДвижения = ВидДвиженияНакопленияПриход;
							
							Если ЦенаСписания = 0 
								или ПредопределенныйТовар
								или Количество = 0 Тогда
								
								Движение.Сумма 	= СуммаТов;
								Движение.ПроцентНаценки = 100;
								
							Иначе
								Движение.Сумма 	= СуммаТов - (ЦенаСписания * Количество);
								Цена 			= СуммаТов / Количество;
								//Движение.ПроцентНаценки = (Цена / (ЦенаСписания / 100)) - 100 ;
								ЦенаПоКурсу = Цена;//ОбщийМодульСервер.ПоКурсу(Цена, , Валюта, ДатаТ);
								Движение.ПроцентНаценки = (ЦенаПоКурсу / (ЦенаСписания / 100)) - 100 ;
								Движение.РентабельностьПродаж = (ЦенаСписания / ?(ЦенаПоКурсу = 0, 1, ЦенаПоКурсу)) * 100;
								
							КонецЕсли; 								
							
							Движение.Склад			= склад;
							Движение.Период 		= ДатаТ;
							Движение.Номенклатура 	= НоменклатураСостава;
							Движение.Комментарий 	= Комментарий;
						КонецЕсли;
						
					ИначеЕсли НЕ ЗначениеЗаполненоКлиентПоставщик Тогда //поставщик - возврат поставщику
						
						Движение = Движения.ВаловаяПрибыль.Добавить();
						Движение.ВидДвижения 	= ВидДвиженияНакопленияРасход;
						Движение.Сумма 			= СуммаТов;
						Движение.ПроцентНаценки = 100;
						Движение.Период 		= ДатаТ;
						Движение.Склад			= Склад;
						Движение.Номенклатура 	= НоменклатураСостава;
						Движение.Комментарий 	= Комментарий;
						
					КонецЕсли;
					
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;	
	
	Возврат Отказ;
	
КонецФункции

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Номенклатура") Тогда
		Номенклатура = ДанныеЗаполнения.Ссылка;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РасходыТовара") Тогда
		ВидЦен 		= ДанныеЗаполнения.ВидЦен;
		Договор 	= ДанныеЗаполнения.Договор;
		Клиент 		= ДанныеЗаполнения.КлиентПоставщик;
		Организация = ДанныеЗаполнения.Организация;
		Сотрудник 	= ДанныеЗаполнения.Сотрудник;
		ЗаказКлиента 	= ДанныеЗаполнения.Ссылка;
		ХранилищеДенег 	= ДанныеЗаполнения.ХранилищеДенег;
		ДатаОтправки 	= ДанныеЗаполнения.ДатаОтправки;
		СпособДоставки	= ДанныеЗаполнения.СпособДоставки; 
		
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Количество 		= ТекСтрокаТовары.Количество;
			НоваяСтрока.Номенклатура 	= ТекСтрокаТовары.Номенклатура;
			НоваяСтрока.ОСтроке 		= ТекСтрокаТовары.ОСтроке;
			НоваяСтрока.ПроцентСкидки 	= ТекСтрокаТовары.ПроцентСкидки;
			НоваяСтрока.Сумма 			= ТекСтрокаТовары.Сумма;
			НоваяСтрока.СуммаБезСкидки 	= ТекСтрокаТовары.СуммаБезСкидки;
			НоваяСтрока.Цена 			= ТекСтрокаТовары.Цена;
			НоваяСтрока.Дата 			= ДанныеЗаполнения.Дата;
			НоваяСтрока.СерияНоменклатуры 	= ТекСтрокаТовары.СерияНоменклатуры;
			НоваяСтрока.ЕдиницаИзмерения 	= ТекСтрокаТовары.ЕдиницаИзмерения;
			
			Если ЗначениеЗаполнено(ВидЦен) Тогда
				НоваяСтрока.Валюта = ВидЦен.ВалютаЦены;
			Иначе
				НоваяСтрока.Валюта = ПредопределенноеЗначение("Справочник.Валюты.ОсновнаяВалюта");
			КонецЕсли;
			НоваяСтрока.Курс = ОбщийМодульПовтор.ПолучитьТекущийКурс(НоваяСтрока.Валюта, НоваяСтрока.Дата);
			
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступленияТовара") Тогда
		ВидЦен 			= ДанныеЗаполнения.ВидЦен;
		Договор 		= ДанныеЗаполнения.Договор;
		ЗаказКлиента 	= ДанныеЗаполнения.ЗаказКлиента;
		Организация 	= ДанныеЗаполнения.Организация;
		Сотрудник 		= ДанныеЗаполнения.Сотрудник;
		ХранилищеДенег 	= ДанныеЗаполнения.ХранилищеДенег;
		
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Количество 		= ТекСтрокаТовары.Количество;
			НоваяСтрока.Номенклатура 	= ТекСтрокаТовары.Номенклатура;
			НоваяСтрока.ОСтроке 		= ТекСтрокаТовары.ОСтроке;
			НоваяСтрока.Сумма 			= ТекСтрокаТовары.Сумма;
			НоваяСтрока.Цена 			= ТекСтрокаТовары.Цена;
			НоваяСтрока.Дата 			= ДанныеЗаполнения.Дата;
			НоваяСтрока.СерияНоменклатуры 	= ТекСтрокаТовары.СерияНоменклатуры;
			НоваяСтрока.ЕдиницаИзмерения 	= ТекСтрокаТовары.ЕдиницаИзмерения;
			
			Если ЗначениеЗаполнено(ВидЦен) Тогда
				НоваяСтрока.Валюта = ВидЦен.ВалютаЦены;
			Иначе
				НоваяСтрока.Валюта = ПредопределенноеЗначение("Справочник.Валюты.ОсновнаяВалюта");
			КонецЕсли;
			НоваяСтрока.Курс = ОбщийМодульПовтор.ПолучитьТекущийКурс(НоваяСтрока.Валюта, НоваяСтрока.Дата);
			
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПеремещенияТовара") Тогда
		ВидЦен = ДанныеЗаполнения.ВидЦен;
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Количество 		= ТекСтрокаТовары.Количество;
			НоваяСтрока.Номенклатура 	= ТекСтрокаТовары.Номенклатура;
			НоваяСтрока.ОСтроке 		= ТекСтрокаТовары.ОСтроке;
			НоваяСтрока.Сумма 			= ТекСтрокаТовары.Сумма;
			НоваяСтрока.Цена 			= ТекСтрокаТовары.Цена;
			НоваяСтрока.Дата 			= ДанныеЗаполнения.ДатаПрибытия;
			НоваяСтрока.СерияНоменклатуры 	= ТекСтрокаТовары.СерияНоменклатуры;
			НоваяСтрока.ЕдиницаИзмерения 	= ТекСтрокаТовары.ЕдиницаИзмерения;
			
			Если ЗначениеЗаполнено(ВидЦен) Тогда
				НоваяСтрока.Валюта = ВидЦен.ВалютаЦены;
			Иначе
				НоваяСтрока.Валюта = ПредопределенноеЗначение("Справочник.Валюты.ОсновнаяВалюта");
			КонецЕсли;
			НоваяСтрока.Курс = ОбщийМодульПовтор.ПолучитьТекущийКурс(НоваяСтрока.Валюта, НоваяСтрока.Дата);
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
