// sza150626-0434
// sza150403-0258 

&НаКлиенте
Процедура ДобавитьСебя(Команда)
	ДобавитьСебяНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДобавитьСебяНаСервере()
	
	СтрокаПолучатели = Объект.ПолучателиСообщения.Добавить();
	СтрокаПолучатели.Получатель = ПараметрыСеанса.ТекущийПользователь;
	
КонецПроцедуры

&НаКлиенте
Процедура КодПрограммыПриИзменении(Элемент)
	
	ТекСтрока = Элементы.РеакцииНаСобытие.ТекущиеДанные;
	Если НЕ ТекСтрока = Неопределено Тогда
		ТекСтрока.РеакцияПрограмма = КодПрограммы;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	глЧислоОбъектов = глЧислоОбъектов + 1; глПроверятьСообщения = ИСТИНА;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("002800", ЭтаФорма, Отказ);
	
	Если НЕ Отказ Тогда
		Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьСобственныйПереводЭлементовИнтерфейса") Тогда
			ОбщийМодульСервер.ПеревестиРеквизитыФормы(ЭтаФорма);	
		КонецЕсли; 	
		
		Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
			Если ЗначениеЗаполнено(Параметры.ОбъектПодписки) Тогда
				СтрокаОбъекта = Объект.ОбъектыСобытия.Добавить();
				СтрокаОбъекта.ОбъектСобытия = Параметры.ОбъектПодписки;//СокрЛП(Параметры.ОбъектПодписки.Метаданные().Имя);
				СтрокаОбъекта.ОСтроке = "" + Параметры.ОбъектПодписки;
				
				Объект.Комментарий = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Для") + " " + СтрокаОбъекта.ОСтроке;
				
				СтрокаУсловия = Объект.УсловияСобытия.Добавить();
				СтрокаУсловия.ОбъектСобытия = СокрЛП(Параметры.ОбъектПодписки.Метаданные().Имя);//"" + ТипЗнч(Параметры.ОбъектПодписки);
				СтрокаУсловия.НаименованиеОбъектаСобытия = ОбщийМодульСервисСервер.ПолучитьКрасивоеНаименованиеОбъекта(ТипЗнч(Параметры.ОбъектПодписки));
				
				Объект.Наименование = Объект.Комментарий;
				
				ЭтаФорма.ТекущийЭлемент = Элементы.УсловияСобытияВидСобытия;
			КонецЕсли;
			
		КонецЕсли;
		
		Для Каждого СправочникМетаданных Из Метаданные.Справочники Цикл
			Элементы.УсловияСобытияНаименованиеОбъектаСобытия.СписокВыбора.Добавить(СправочникМетаданных.Имя, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке(СправочникМетаданных.Синоним));	
		КонецЦикла;
		Для Каждого ДокументМетаданных Из Метаданные.Документы Цикл
			Элементы.УсловияСобытияНаименованиеОбъектаСобытия.СписокВыбора.Добавить(ДокументМетаданных.Имя, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке(ДокументМетаданных.Синоним));	
		КонецЦикла;
		Элементы.УсловияСобытияНаименованиеОбъектаСобытия.СписокВыбора.СортироватьПоПредставлению();
	КонецЕсли;		
	
КонецПроцедуры

&НаКлиенте
Процедура РеакцииНаСобытиеПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("СписокПриАктивизацииСтрокиОповещение", 0.2, ИСТИНА);
КонецПроцедуры

&НаКлиенте
Процедура РеакцииНаСобытиеРеакцияПрограммаПриИзменении(Элемент)
	
	ТекСтрока = Элементы.РеакцииНаСобытие.ТекущиеДанные;
	Если НЕ ТекСтрока = Неопределено Тогда
		КодПрограммы = ТекСтрока.РеакцияПрограмма;
		Элементы.КодПрограммы.Доступность = ИСТИНА;
		Элементы.КодПрограммы.Видимость = (ТекСтрока.СпособРеакции = ПредопределенноеЗначение("Перечисление.СпособыРеакции.ВыполнитьПрограмму")) ИЛИ (ТекСтрока.СпособРеакции = ПредопределенноеЗначение("Перечисление.СпособыРеакции.ВыполнитьПрограммуСОбъектом"));
	Иначе
		Элементы.КодПрограммы.Видимость = ЛОЖЬ;
		КодПрограммы = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтрокиОповещение()	
	
	ТекСтрока = Элементы.РеакцииНаСобытие.ТекущиеДанные;
	Если НЕ ТекСтрока = Неопределено Тогда
		КодПрограммы = ТекСтрока.РеакцияПрограмма;
		Элементы.КодПрограммы.Доступность = ИСТИНА;
		Элементы.КодПрограммы.Видимость = (ТекСтрока.СпособРеакции = ПредопределенноеЗначение("Перечисление.СпособыРеакции.ВыполнитьПрограмму")) ИЛИ (ТекСтрока.СпособРеакции = ПредопределенноеЗначение("Перечисление.СпособыРеакции.ВыполнитьПрограммуСОбъектом"));
	Иначе
		Элементы.КодПрограммы.Видимость = ЛОЖЬ;
		КодПрограммы = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УсловияСобытияНаименованиеОбъектаСобытияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.УсловияСобытия.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.НаименованиеОбъектаСобытия) Тогда
		ТекущиеДанные.ОбъектСобытия = ТекущиеДанные.НаименованиеОбъектаСобытия;
	Иначе
		ТекущиеДанные.ОбъектСобытия = "";
	КонецЕсли;
	
КонецПроцедуры
