//sza131211-1459 SZA: 

Процедура СообщитьПользователю(Знач ТекстСообщенияПользователю,
	Знач ОбъектИлиСсылка = Неопределено,
	Знач Поле = "",
	Знач ПутьКДанным = "",
	Отказ = Ложь) Экспорт
	
	если ОбщийМодульПовторВТеченииСервера.ВыводитьСообщенияМожно() тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ТекстСообщенияПользователю;
		
		Если НЕ ПустаяСтрока(Поле) Тогда
			Сообщение.Поле = Поле;
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(ПутьКДанным) Тогда
			Сообщение.ПутьКДанным = ПутьКДанным;
		КонецЕсли;
		
		Если ОбъектИлиСсылка <> Неопределено Тогда
			Сообщение.УстановитьДанные(ОбъектИлиСсылка);
			#Если Сервер Тогда
				Если ОбъектИлиСсылка.Ссылка = ОбъектИлиСсылка Тогда
					Сообщение.КлючДанных = ОбъектИлиСсылка;
				КонецЕсли;
			#КонецЕсли
		КонецЕсли;
		
		Сообщение.Сообщить();	
	КонецЕсли;
	Отказ = Истина;
	
КонецПроцедуры
