//sza131211-1459 SZA: 

// Формирует и выводит сообщение об ошибке при заполнении реквизита Поле
// объекта ЭтотОбъект. Для использования в обработчиках проверки заполнения.
//
// Параметры
//  ТекстСообщенияПользователю  - Строка - текст сообщения.
//  ЭтотОбъект  - Ссылка или данные формы - объект, редактируемый в форме.
//  Поле  - Строка - идентификатор элемента формы.
//  Отказ  - Булево - возвращается значение Истина.
//
// Пример использования:
//   ОбщегоНазначения.СообщитьПользователю(
//	    НСтр("ru = 'Необходимо указать причину, по которой задача не выполнена.'"),
//	    Объект,
//	    "ОписаниеРезультата",
//	    Отказ);
//
Процедура СообщитьПользователю(Знач ТекстСообщенияПользователю,
								Знач ОбъектИлиСсылка = Неопределено,
								Знач Поле = "",
								Знач ПутьКДанным = "",
								Отказ = Ложь) Экспорт
								
								если ОбщийМодульПовторВТеченииСервера.ВыводитьСообщенияМожно() тогда
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщенияПользователю;
	
	Если НЕ ПустаяСтрока(Поле) Тогда
		Сообщение.Поле = Поле;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ПутьКДанным) Тогда
	Сообщение.ПутьКДанным = ПутьКДанным;
	КонецЕсли;
	
	Если ОбъектИлиСсылка <> Неопределено Тогда
		Сообщение.УстановитьДанные(ОбъектИлиСсылка);
#Если Сервер Тогда
		Если ОбъектИлиСсылка.Ссылка = ОбъектИлиСсылка Тогда
			Сообщение.КлючДанных = ОбъектИлиСсылка;
		КонецЕсли;
#КонецЕсли
	КонецЕсли;

	Сообщение.Сообщить();	
						 КонецЕсли;
	Отказ = Истина;

КонецПроцедуры
