//sza140304-2246 
//sza140114-0231 : 

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ДатаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	КурсыВалют.Очистить();
	Валюты = Справочники.Валюты.Выбрать() ;
	пока валюты.Следующий() Цикл
		
		СтрокаКурса = КурсыВалют.Добавить();
		СтрокаКурса.Валюта      = Валюты.Ссылка;
		СтрокаКурса.ТекущийКурс = ОбщийМодульСервер.ПолучитьТекущийКурс(валюты.Ссылка, дата);
		СтрокаКурса.НовыйКурс   = СтрокаКурса.ТекущийКурс;
		СтрокаКурса.Комментарий = "";
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	дата = ОбщийМодульСервисСервер.ПользователяТекущаяДата();
	ДатаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКурсы(Команда)
	
	УстановитьКурсыНаСервере();
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьКурсыНаСервере(НеИзменять = Ложь)
	
	для каждого строкакурса из КурсыВалют Цикл
		
		Если НеИзменять
			ИЛИ не строкакурса.ТекущийКурс = строкакурса.НовыйКурс Тогда
			
			Курс = РегистрыСведений.КурсыВалют.СоздатьМенеджерЗаписи();
			Курс.Активность = Истина;
			Курс.Валюта = строкакурса.валюта;
			Курс.Курс   = ?(НеИзменять, строкакурса.ТекущийКурс, строкакурса.НовыйКурс);
			курс.Период = дата;
			курс.Комментарий = строкакурса.Комментарий;
			
			Попытка 
				Курс.Записать(Истина);
				
			Исключение 
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ошибка при попытке записи курса:") + " " + ОписаниеОшибки();
				Сообщение.Сообщить();
			КонецПопытки; 
			
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КурсыНеИзменились(Команда)
	
	УстановитьКурсыНаСервере(Истина);
	Закрыть();
	
КонецПроцедуры
