//sza140612-1423 : 
//sza140205-0304 

&НаКлиенте
Процедура ПриобретениеТоваровУслуг(Команда)
	
	Если ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетПоПоставщикам", Истина) Тогда
		ВвестиЗначение(Поставщик, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите Поставщика товаров, услуг:"), тип("СправочникСсылка.Поставщики"));
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("КлиентПоставщик", Поставщик);
	ОткрытьФорму("Документ.ПоступленияТовара.Форма.ФормаДокумента", ПараметрыФормы);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	 ИспользоватьРегистрациюПриемаИВыдачиДенегПрямоВДокументахРасходаИПрихода = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ИспользоватьРегистрациюПриемаИВыдачиДенегПрямоВДокументахРасходаИПрихода");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(СтраницаПанели)Тогда
		
		попытка
			СтраницыПанели  = Элементы.ГруппаСтраниц.ПодчиненныеЭлементы;
			ТекущаяСтраница = СтраницыПанели.получить(СтраницаПанели);
			элементы.ГруппаСтраниц.ТекущаяСтраница = ТекущаяСтраница;
		Исключение
		конецпопытки;	
	КонецЕсли;
	
	ЗаполнитьРеквизиты();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРеквизиты()
	
	Если НЕ ЗначениеЗаполнено(склад) Тогда
		Склад = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("СкладПоУмолчанию");
		Если НЕ ЗначениеЗаполнено(Склад) Тогда
			Склад = ПредопределенноеЗначение("Справочник.Склады.ОсновнойСклад");
		КонецЕсли;		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Поставщик) Тогда
		Поставщик = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ПоставщикПоУмолчанию");
		Если НЕ ЗначениеЗаполнено(Поставщик) Тогда
			Поставщик = ПредопределенноеЗначение("Справочник.Поставщики.ФизическоеЛицо");
		КонецЕсли;		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Клиент) Тогда
		Клиент = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("КлиентПоУмолчанию");
		Если НЕ ЗначениеЗаполнено(Клиент) Тогда
			Клиент = ПредопределенноеЗначение("Справочник.Клиенты.ФизическоеЛицо");
		КонецЕсли;		
	КонецЕсли;
	
	Если не ИспользоватьРегистрациюПриемаИВыдачиДенегПрямоВДокументахРасходаИПрихода Тогда
		Элементы.ЗаказКлиентаСПредоплатой.Видимость = Ложь;
		Элементы.ЗаказПоставщикуСПредоплатой.Видимость = Ложь;
	КонецЕсли;
	
	Если ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ОтключитьПланированиеВДокументеВыполненияРабот") Тогда
		Элементы.ВыполненияРаботБезПлана.Видимость = Ложь;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВозвратТовараОтКлиентаПокупателя(Команда)
	
	Если ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетПоКлиентам", Истина) Тогда
		ВвестиЗначение(Клиент, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите Клиента, который возвращает товар:"), тип("СправочникСсылка.Клиенты"));
	КонецЕсли;
	
	ЭтаФорма.Закрыть();
	ПараметрыФормы = Новый Структура("КлиентПоставщик", Клиент);
	ОткрытьФорму("Документ.ПоступленияТовара.Форма.ФормаДокумента", ПараметрыФормы);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОприходованиеТовараНеОтПоставщика(Команда)
	
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("Документ.ПоступленияТовара.Форма.ФормаДокумента", ПараметрыФормы);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура РеализацияТоваровУслуг(Команда)
	
	Если ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетПоКлиентам", Истина) Тогда
		ВвестиЗначение(Клиент, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите Клиента (покупателя):"), тип("СправочникСсылка.Клиенты"));
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("КлиентПоставщик", Клиент);
	ОткрытьФорму("Документ.РасходыТовара.Форма.ФормаДокумента", ПараметрыФормы);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура РеализацияКлиентуЧастномуЛицу(Команда)
	
	ПараметрыФормы = Новый Структура("КлиентПоставщик", ПредопределенноеЗначение("Справочник.Клиенты.ФизическоеЛицо"));
	ОткрытьФорму("Документ.РасходыТовара.Форма.ФормаДокумента", ПараметрыФормы);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ВозвратТоваровПоставщику(Команда)
	
	Если ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетПоПоставщикам", Истина) Тогда
		ВвестиЗначение(Поставщик, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите Поставщика для возврата товара:"), тип("СправочникСсылка.Поставщики"));
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("КлиентПоставщик", Поставщик);
	ОткрытьФорму("Документ.РасходыТовара.Форма.ФормаДокумента", ПараметрыФормы);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура СписаниеТовара(Команда)
	
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("Документ.РасходыТовара.Форма.ФормаДокумента", ПараметрыФормы);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполненияРабот(Команда)
	
	Если ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетПоКлиентам", Истина) Тогда
		ВвестиЗначение(Клиент, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите Клиента:"), тип("СправочникСсылка.Клиенты"));
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("КлиентПоставщик", Клиент);
	ОткрытьФорму("Документ.ВыполненияРабот.Форма.ФормаДокумента", ПараметрыФормы);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПеремещениеТоваров(Команда)
	                                                                                
	Если ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетПоСкладам", Истина) Тогда
		ВвестиЗначение(Склад, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите Склад, откуда перемещается товар:"), тип("СправочникСсылка.Склады"));
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Склад", Склад);;
	ОткрытьФорму("Документ.ПеремещенияТовара.Форма.ФормаДокумента", ПараметрыФормы);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Инвентаризация(Команда)
	
	Если ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетПоСкладам", Истина) Тогда
		ВвестиЗначение(Склад, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите Склад инвентаризации:"), тип("СправочникСсылка.Склады"));
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Склад", Склад);;
	ОткрытьФорму("Документ.Инвентаризации.Форма.ФормаДокумента", ПараметрыФормы);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоступлениеОплатыОтКлиента(Команда)
	
	Если ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетПоКлиентам", Истина) Тогда
		ВвестиЗначение(Клиент, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите Клиента (плательщика):"), тип("СправочникСсылка.Клиенты"));
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("КлиентПоставщик", Клиент);
	ПараметрыФормы.Вставить("ЭтоРасход", Ложь);
	ОткрытьФорму("Документ.ДвиженияДенег.Форма.ФормаДокумента", ПараметрыФормы);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочееПоступлениеДенег(Команда)
	
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("Документ.ДвиженияДенег.Форма.ФормаДокумента", ПараметрыФормы);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатаПоставщику(Команда)
	
	Если ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетПоПоставщикам", Истина) Тогда
		ВвестиЗначение(Поставщик, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите Поставщика для оплаты:"), тип("СправочникСсылка.Поставщики"));
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("КлиентПоставщик", Поставщик);
	ПараметрыФормы.Вставить("ЭтоРасход", Истина);
	ОткрытьФорму("Документ.ДвиженияДенег.Форма.ФормаДокумента", ПараметрыФормы);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочееВыбытиеДенег(Команда)
	
	ПараметрыФормы = Новый Структура("ЭтоРасход", Истина);
	ОткрытьФорму("Документ.ДвиженияДенег.Форма.ФормаДокумента", ПараметрыФормы);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура НачислениеИВыдачаЗаработнойПлаты(Команда)
	
	ПараметрыФормы = Новый Структура("РасчетЗП", Истина);
	ОткрытьФорму("Документ.ДвиженияДенег.Форма.ФормаДокумента", ПараметрыФормы);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбменВалют(Команда)
	
	ПараметрыФормы = Новый Структура("ОбменВалют", Истина);
	ОткрытьФорму("Документ.ДвиженияДенег.Форма.ФормаДокумента", ПараметрыФормы);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановкаЦен(Команда)
	
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("Документ.УстановкиЦен.Форма.ФормаДокумента", ПараметрыФормы);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПланПродаж(Команда)
	
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("Документ.ПланыПродаж.Форма.ФормаДокумента", ПараметрыФормы);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаВводОстатков(Команда)
	
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("Документ.КорректировкиИРегистрацияОстатков.Форма.ФормаДокумента", ПараметрыФормы);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаВзаимозачетовДолгаКонтрагентов(Команда)
	
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("Документ.КорректировкиИРегистрацияОстатков.Форма.ФормаДокументаВзаимоЗачетаДолгаКонтрагентов", ПараметрыФормы);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказКлиента(Команда)
	
	Если ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетПоКлиентам", Истина) Тогда
		ВвестиЗначение(Клиент, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите Клиента (заказчика):"), тип("СправочникСсылка.Клиенты"));
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("КлиентПоставщик", Клиент);
	ОткрытьФорму("Документ.РасходыТовара.Форма.ФормаДокументаЗаказ", ПараметрыФормы);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказПоставщику(Команда)
	
	Если ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетПоПоставщикам", Истина) Тогда
		ВвестиЗначение(Поставщик, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите Поставщика для заказа:"), тип("СправочникСсылка.Поставщики"));
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("КлиентПоставщик", Поставщик);
	ОткрытьФорму("Документ.ПоступленияТовара.Форма.ФормаДокументаЗаказ", ПараметрыФормы);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполненияРаботБезПлана(Команда)
	
	Если ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетПоКлиентам", Истина) Тогда
		ВвестиЗначение(Клиент, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите Клиента:"), тип("СправочникСсылка.Клиенты"));
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("КлиентПоставщик", Клиент);
	ПараметрыФормы.Вставить("БезПлана", Истина);
	ОткрытьФорму("Документ.ВыполненияРабот.Форма.ФормаДокумента", ПараметрыФормы);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОказаниеУслугЗаВремя(Команда)
	
	Если ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетПоКлиентам", Истина) Тогда
		ВвестиЗначение(Клиент, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите Клиента:"), тип("СправочникСсылка.Клиенты"));
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Клиент", Клиент);
	ОткрытьФорму("Документ.ОказанияУслугЗаВремя.Форма.ФормаДокумента", ПараметрыФормы);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Номенклатура(Команда)
	
	ЭтаФорма.Закрыть();
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("Справочник.Номенклатура.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура НовыйКлиент(Команда)
	
	ЭтаФорма.Закрыть();
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("Справочник.Клиенты.ФормаОбъекта", ПараметрыФормы, неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура НовыйОбъектКлиента(Команда)
	
	ЭтаФорма.Закрыть();
	Если ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетПоКлиентам", Истина) Тогда
		ВвестиЗначение(Клиент, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите Клиента:"), тип("СправочникСсылка.Клиенты"));
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Клиент", Клиент);
	ОткрытьФорму("Справочник.ОбъектыКлиентов.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура НовыйПоставщик(Команда)
	
	ЭтаФорма.Закрыть();
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("Справочник.Поставщики.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура НовыйПроизводитель(Команда)
	
	ЭтаФорма.Закрыть();
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("Справочник.Производители.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура НовыйРегион(Команда)
	
	ЭтаФорма.Закрыть();
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("Справочник.Регионы.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСклад(Команда)
	
	ЭтаФорма.Закрыть();
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("Справочник.Склады.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьДоговор(Команда)
	
	ЭтаФорма.Закрыть();
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("Справочник.Договора.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИзображение(Команда)
	
	ЭтаФорма.Закрыть();
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("Справочник.Изображения.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСериюНоменклатуры(Команда)
	
	ЭтаФорма.Закрыть();
	ВвестиЗначение(Номенклатура, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите номенклатуру:"), тип("СправочникСсылка.Номенклатура"));
	
	ПараметрыФормы = Новый Структура("Номенклатура", Номенклатура);
	ОткрытьФорму("Справочник.СерииНоменклатуры.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСертификат(Команда)
	
	ЭтаФорма.Закрыть();
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("Справочник.СертификатыГигиеническиеЗаключения.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСредствоПредприятия(Команда)
	
	ЭтаФорма.Закрыть();
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("Справочник.СредстваПредприятия.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	ТекущаяСтраница = Элементы.ГруппаСтраниц.ТекущаяСтраница;
	СтраницыПанели  = Элементы.ГруппаСтраниц.ПодчиненныеЭлементы;
	СтраницаПанели  = СтраницыПанели.Индекс(ТекущаяСтраница);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСпецификацию(Команда)
	
	ЭтаФорма.Закрыть();
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("Справочник.Спецификации.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура КомплектацияПоСпецификациям(Команда)
	
	ВвестиЗначение(Спецификация, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите спецификацию:"), тип("СправочникСсылка.Спецификации"));
	
	ПараметрыФормы = Новый Структура("Спецификация", Спецификация);
	ОткрытьФорму("Документ.Комплектация.Форма.ФормаДокумента", ПараметрыФормы);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПозициюОказанияУслугЗаВремя(Команда)
	
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("Справочник.ПозицииДляОказанияУслугЗаВремяНомера.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьГруппуАналогов(Команда)
	
	ЭтаФорма.Закрыть();
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("Справочник.ГруппыАналогов.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСотрудника(Команда)
	
	ЭтаФорма.Закрыть();
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("Справочник.Сотрудники.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПодразделение(Команда)
	
	ЭтаФорма.Закрыть();
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("Справочник.Подразделения.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ПланДоходовИРасходов(Команда)
	
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("Документ.ПланыДоходовИРасходовДенег.Форма.ФормаДокумента", ПараметрыФормы);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетКомиссионера(Команда)
	
	Если ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетПоКлиентам", Истина) Тогда
		ВвестиЗначение(Клиент, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите Комиссионера") + ":", тип("СправочникСсылка.Клиенты"));
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Комиссионер", Клиент);
	ОткрытьФорму("Документ.ОтчетКомиссионера.Форма.ФормаДокумента", ПараметрыФормы);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры
