//sza150114-1728
//sza141007-0205 бп
//sza140711-0020  локац
//sza140612-1423 : 
//sza140205-0304 
&НаКлиенте
Процедура ВозвратТовараОтКлиентаПокупателя(Команда)
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетПоКлиентам", ИСТИНА) Тогда
		ВвестиЗначение(Клиент, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите Клиента, который возвращает товар") + ": ", тип("СправочникСсылка.Клиенты"));
	КонецЕсли;
	
	ЭтаФорма.Закрыть();
	ПараметрыФормы = Новый Структура("КлиентПоставщик", Клиент);
	ОткрытьФорму("Документ.ПоступленияТовара.Форма.ФормаДокумента", ПараметрыФормы);	
	
КонецПроцедуры

&НаКлиенте
Процедура ВозвратТоваровПоставщику(Команда)
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетПоПоставщикам", ИСТИНА) Тогда
		ВвестиЗначение(Поставщик, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите Поставщика для возврата товара") + ": ", тип("СправочникСсылка.Поставщики"));
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("КлиентПоставщик", Поставщик);
	ОткрытьФорму("Документ.РасходыТовара.Форма.ФормаДокумента", ПараметрыФормы);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполненияРабот(Команда)
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетПоКлиентам", ИСТИНА) Тогда
		ВвестиЗначение(Клиент, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите Клиента") + ": ", тип("СправочникСсылка.Клиенты"));
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("КлиентПоставщик", Клиент);
	ОткрытьФорму("Документ.ВыполненияРабот.Форма.ФормаДокумента", ПараметрыФормы);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполненияРаботБезПлана(Команда)
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетПоКлиентам", ИСТИНА) Тогда
		ВвестиЗначение(Клиент, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите Клиента") + ": ", тип("СправочникСсылка.Клиенты"));
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("КлиентПоставщик", Клиент);
	ПараметрыФормы.Вставить("БезПлана", ИСТИНА);
	ОткрытьФорму("Документ.ВыполненияРабот.Форма.ФормаДокумента", ПараметрыФормы);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьГруппуАналогов(Команда)
	
	ЭтаФорма.Закрыть();
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("Справочник.ГруппыАналогов.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьДоговор(Команда)
	
	ЭтаФорма.Закрыть();
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("Справочник.Договора.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИзображение(Команда)
	
	ЭтаФорма.Закрыть();
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("Справочник.Изображения.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПодразделение(Команда)
	
	ЭтаФорма.Закрыть();
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("Справочник.Подразделения.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПозициюОказанияУслугЗаВремя(Команда)
	
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("Справочник.ПозицииДляОказанияУслугЗаВремяНомера.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСериюНоменклатуры(Команда)
	
	ЭтаФорма.Закрыть();
	ВвестиЗначение(Номенклатура, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите номенклатуру") + ": ", тип("СправочникСсылка.Номенклатура"));
	
	ПараметрыФормы = Новый Структура("Номенклатура", Номенклатура);
	ОткрытьФорму("Справочник.СерииНоменклатуры.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСертификат(Команда)
	
	ЭтаФорма.Закрыть();
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("Справочник.СертификатыГигиеническиеЗаключения.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСклад(Команда)
	
	ЭтаФорма.Закрыть();
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("Справочник.Склады.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСотрудника(Команда)
	
	ЭтаФорма.Закрыть();
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("Справочник.Сотрудники.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСпецификацию(Команда)
	
	ЭтаФорма.Закрыть();
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("Справочник.Спецификации.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСредствоПредприятия(Команда)
	
	ЭтаФорма.Закрыть();
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("Справочник.СредстваПредприятия.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказКлиента(Команда)
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетПоКлиентам", ИСТИНА) Тогда
		ВвестиЗначение(Клиент, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите Клиента (заказчика)") + ": ", тип("СправочникСсылка.Клиенты"));
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("КлиентПоставщик", Клиент);
	ИмяНеобходимойФормы = "Документ.РасходыТовара.Форма.ФормаДокументаЗаказ";
	ОткрытьФорму(ИмяНеобходимойФормы, ПараметрыФормы);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказПоставщику(Команда)
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетПоПоставщикам", ИСТИНА) Тогда
		ВвестиЗначение(Поставщик, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите Поставщика для заказа") + ": ", тип("СправочникСсылка.Поставщики"));
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("КлиентПоставщик", Поставщик);
	ИмяНеобходимойФормы = "Документ.ПоступленияТовара.Форма.ФормаДокументаЗаказ";
	ОткрытьФорму(ИмяНеобходимойФормы, ПараметрыФормы);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРеквизиты()
	
	Если НЕ ЗначениеЗаполнено(склад) Тогда
		Склад = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("СкладПоУмолчанию");
		Если НЕ ЗначениеЗаполнено(Склад) Тогда
			Склад = ПредопределенноеЗначение("Справочник.Склады.ОсновнойСклад");
		КонецЕсли;		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Поставщик) Тогда
		Поставщик = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ПоставщикПоУмолчанию");
		Если НЕ ЗначениеЗаполнено(Поставщик) Тогда
			Поставщик = ПредопределенноеЗначение("Справочник.Поставщики.ФизическоеЛицо");
		КонецЕсли;		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Клиент) Тогда
		Клиент = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("КлиентПоУмолчанию");
		Если НЕ ЗначениеЗаполнено(Клиент) Тогда
			Клиент = ПредопределенноеЗначение("Справочник.Клиенты.ФизическоеЛицо");
		КонецЕсли;		
	КонецЕсли;
	
	Если НЕ ИспользоватьРегистрациюПриемаИВыдачиДенегПрямоВДокументахРасходаИПрихода Тогда
		Элементы.ЗаказКлиентаСПредоплатой.Видимость = ЛОЖЬ;
		Элементы.ЗаказПоставщикуСПредоплатой.Видимость = ЛОЖЬ;
	КонецЕсли;
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ОтключитьПланированиеВДокументеВыполненияРабот") Тогда
		Элементы.ВыполненияРаботБезПлана.Видимость = ЛОЖЬ;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура Инвентаризация(Команда)
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетПоСкладам", ИСТИНА) Тогда
		ВвестиЗначение(Склад, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите Склад инвентаризации") + ": ", тип("СправочникСсылка.Склады"));
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Склад", Склад);;
	ОткрытьФорму("Документ.Инвентаризации.Форма.ФормаДокумента", ПараметрыФормы);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура КомплектацияПоСпецификациям(Команда)
	
	ВвестиЗначение(Спецификация, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите спецификацию") + ": ", тип("СправочникСсылка.Спецификации"));
	
	ПараметрыФормы = Новый Структура("Спецификация", Спецификация);
	ИмяНеобходимойФормы = "Документ.Комплектация.Форма.ФормаДокумента";
	ОткрытьФорму(ИмяНеобходимойФормы, ПараметрыФормы);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаВводОстатков(Команда)
	
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("Документ.КорректировкиИРегистрацияОстатков.Форма.ФормаДокумента", ПараметрыФормы);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаВзаимозачетовДолгаКонтрагентов(Команда)
	
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("Документ.КорректировкиИРегистрацияОстатков.Форма.ФормаДокументаВзаимоЗачетаДолгаКонтрагентов", ПараметрыФормы);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура НачислениеИВыдачаЗаработнойПлаты(Команда)
	
	ПараметрыФормы = Новый Структура("РасчетЗП", ИСТИНА);
	ОткрытьФорму("Документ.ДвиженияДенег.Форма.ФормаДокумента", ПараметрыФормы);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура НовыйКлиент(Команда)
	
	ЭтаФорма.Закрыть();
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("Справочник.Клиенты.ФормаОбъекта", ПараметрыФормы, неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура НовыйОбъектКлиента(Команда)
	
	ЭтаФорма.Закрыть();
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетПоКлиентам", ИСТИНА) Тогда
		ВвестиЗначение(Клиент, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите Клиента") + ": ", тип("СправочникСсылка.Клиенты"));
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Клиент", Клиент);
	ОткрытьФорму("Справочник.ОбъектыКлиентов.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура НовыйПоставщик(Команда)
	
	ЭтаФорма.Закрыть();
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("Справочник.Поставщики.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура НовыйПроизводитель(Команда)
	
	ЭтаФорма.Закрыть();
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("Справочник.Производители.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура НовыйРегион(Команда)
	
	ЭтаФорма.Закрыть();
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("Справочник.Регионы.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура Номенклатура(Команда)
	
	ЭтаФорма.Закрыть();
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("Справочник.Номенклатура.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбменВалют(Команда)
	
	ПараметрыФормы = Новый Структура("ОбменВалют", ИСТИНА);
	ОткрытьФорму("Документ.ДвиженияДенег.Форма.ФормаДокумента", ПараметрыФормы);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОказаниеУслугЗаВремя(Команда)
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетПоКлиентам", ИСТИНА) Тогда
		ВвестиЗначение(Клиент, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите Клиента") + ": ", тип("СправочникСсылка.Клиенты"));
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Клиент", Клиент);
	ОткрытьФорму("Документ.ОказанияУслугЗаВремя.Форма.ФормаДокумента", ПараметрыФормы);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатаПоставщику(Команда)
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетПоПоставщикам", ИСТИНА) Тогда
		ВвестиЗначение(Поставщик, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите Поставщика для оплаты") + ": ", тип("СправочникСсылка.Поставщики"));
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("КлиентПоставщик", Поставщик);
	ПараметрыФормы.Вставить("ЭтоРасход", ИСТИНА);
	ОткрытьФорму("Документ.ДвиженияДенег.Форма.ФормаДокумента", ПараметрыФормы);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОприходованиеТовараНеОтПоставщика(Команда)
	
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("Документ.ПоступленияТовара.Форма.ФормаДокумента", ПараметрыФормы);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетКомиссионера(Команда)
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетПоКлиентам", ИСТИНА) Тогда
		ВвестиЗначение(Клиент, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите Комиссионера") + ":", тип("СправочникСсылка.Клиенты"));
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Комиссионер", Клиент);
	ИмяНеобходимойФормы = "Документ.ОтчетКомиссионера.Форма.ФормаДокумента";
	ОткрытьФорму(ИмяНеобходимойФормы, ПараметрыФормы);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	ТекущаяСтраница = Элементы.ГруппаСтраниц.ТекущаяСтраница;
	СтраницыПанели  = Элементы.ГруппаСтраниц.ПодчиненныеЭлементы;
	СтраницаПанели  = СтраницыПанели.Индекс(ТекущаяСтраница);
	
КонецПроцедуры

&НаКлиенте
Процедура ПеремещениеТоваров(Команда)
	                                                                                
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетПоСкладам", ИСТИНА) Тогда
		ВвестиЗначение(Склад, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите Склад, откуда перемещается товар") + ": ", тип("СправочникСсылка.Склады"));
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Склад", Склад);;
	ОткрытьФорму("Документ.ПеремещенияТовара.Форма.ФормаДокумента", ПараметрыФормы);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПланДоходовИРасходов(Команда)
	
	ПараметрыФормы = Новый Структура;
	ИмяНеобходимойФормы = "Документ.ПланыДоходовИРасходовДенег.Форма.ФормаДокумента";
	ОткрытьФорму(ИмяНеобходимойФормы, ПараметрыФормы);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПланПродаж(Команда)
	
	ПараметрыФормы = Новый Структура;
	ИмяНеобходимойФормы = "Документ.ПланыПродаж.Форма.ФормаДокумента";
	ОткрытьФорму(ИмяНеобходимойФормы, ПараметрыФормы);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоступлениеОплатыОтКлиента(Команда)
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетПоКлиентам", ИСТИНА) Тогда
		ВвестиЗначение(Клиент, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите Клиента (плательщика)") + ": ", тип("СправочникСсылка.Клиенты"));
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("КлиентПоставщик", Клиент);
	ПараметрыФормы.Вставить("ЭтоРасход", ЛОЖЬ);
	ОткрытьФорму("Документ.ДвиженияДенег.Форма.ФормаДокумента", ПараметрыФормы);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриобретениеТоваровУслуг(Команда)
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетПоПоставщикам", ИСТИНА) Тогда
		ВвестиЗначение(Поставщик, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите Поставщика товаров, услуг") + ": ", тип("СправочникСсылка.Поставщики"));
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("КлиентПоставщик", Поставщик);
	ОткрытьФорму("Документ.ПоступленияТовара.Форма.ФормаДокумента", ПараметрыФормы);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(СтраницаПанели)Тогда
		
		попытка
			СтраницыПанели  = Элементы.ГруппаСтраниц.ПодчиненныеЭлементы;
			ТекущаяСтраница = СтраницыПанели.получить(СтраницаПанели);
			Элементы.ГруппаСтраниц.ТекущаяСтраница = ТекущаяСтраница;
		Исключение
		конецпопытки;	
	КонецЕсли;
	
	ЗаполнитьРеквизиты();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИспользоватьРегистрациюПриемаИВыдачиДенегПрямоВДокументахРасходаИПрихода = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьРегистрациюПриемаИВыдачиДенегПрямоВДокументахРасходаИПрихода");
	ИспользоватьРегионыДляУчетаСтранАЛокацииГородов = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьРегионыДляУчетаСтранАЛокацииГородов");
	
		Если ИспользоватьРегионыДляУчетаСтранАЛокацииГородов Тогда
			Элементы.НовыйРегион.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Добавить Страну");
			Элементы.НоваяЛокация.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Добавить Город");
		КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочееВыбытиеДенег(Команда)
	
	ПараметрыФормы = Новый Структура("ЭтоРасход", ИСТИНА);
	ОткрытьФорму("Документ.ДвиженияДенег.Форма.ФормаДокумента", ПараметрыФормы);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочееПоступлениеДенег(Команда)
	
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("Документ.ДвиженияДенег.Форма.ФормаДокумента", ПараметрыФормы);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура РеализацияКлиентуЧастномуЛицу(Команда)
	
	ПараметрыФормы = Новый Структура("КлиентПоставщик", ПредопределенноеЗначение("Справочник.Клиенты.ФизическоеЛицо"));
	ОткрытьФорму("Документ.РасходыТовара.Форма.ФормаДокумента", ПараметрыФормы);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура РеализацияТоваровУслуг(Команда)
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетПоКлиентам", ИСТИНА) Тогда
		ВвестиЗначение(Клиент, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите Клиента (покупателя)") + ": ", тип("СправочникСсылка.Клиенты"));
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("КлиентПоставщик", Клиент);
	ОткрытьФорму("Документ.РасходыТовара.Форма.ФормаДокумента", ПараметрыФормы);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура РеестрДвиженияДенег(Команда)
	
	ПараметрыФормыРеестра = Новый Структура;
	ОткрытьФорму("Документ.ДвиженияДенег.Форма.РеестрДвиженияДенег", ПараметрыФормыРеестра);
	
КонецПроцедуры

&НаКлиенте
Процедура СписаниеТовара(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДляСписания", ИСТИНА);
	ОткрытьФорму("Документ.РасходыТовара.Форма.ФормаДокумента", ПараметрыФормы);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановкаЦен(Команда)
	
	ПараметрыФормы = Новый Структура;
	ОткрытьФорму("Документ.УстановкиЦен.Форма.ФормаДокумента", ПараметрыФормы);
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура НоваяЛокация(Команда)
	
	Регион = ПредопределенноеЗначение("Справочник.Регионы.НашРегион");
	
	ВвестиЗначение(Регион, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите") + " " + ?(ИспользоватьРегионыДляУчетаСтранАЛокацииГородов, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Страну"), ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Регион")), тип("СправочникСсылка.Регионы"));
	ЭтаФорма.Закрыть();
	ПараметрыФормы = Новый Структура("Регион", Регион);
	ОткрытьФорму("Справочник.Локации.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура НовыйКлиентВыбратьТоварЗаказ(Команда)
	
	НовыйКонтрагент = ОбщийМодульСервер.СоздатьНовыйИлиНайтиЭлементДокумент(ИСТИНА, "Клиенты", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Новый Клиент"));
	ПараметрыФормы = Новый Структура("Ключ", НовыйКонтрагент);
	ФормаКонтрагента = ПолучитьФорму("Справочник.Клиенты.ФормаОбъекта", ПараметрыФормы, НовыйКонтрагент);
	ФормаКонтрагента.ОткрытьМодально();	
	
	Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
	Если ВвестиЗначение(Номенклатура, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите Товар или Услугу")) 
		И ЗначениеЗаполнено(Номенклатура) Тогда		
		
		Количество = 1;
		
		Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("КоличествоНоменклатурыМожетБытьДробным") Тогда
			РезультатНеОтменен = ВвестиЧисло(Количество, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Количество"), 15, ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ЧислоЗнаковПослеЗапятойДляКоличества"));
		Иначе
			РезультатНеОтменен = ВвестиЧисло(Количество, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Количество"), 12);
		КонецЕсли;		
		
		Если РезультатНеОтменен Тогда
			ПараметрыФормы = Новый Структура("КлиентПоставщик", НовыйКонтрагент);
			ПараметрыФормы.Вставить("Номенклатура", Номенклатура);
			ПараметрыФормы.Вставить("Количество", Количество);		
			ИмяНеобходимойФормы = "Документ.РасходыТовара.Форма.ФормаДокументаЗаказ";
			ФормаДокумента = ПолучитьФорму(ИмяФормы, ПараметрыФормы);
			ФормаДокумента.Открыть();	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НовыйКлиентВыбратьТоварПродажа(Команда)
	
	НовыйКонтрагент = ОбщийМодульСервер.СоздатьНовыйИлиНайтиЭлементДокумент(ИСТИНА, "Клиенты", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Новый Клиент"));
	ПараметрыФормы = Новый Структура("Ключ", НовыйКонтрагент);
	ФормаКонтрагента = ПолучитьФорму("Справочник.Клиенты.ФормаОбъекта", ПараметрыФормы, НовыйКонтрагент);
	ФормаКонтрагента.ОткрытьМодально();	
	
	Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
	Если ВвестиЗначение(Номенклатура, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите Товар или Услугу")) 
		И ЗначениеЗаполнено(Номенклатура) Тогда		
		
		Количество = 1;
		
		Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("КоличествоНоменклатурыМожетБытьДробным") Тогда
			РезультатНеОтменен = ВвестиЧисло(Количество, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Количество"), 15, ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ЧислоЗнаковПослеЗапятойДляКоличества"));
		Иначе
			РезультатНеОтменен = ВвестиЧисло(Количество, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Количество"), 12);
		КонецЕсли;		
		
		Если РезультатНеОтменен Тогда
			ПараметрыФормы = Новый Структура("КлиентПоставщик", НовыйКонтрагент);
			ПараметрыФормы.Вставить("Номенклатура", Номенклатура);
			ПараметрыФормы.Вставить("Количество", Количество);		
			ФормаДокумента = ПолучитьФорму("Документ.РасходыТовара.Форма.ФормаДокумента", ПараметрыФормы);
			ФормаДокумента.Открыть();	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
