// sza150417-2106 
// sza150126-1433
// sza140927-1626 кг
// sza140726-1935 ошибка кнопок предвыбора
// sza140523-0242  
// sza140403-0112  
&НаКлиенте
Процедура ВесПриИзменении(Элемент)
	ВесПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВесПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Владелец.Вес)
		И ЗначениеЗаполнено(Объект.Вес)
		И НЕ Объект.Вес = Объект.Владелец.Вес * Объект.Количество Тогда
		
		Сообщить(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Вес номенклатуры рассчитан неверно") + ": " + СокрЛП(Объект.Владелец.Вес));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительнаяИнформацияВидИнформацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыФормы = Новый Структура("ТипВладельца", ДопИнфоТипВладельца);
	ФормаВыбораВидаИнформации = ПолучитьФорму("Справочник.ДополнительныеРеквизиты.ФормаВыбора", ПараметрыФормы, ЭтаФорма);	
	ВидИнформации = ФормаВыбораВидаИнформации.ОткрытьМодально();
	Если ЗначениеЗаполнено(ВидИнформации) Тогда
		Элементы.ДополнительнаяИнформация.ТекущиеДанные.ВидИнформации = ВидИнформации;
		Элементы.ДополнительнаяИнформация.ТекущиеДанные.Информация = ОбщийМодульКлиент.ПолучитьЗначениеПоУмолчаниюПоляДополнительнойИнформации(ВидИнформации);
		СтандартнаяОбработка = ЛОЖЬ;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительнаяИнформацияПриИзменении(Элемент)
	ДопИнформацияИзменена = ИСТИНА;
КонецПроцедуры

&НаКлиенте
Процедура Количество01(Команда)
	
	Объект.Количество = 0.1;
	КоличествоПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Количество10(Команда)
	
	Объект.Количество = 10;
	КоличествоПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Количество100(Команда)
	
	Объект.Количество = 100;
	КоличествоПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура Количество1000(Команда)
	
	Объект.Количество = 1000;
	КоличествоПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КоличествоОчистка(Элемент, СтандартнаяОбработка)
	Объект.Количество = 1;
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	КоличествоПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КоличествоПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Владелец) Тогда
		Если ОбратныйРасчет = 0 Тогда
			ОБъект.Количество = 0;
		Иначе
			ОБъект.Количество = 1 / ОбратныйРасчет;
		КонецЕсли;
		
		Объект.Вес = Объект.Владелец.Вес * Объект.Количество;
		Если НЕ ЗначениеЗаполнено(Объект.Длина) Тогда
			Объект.Длина = Объект.Владелец.Длина * Объект.Количество;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Литр(Команда)
	
	ПредставлениеНаименования = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("л.");
	Объект.Наименование = ПредставлениеНаименования;
	НаименованиеИзменяли = ИСТИНА;
	Объект.Комментарий = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Литр");
	Объект.КодЕдиницыПоКлассификатору = "0138";
	
КонецПроцедуры

&НаКлиенте
Процедура Метр(Команда)
	
	ПредставлениеНаименования = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("м.");
	Объект.Наименование = ПредставлениеНаименования;
	НаименованиеИзменяли = ИСТИНА;
	Объект.Комментарий = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Метр");
	Объект.КодЕдиницыПоКлассификатору = "0101";
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованияНаДругихЯзыкахНаЯзыкеПриИзменении(Элемент)
	БылиИзмененияЗначенияПолейНаЯзыках = ИСТИНА;
КонецПроцедуры

&НаКлиенте
Процедура НаименованияНаДругихЯзыкахПриИзменении(Элемент)
	БылиИзмененияЗначенияПолейНаЯзыках = ИСТИНА;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Элементы.Цены.Видимость = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьСложныйМеханизмЦен") И ЗначениеЗаполнено(Объект.Ссылка);
	Цены.Параметры.УстановитьЗначениеПараметра("ЕдиницаИзмерения", Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеНаДругихЯзыках(Команда)
	Элементы.НаименованияНаДругихЯзыках.Видимость  = НЕ Элементы.НаименованияНаДругихЯзыках.Видимость;
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеНаименованияПриИзменении(Элемент)
	
	Объект.Наименование = ПредставлениеНаименования;
	НаименованиеИзменяли = ИСТИНА;
	
	Если ПереводитьНаименованияАвтоматически Тогда
		ОбщийМодульКлиент.ПеревестиНаименованияАвтоматически(ПредставлениеНаименования, НаименованияНаДругихЯзыках);
		БылиИзмененияЗначенияПолейНаЯзыках = ИСТИНА;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1, Объект.Ссылка, ИСТИНА);
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ПоддержкаДругихЯзыков тогда
		Если НаименованиеИзменяли тогда
			ОбщийМодульСервер.обновитьЗначениеНаЯзыке(Объект.Ссылка, ПредставлениеНаименования);
		КонецЕсли;
		
		Если БылиИзмененияЗначенияПолейНаЯзыках Тогда
			Для Каждого СтрокаЯзыка Из НаименованияНаДругихЯзыках Цикл
				ОбщийМодульСервер.обновитьЗначениеНаЯзыке(Объект.Ссылка, СтрокаЯзыка.НаЯзыке, "Наименование", СтрокаЯзыка.Язык);	
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0, Объект.Ссылка, ИСТИНА);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("000300", ЭтаФорма, Отказ, Объект);
	
	Если НЕ Отказ Тогда
		Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьСобственныйПереводЭлементовИнтерфейса") Тогда
			ОбщийМодульСервер.ПеревестиРеквизитыФормы(ЭтаФорма);	
		КонецЕсли;
		
		ОбъектСсылка = Объект.Ссылка;
		
		ДопИнфоТипВладельца = ОбщийМодульПовтор.ПолучитьТипВладельца(ОбъектСсылка); 	
		ОбщийМодульСервисСервер.ЗаполнитьДополнительнуюИнформацию(ОбъектСсылка, ДополнительнаяИнформация, ДопИнфоТипВладельца);
		
		ПоддержкаДругихЯзыков = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ПоддерживатьИныеЯзыкиКромеРусского") 
		И ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ПоддерживатьНаименованияНаДругихЯзыкахКромеРусского", ИСТИНА);
		
		Если НЕ ЗначениеЗаполнено(Объект.Владелец)
			И ЗначениеЗаполнено(Параметры.Номенклатура) Тогда
			
			Объект.Владелец = Параметры.Номенклатура;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ОбъектСсылка) Тогда
			Объект.Количество = 1;
			
			Если НЕ ЗначениеЗаполнено(Объект.Владелец) Тогда
				Элементы.Владелец.ТолькоПросмотр = ЛОЖЬ;
				Элементы.Владелец.Доступность 	 = ИСТИНА;
			КонецЕсли;
			
		Иначе
			Элементы.ГруппаКнопокКоличества.Видимость  = ЛОЖЬ;
			Элементы.ТиповыеЕдиницыИзмерения.Видимость = ЛОЖЬ;
			
			Если ПоддержкаДругихЯзыков тогда
				
				ПредставлениеНаименования = ОбщийМодульПовтор.получитьПредставлениеНаЯзыке(объектСсылка);
				
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ ЗначенияНаДругихЯзыках.Язык,
				|	ЗначенияНаДругихЯзыках.НаЯзыке,
				|	ЗначенияНаДругихЯзыках.Поле
				|ИЗ РегистрСведений.ЗначенияНаДругихЯзыках КАК ЗначенияНаДругихЯзыках
				|ГДЕ ЗначенияНаДругихЯзыках.ОбъектБазыДанных = &ОбъектБазыДанных";
				
				Запрос.УстановитьПараметр("ОбъектБазыДанных", ОбъектСсылка);
				
				РезультатЗапроса = Запрос.Выполнить();
				Если НЕ РезультатЗапроса.Пустой() Тогда
					ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
					
					Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
						Если ВыборкаДетальныеЗаписи.Поле = "Наименование" Тогда
							СтрокаЯзыка = НаименованияНаДругихЯзыках.Добавить();
							СтрокаЯзыка.Язык 	= ВыборкаДетальныеЗаписи.Язык;
							СтрокаЯзыка.НаЯзыке = ВыборкаДетальныеЗаписи.НаЯзыке;	
						КонецЕсли;
					КонецЦикла;
					
				КонецЕсли;
				
			Иначе
				ПредставлениеНаименования = Объект.Наименование;				
			КонецЕсли;		
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	ВыполненияРаботТовары.Ссылка,
			|	ПеремещенияТовараТовары.Ссылка КАК Ссылка1,
			|	ПоступленияТовараТовары.Ссылка КАК Ссылка2,
			|	РасходыТовараТовары.Ссылка КАК Ссылка3
			|ИЗ
			|	Документ.ВыполненияРабот.Товары КАК ВыполненияРаботТовары,
			|	Документ.ПеремещенияТовара.Товары КАК ПеремещенияТовараТовары,
			|	Документ.ПоступленияТовара.Товары КАК ПоступленияТовараТовары,
			|	Документ.РасходыТовара.Товары КАК РасходыТовараТовары
			|ГДЕ
			|	ВыполненияРаботТовары.ЕдиницаИзмерения = &ЕдиницаИзмерения
			|	И ПеремещенияТовараТовары.ЕдиницаИзмерения = &ЕдиницаИзмерения
			|	И ПоступленияТовараТовары.ЕдиницаИзмерения = &ЕдиницаИзмерения
			|	И РасходыТовараТовары.ЕдиницаИзмерения = &ЕдиницаИзмерения
			|	И ПоступленияТовараТовары.Ссылка.Проведен = ИСТИНА
			|	И ПеремещенияТовараТовары.Ссылка.Проведен = ИСТИНА
			|	И ВыполненияРаботТовары.Ссылка.Проведен = ИСТИНА
			|	И РасходыТовараТовары.Ссылка.Проведен = ИСТИНА";
			
			Запрос.УстановитьПараметр("ЕдиницаИзмерения", ОбъектСсылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			Если НЕ РезультатЗапроса.Пустой() Тогда
				Элементы.Количество.ТолькоПросмотр = ИСТИНА;
			КонецЕсли;		
			
			Если ОБъект.Количество = 0 Тогда
				ОбратныйРасчет = 0;
			Иначе
				ОбратныйРасчет = 1 / ОБъект.Количество;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.Владелец) Тогда
			НаименованиеЕдиницыВладельца = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке(Объект.Владелец.ОсновнаяЕдиницаИзмерения);
			Элементы.ВОднойОсновноеЕдинице.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("в одной") + " " + НаименованиеЕдиницыВладельца;
			Элементы.НаименованиеЕдиницыВладельца.Заголовок = НаименованиеЕдиницыВладельца;
		КонецЕсли;		
		
		Элементы.Цены.Видимость = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьСложныйМеханизмЦен") И ЗначениеЗаполнено(ОбъектСсылка);
		Цены.Параметры.УстановитьЗначениеПараметра("ЕдиницаИзмерения", ОбъектСсылка);
		
		Элементы.Количество01.Видимость = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("КоличествоНоменклатурыМожетБытьДробным");
		
		//всегда 15.6
		//ОбщийМодульСервисСервер.ОформитьФорматКоличества(Элементы.Количество, ИСТИНА); 	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Упаковка(Команда)
	
	ПредставлениеНаименования = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("уп.");
	Объект.Наименование = ПредставлениеНаименования;
	НаименованиеИзменяли = ИСТИНА;
	Объект.Комментарий = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Упаковка");
	Объект.КодЕдиницыПоКлассификатору = "2102";
	
КонецПроцедуры

&НаКлиенте
Процедура Услуга(Команда)
	
	ПредставлениеНаименования = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("усл.");
	Объект.Наименование = ПредставлениеНаименования;
	НаименованиеИзменяли = ИСТИНА;
	Объект.Комментарий = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Услуга");
	Объект.КодЕдиницыПоКлассификатору = "2454";
	
КонецПроцедуры

&НаКлиенте
Процедура Штука(Команда)
	
	ПредставлениеНаименования = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("шт.");
	Объект.Наименование = ПредставлениеНаименования;
	НаименованиеИзменяли = ИСТИНА;
	Объект.Комментарий = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Штука");
	Объект.КодЕдиницыПоКлассификатору = "2009";
	
КонецПроцедуры

&НаКлиенте
Процедура Килограмм(Команда)
	
	ПредставлениеНаименования = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("кг.");
	Объект.Наименование = ПредставлениеНаименования;
	НаименованиеИзменяли = ИСТИНА;
	Объект.Комментарий = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Килограмм");
	Объект.КодЕдиницыПоКлассификатору = "0301";
	
КонецПроцедуры

&НаКлиенте
Процедура ОбратныйРасчетПриИзменении(Элемент)
	
	Если ОБъект.Количество = 0 Тогда
		ОбратныйРасчет = 0;
	Иначе
		ОбратныйРасчет = 1 / ОБъект.Количество;
	КонецЕсли;
	
КонецПроцедуры
