// sza150715-0406 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьСобственныйПереводЭлементовИнтерфейса") Тогда
		ОбщийМодульСервер.ПеревестиРеквизитыФормы(ЭтаФорма);	
	КонецЕсли;
	
	ЭтаФорма.Заголовок = "WebCamera";
	СвязанныйОбъект = Параметры.СвязанныйОбъект;
	
КонецПроцедуры

&НаКлиенте
Процедура Сфотографировать(Команда)
 	ВыполнитьФото();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьФото()
	
	Если ПустаяСтрока(Камера) Тогда
		Камера = Элементы.Камера.СписокВыбора[0].Значение;
		КамераВыбрана();
	КонецЕсли;
	
	ФотографияВыполнена = ИСТИНА;
	Файл = ОбщийМодульКлиент.КамераПолучитьФото();
	Фото = ПоместитьВоВременноеХранилище(Файл, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбщийМодульКлиент.КамераУстановить();
	Список = ОбщийМодульКлиент.КамераПолучитьСписокКамер();
	Текст = Новый ТекстовыйДокумент;
	Текст.УстановитьТекст(Список);
	Для Строка = 1 по Текст.КоличествоСтрок() Цикл
		Элементы.Камера.СписокВыбора.Добавить(Текст.ПолучитьСтроку(Строка + 1), Текст.ПолучитьСтроку(Строка));
		Строка = Строка + 1;
	КонецЦикла;
	
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
	
	Если Элементы.Камера.СписокВыбора.Количество() = 0 Тогда
		Сообщить(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Нет установленных камер!"), СтатусСообщения.Информация);		
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ПослеИзображенияОкнаФормы", 0.3, ИСТИНА);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеИзображенияОкнаФормы() // Когда окно уже нарисовано пользователю
	ЭтаФорма.Элементы.ФормаЗакрыть.Видимость = НЕ ЭтаФорма.Окно = Неопределено;	
КонецПроцедуры

&НаКлиенте
Процедура КамераПриИзменении(Элемент)
	КамераВыбрана();
КонецПроцедуры

&НаКлиенте
Процедура КамераВыбрана()
	
	ОбщийМодульКлиент.КамераОтключитьКамеру();
	ОбщийМодульКлиент.КамераПодключитьКамеру(Камера, ЭтаФорма.Заголовок, 4);
	Камера = Элементы.Камера.СписокВыбора.НайтиПоЗначению(Камера).Представление;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	ОбщийМодульКлиент.КамераОтключитьКамеру();
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЭтуФотографию(Команда)
		
		Если НЕ ФотографияВыполнена Тогда
			ВыполнитьФото();
		КонецЕсли;
		
		ПараметрыВозврата = Новый Структура("Фото, ИмяФайлаИзображения, ТолькоХранилище", Фото, "", ИСТИНА);
		Закрыть(ПараметрыВозврата);

КонецПроцедуры
