// sza150217-0014 
// sza150212-1327

&НаКлиенте
Процедура ДокументыДляПодбораВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элемент.ТекущиеДанные;
    НоваяСтрока   = ОтобранныеДокументы.Добавить();
    НоваяСтрока.Ссылка = ТекущаяСтрока.Ссылка;
	КоличествоОтобранныхДокументов = КоличествоОтобранныхДокументов + 1;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаКлиенте
Процедура ВыборОконченЗакрыть(Команда)
	
	Если Не ОтобранныеДокументы.Количество() = 0 Тогда
		ОповеститьОВыборе(ОтобранныеДокументы);
	Иначе
		Закрыть(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
			Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьСобственныйПереводЭлементовИнтерфейса") Тогда
			ОбщийМодульСервер.ПеревестиРеквизитыФормы(ЭтаФорма);	
		КонецЕсли;
		

КонецПроцедуры
