#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// sza150714-1815
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)

	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ПоддерживатьИныеЯзыкиКромеРусского") Тогда
		НаРусском = Данные.Ссылка.Наименование;
		ВозможноеПредставление = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке(НаРусском, , , ИСТИНА);
		Если НЕ ВозможноеПредставление = НаРусском Тогда
			Представление = ВозможноеПредставление;
			СтандартнаяОбработка = ЛОЖЬ;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецЕсли
