//sza140326-1245 SZA: 
//sza131214-0136 : 

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если НЕ ОбщийМодульПовтор.ТекущийЯзыкРусский()
		и ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ПоддерживатьНаименованияНаДругихЯзыкахКромеРусского", Истина) Тогда
		
		ВозможноеПредставление = ОбщийМодульПовтор.получитьПредставлениеНаЯзыке(Данные.ссылка, , Истина);
		Если НЕ ВозможноеПредставление = Неопределено Тогда
			Представление = ВозможноеПредставление;
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура НаПечать(ТабДок, Ссылка) Экспорт
	
	Макет = Справочники.ВидыЦен.ПолучитьМакет("НаПечать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВидыЦен.ВалютаЦены,
	|	ВидыЦен.ДатаРедакции,
	|	ВидыЦен.ДатаСоздания,
	|	ВидыЦен.Зависимая,
	|	ВидыЦен.Код,
	|	ВидыЦен.Комментарий,
	|	ВидыЦен.Наименование,
	|	ВидыЦен.ОкруглятьТолькоВБольшуюСторону,
	|	ВидыЦен.ОсновнойВидЦен,
	|	ВидыЦен.Ответственный,
	|	ВидыЦен.ПроцентОтБазовойЦены,
	|	ВидыЦен.ПроцентСкидкиДляРасчетаЛьготнойЦены,
	|	ВидыЦен.ФормулаРасчетаОтБазовогоВидаЦены,
	|	ВидыЦен.ЦенаВЦелыхЕдиницах,
	|	ВидыЦен.СпособыФормированияЦеныДляНоменклатурныхГрупп.(
	|		НомерСтроки,
	|		НоменклатурнаяГруппа,
	|		ПроцентОтБазовойЦены,
	|		ФормулаРасчетаОтБазовогоВидаЦены,
	|		ЦенаВЦелыхЕдиницах,
	|		ПроцентСкидкиДляРасчетаЛьготнойЦены,
	|		ОкруглятьТолькоВБольшуюСторону,
	|		Комментарий
	|	),
	|	ВидыЦен.ЦенаВДесятых
	|ИЗ
	|	Справочник.ВидыЦен КАК ВидыЦен
	|ГДЕ
	|	ВидыЦен.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСпособыФормированияЦеныДляНоменклатурныхГруппШапка = Макет.ПолучитьОбласть("СпособыФормированияЦеныДляНоменклатурныхГруппШапка");
	ОбластьСпособыФормированияЦеныДляНоменклатурныхГрупп = Макет.ПолучитьОбласть("СпособыФормированияЦеныДляНоменклатурныхГрупп");
	Подвал = Макет.ПолучитьОбласть("Подвал");
	
	ТабДок.Очистить();
	
	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ТабДок.Вывести(ОбластьЗаголовок);
		
		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());
		
		если ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("НазначатьРазличныеСпособыФормированияЦеныДляНоменклатурныхГрупп") Тогда
			ТабДок.Вывести(ОбластьСпособыФормированияЦеныДляНоменклатурныхГруппШапка);
			ВыборкаСпособыФормированияЦеныДляНоменклатурныхГрупп = Выборка.СпособыФормированияЦеныДляНоменклатурныхГрупп.Выбрать();
			Пока ВыборкаСпособыФормированияЦеныДляНоменклатурныхГрупп.Следующий() Цикл
				ОбластьСпособыФормированияЦеныДляНоменклатурныхГрупп.Параметры.Заполнить(ВыборкаСпособыФормированияЦеныДляНоменклатурныхГрупп);
				ТабДок.Вывести(ОбластьСпособыФормированияЦеныДляНоменклатурныхГрупп, ВыборкаСпособыФормированияЦеныДляНоменклатурныхГрупп.Уровень());
			КонецЦикла;	
		КонецЕсли;
		
		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);
		
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	
КонецПроцедуры
