//sza141111-1338
//sza140604-1052  
//sza131121-1528  
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Клиенты") Тогда
		Комментарий = ДанныеЗаполнения.Комментарий;
		Наименование = ДанныеЗаполнения.Наименование;
		ВалютаЦены = ДанныеЗаполнения.ОсновнаяВалюта;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Поставщики") Тогда
		Комментарий = ДанныеЗаполнения.Комментарий;
		Наименование = ДанныеЗаполнения.Наименование;
		ВалютаЦены = ДанныеЗаполнения.ОсновнаяВалюта;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Склады") Тогда
		Комментарий = ДанныеЗаполнения.Комментарий;
		Наименование = ДанныеЗаполнения.Наименование;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если НЕ Отказ 
		И НЕ ПометкаУдаления Тогда
		
		ОбщийМодульСервер.ПроверитьСменуНаименованияНаТекущемЯзыке(Наименование, Ссылка, , Отказ);	
		
		Если НЕ Зависимая Тогда
			Если ЗначениеЗаполнено(ОсновнойВидЦен) Тогда
				ОсновнойВидЦен = ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка");
			КонецЕсли;
			Если ЗначениеЗаполнено(ФормулаРасчетаОтБазовогоВидаЦены) Тогда
				ФормулаРасчетаОтБазовогоВидаЦены = ПредопределенноеЗначение("Справочник.ФормулыОписания.ПустаяСсылка");
			КонецЕсли;
			Если НЕ ПроцентОтБазовойЦены = 0 Тогда
				ПроцентОтБазовойЦены = 0;
			КонецЕсли;
			
			СпособыФормированияЦеныДляНоменклатурныхГрупп.Очистить();
			ТаблицаЗависимости.Очистить();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Комментарий = "";
КонецПроцедуры
