//sza140530-1704 : 

Процедура НаПечать(ТабДок, Ссылка) Экспорт
	
	Макет = Документы.ПланыДоходовИРасходовДенег.ПолучитьМакет("НаПечать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПланыДоходовИРасходовДенег.Дата,
	|	ПланыДоходовИРасходовДенег.ДатаРедакции,
	|	ПланыДоходовИРасходовДенег.ДатаСоздания,
	|	ПланыДоходовИРасходовДенег.ИтогоДоходов,
	|	ПланыДоходовИРасходовДенег.ИтогоРасходов,
	|	ПланыДоходовИРасходовДенег.Комментарий,
	|	ПланыДоходовИРасходовДенег.МесяцПланирования,
	|	ПланыДоходовИРасходовДенег.Номер,
	|	ПланыДоходовИРасходовДенег.Ответственный,
	|	ПланыДоходовИРасходовДенег.ПланНеАктуален,
	|	ПланыДоходовИРасходовДенег.Разница,
	|	ПланыДоходовИРасходовДенег.ПланРасхода.(
	|		НомерСтроки,
	|		СтатьяДвиженияДенег,
	|		Сумма,
	|		Валюта,
	|		Курс,
	|		ОСтроке
	|	),
	|	ПланыДоходовИРасходовДенег.ПланДохода.(
	|		НомерСтроки,
	|		СтатьяДвиженияДенег,
	|		Сумма,
	|		Валюта,
	|		Курс,
	|		ОСтроке
	|	)
	|ИЗ
	|	Документ.ПланыДоходовИРасходовДенег КАК ПланыДоходовИРасходовДенег
	|ГДЕ
	|	ПланыДоходовИРасходовДенег.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьПланРасходаШапка = Макет.ПолучитьОбласть("ПланРасходаШапка");
	ОбластьПланРасхода = Макет.ПолучитьОбласть("ПланРасхода");
	ОбластьПланДоходаШапка = Макет.ПолучитьОбласть("ПланДоходаШапка");
	ОбластьПланДохода = Макет.ПолучитьОбласть("ПланДохода");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьПланРасходаШапка);
		ВыборкаПланРасхода = Выборка.ПланРасхода.Выбрать();
		Пока ВыборкаПланРасхода.Следующий() Цикл
			ОбластьПланРасхода.Параметры.Заполнить(ВыборкаПланРасхода);
			ТабДок.Вывести(ОбластьПланРасхода, ВыборкаПланРасхода.Уровень());
		КонецЦикла;

		ТабДок.Вывести(ОбластьПланДоходаШапка);
		ВыборкаПланДохода = Выборка.ПланДохода.Выбрать();
		Пока ВыборкаПланДохода.Следующий() Цикл
			ОбластьПланДохода.Параметры.Заполнить(ВыборкаПланДохода);
			ТабДок.Вывести(ОбластьПланДохода, ВыборкаПланДохода.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	
КонецПроцедуры
