// sza140530-0258  
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ДвиженияДенег") Тогда
		НаправлениеДеятельности = ДанныеЗаполнения.НаправлениеДеятельности;
		МесяцПланирования = ДанныеЗаполнения.ДатаРедакции;
		
		Для Каждого ТекСтрокаПлатежи Из ДанныеЗаполнения.Платежи Цикл
			
			Если ТекСтрокаПлатежи.ПриходИлиРасход = перечисления.ПриходРасход.Приход Тогда
				НоваяСтрока = ПланДохода.Добавить();	
				НоваяСтрока.Валюта = ТекСтрокаПлатежи.Валюта;
				НоваяСтрока.Курс = ТекСтрокаПлатежи.Курс;
				НоваяСтрока.ОСтроке = ТекСтрокаПлатежи.ОСтроке;
				НоваяСтрока.СтатьяДвиженияДенег = ТекСтрокаПлатежи.Статья;
				НоваяСтрока.Сумма = ТекСтрокаПлатежи.Сумма;
			Иначе
				НоваяСтрока = ПланРасхода.Добавить();
				НоваяСтрока.Валюта = ТекСтрокаПлатежи.Валюта;
				НоваяСтрока.Курс = ТекСтрокаПлатежи.Курс;
				НоваяСтрока.ОСтроке = ТекСтрокаПлатежи.ОСтроке;
				НоваяСтрока.СтатьяДвиженияДенег = ТекСтрокаПлатежи.Статья;
				НоваяСтрока.Сумма = ТекСтрокаПлатежи.Сумма;	
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Комментарий = "";
КонецПроцедуры



