// sza101117-1528
// sza101116-0219
// sza101109-1808
// sza101025

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("002700", , , );

	Если НЕ Отказ Тогда
		ОбщийМодульКлиент.ДобавитьСобытиеЖурнала(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Загрузил список из файла"), 2, ПараметрКоманды);
		ПодсистемаИЭКлиент.ИмпортЭкспортОбработкаОбмена(
		ПодсистемаИЭКлиент.СоздатьСтруктуруВызоваИмпЭкспОперации(ПараметрКоманды,, ЛОЖЬ,, "С")
		); // Экспорт  (ИСТИНА) /Импорт (ЛОЖЬ), К/С/З - карточка, список, Товары
	КонецЕсли;

КонецПроцедуры
