//sza140420-1435 SZA: 
//sza131005-0221 : 

&НаКлиенте
Процедура ПриОткрытии(Отказ)                                       // ПРИ ОТКРЫТИИ
	
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
	Если КорректировокНет() Тогда
		ФормаНовойКорректировки = получитьформу("Документ.КорректировкиИРегистрацияОстатков.ФормаОбъекта");
		ФормаНовойКорректировки.ОткрытьМодально();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()                                            // ПРИ ЗАКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаСервере
Функция   КорректировокНет()
	
	Выборка = Документы.КорректировкиИРегистрацияОстатков.Выбрать();
	
	Если выборка.Следующий() Тогда
		Возврат ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции //КорректировокНет

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("002200", ЭтаФорма, Отказ, );
	
	Если НЕ Отказ Тогда
		ОбщийМодульСервисСервер.ОформитьФорматКоличества(Элементы.ТовараВКоличестве, , Истина);
		ОбщийМодульСервер.ОбеспечитьСписокОтборов(Список);	
	КонецЕсли;
	
КонецПроцедуры
