//sza131005-0221 : 

&НаКлиенте
Процедура ПриОткрытии(Отказ)                                                                    // ПРИ ОТКРЫТИИ
	
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
	Если КорректировокНет() Тогда
		ФормаНовойКорректировки = получитьформу("Документ.КорректировкиИРегистрацияОстатков.ФормаОбъекта");
		ФормаНовойКорректировки.ОткрытьМодально();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()                                                  // ПРИ ЗАКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаСервере
Функция   КорректировокНет()
	
	Выборка = Документы.КорректировкиИРегистрацияОстатков.Выбрать();
	
	Если выборка.Следующий() Тогда
		Возврат ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции //КорректировокНет