// sza130921-0115 : 
&НаСервере
Процедура ДозаполнитьНоменклатурой(ДокументСсылка, СтруктураОтбора)
	
	Инвентаризации =  ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.Инвентаризации");
	
	ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
	Запрос = Новый Запрос;
	
	Если Инвентаризации Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка,
		|	Номенклатура.Цена,
		|	ЕСТЬNULL(ВложенныйЗапрос.КоличествоОстаток, 0) КАК КоличествоОстаток,
		|	ЕСТЬNULL(ВложенныйЗапрос.СуммаОстаток, 0) КАК СуммаОстаток
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ТоварыОстатки.Номенклатура КАК НоменклатураОст,
		|			ТоварыОстатки.Склад КАК СкладОст,
		|			ТоварыОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|			ТоварыОстатки.СуммаОстаток КАК СуммаОстаток
		|		ИЗ
		|			РегистрНакопления.Товары.Остатки(
		|					&Дата,
		|					НЕ &ОтборПоСкладу
		|						ИЛИ Склад = &Склад) КАК ТоварыОстатки) КАК ВложенныйЗапрос
		|		ПО Номенклатура.Ссылка = ВложенныйЗапрос.НоменклатураОст
		|ГДЕ
		|	Номенклатура.ЭтоГруппа = ЛОЖЬ";
		
		Запрос.УстановитьПараметр("Дата", ДокументСсылка.дата);
		Запрос.УстановитьПараметр("ОтборПоСкладу", Константы.ВестиУчетПоСкладам.Получить() и ЗначениеЗаполнено(ДокументСсылка.склад));
		Запрос.УстановитьПараметр("Склад", ЗначениеЗаполнено(ДокументСсылка.склад));
		
	Иначе
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка,
		|	Номенклатура.Цена
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.ЭтоГруппа = ЛОЖЬ ";	
	КонецЕсли;
	
	Если НЕ СтруктураОтбора.ГруппыНоменклатуры.Количество() = 0 Тогда
		Запрос.Текст = Запрос.Текст + " И Номенклатура.Родитель В(&ГруппыНоменклатуры) ";
		Запрос.УстановитьПараметр("ГруппыНоменклатуры", СтруктураОтбора.ГруппыНоменклатуры);
	КонецЕсли;
	Если НЕ СтруктураОтбора.НоменклатурныеГруппы.Количество() = 0 Тогда
		Запрос.Текст = Запрос.Текст + " И Номенклатура.НоменклатурнаяГруппа В(&НоменклатурныеГруппы) ";
		Запрос.УстановитьПараметр("НоменклатурныеГруппы", СтруктураОтбора.НоменклатурныеГруппы);
	КонецЕсли;
	Если НЕ СтруктураОтбора.Производители.Количество() = 0 Тогда
		Запрос.Текст = Запрос.Текст + " И Номенклатура.Производитель В(&Производители) ";
		Запрос.УстановитьПараметр("Производители", СтруктураОтбора.Производители);
	КонецЕсли;
	Если НЕ СтруктураОтбора.Регионы.Количество() = 0 Тогда
		Запрос.Текст = Запрос.Текст + " И Номенклатура.Производитель.Регион В(&Регионы) ";
		Запрос.УстановитьПараметр("Регионы", СтруктураОтбора.Регионы);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ИспользоватьСложныйМеханизмЦен = ПараметрыСеанса.ИспользоватьСложныйМеханизмЦенПС ;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Номенклатура", ВыборкаДетальныеЗаписи.ссылка);
			
			Если ДокументСсылка.Товары.НайтиСтроки(СтруктураОтбора).Количество() = 0 Тогда
				НоваяСтрока = ДокументОбъект.Товары.Добавить();
				НоваяСтрока.Номенклатура = ВыборкаДетальныеЗаписи.Ссылка;
				Если ИспользоватьСложныйМеханизмЦен Тогда
					НоваяСтрока.Цена = ОбщийМодульСервер.ПолучитьСложнуюЦену(НоваяСтрока.номенклатура, ДокументСсылка.ВидЦен, ДокументСсылка.Дата, ЛОЖЬ);
				Иначе
					НоваяСтрока.Цена = ВыборкаДетальныеЗаписи.Цена;
				КонецЕсли;
				
				Если Инвентаризации Тогда
					НоваяСтрока.КоличествоУчет = НоваяСтрока.КоличествоУчет + ВыборкаДетальныеЗаписи.КоличествоОстаток;
					НоваяСтрока.СуммаУчет = НоваяСтрока.СуммаУчет + ВыборкаДетальныеЗаписи.СуммаОстаток;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Попытка // Записи ДокументОбъект 
			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
			ДокументСсылка = ДокументОбъект.Ссылка;
			
		Исключение 
			ТекстОписаниеОшибки = ОписаниеОшибки();
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ошибка при попытке записи документа") + ": " + ДокументОбъект + " - " + ТекстОписаниеОшибки;
			Сообщение.Сообщить();
			
		КонецПопытки; // Записи ДокументОбъект
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если НЕ ОбщийМодульСервер.ПроверитьДокументПроведен(ПараметрКоманды) Тогда
		
		Форма = ПолучитьФорму("Обработка.УсловияДляЗаполненияТаблицыТовары.Форма");
		ДанныеФормы = Форма.Объект;
		
		СтруктураОтбора = Форма.ОткрытьМодально();
		Если НЕ СтруктураОтбора = Неопределено тогда
			Состояние(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Обработка и заполнение таблицы товаров.."));
			ДозаполнитьНоменклатурой(ПараметрКоманды, СтруктураОтбора);
			ОбщийМодульКлиент.ПересчитатьТоВары(ПараметрКоманды);	
		КонецЕсли;
	Иначе
		Сообщить(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Документ уже проведен. Изменений не будет."), СтатусСообщения.Информация);
	КонецЕсли;                                  		
	
КонецПроцедуры



