//sza101117-1527       
//sza101109-1806       
//sza101025
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("002700", , , );	
	
	Если НЕ Отказ Тогда
	ОбщийМодульКлиент.ДобавитьСобытиеЖурнала(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Загрузил шапку из файла"), 2, ПараметрКоманды);
	ПодсистемаИЭИмпортЭкспортФСКлиент.ИмпортЭкспортОбработкаОбмена(
	ПодсистемаИЭИмпортЭкспортФСКлиент.СоздатьСтруктуруВызоваИмпЭкспОперации(ПараметрКоманды,, ЛОЖЬ,, "К")
	); //Экспорт  (ИСТИНА) /Импорт (ЛОЖЬ), К/С/З - карточка, список, Товары 
	
КонецЕсли;	

КонецПроцедуры



