//sza140420-1442 SZA: 
//sza131020-1645 : 

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("000657", , , );
	
	Если НЕ Отказ Тогда
		ПараметрыФормы = Новый Структура("ВзаимозачетДолгаКонтрагентов", Истина);
		ОткрытьФорму("Документ.КорректировкиИРегистрацияОстатков.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);//, ПараметрыВыполненияКоманды.НавигационнаяСсылка);		
	КонецЕсли;
	
КонецПроцедуры
