// sza140606-0011  
Процедура ОбновитьПримерКнопки()
	
	ЦветФона = Новый Цвет(Объект.ЦветФонаКнопкиКрасный, Объект.ЦветФонаКнопкиЗеленый, Объект.ЦветФонаКнопкиСиний);
	Элементы.ПримерКнопки.ЦветФона = ЦветФона;
	ЦветТекста = Новый Цвет(Объект.ЦветТекстаКнопкиКрасный, Объект.ЦветТекстаКнопкиЗеленый, Объект.ЦветТекстаКнопкиСиний);
	Элементы.ПримерКнопки.ЦветТекста = ЦветТекста;
	Если Объект.РазмерТекста = ПредопределенноеЗначение("Перечисление.ВидыРазмеров.Крупный") Тогда
		Элементы.ПримерКнопки.Шрифт.Размер = 16;
	ИначеЕсли Объект.РазмерТекста = ПредопределенноеЗначение("Перечисление.ВидыРазмеров.Мелкий") Тогда
		Элементы.ПримерКнопки.Шрифт.Размер = 8;
	ИначеЕсли Объект.РазмерТекста = ПредопределенноеЗначение("Перечисление.ВидыРазмеров.Огромный") Тогда
		Элементы.ПримерКнопки.Шрифт.Размер = 20;
	ИначеЕсли Объект.РазмерТекста = ПредопределенноеЗначение("Перечисление.ВидыРазмеров.Средний") Тогда
		Элементы.ПримерКнопки.Шрифт.Размер = 12;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1, Объект.Ссылка, ИСТИНА);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0, Объект.Ссылка, ИСТИНА);
	ОбновитьПримерКнопки();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("000365", ЭтаФорма, Отказ, Объект);
	
	Если НЕ Отказ Тогда
		Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьСобственныйПереводЭлементовИнтерфейса") Тогда
			ОбщийМодульСервер.ПеревестиРеквизитыФормы(ЭтаФорма);	
		КонецЕсли;
		
		Если ОбщийМодульПовтор.ПолучитьПараметрСеанса("НеМожетМенятьЦены") Тогда
			Элементы.РеализоватьСИспользованиеОпределенногоВидаЦен.Доступность = ЛОЖЬ;	
		КонецЕсли;	
				  КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура РазмерТекстаПриИзменении(Элемент)
	ОбновитьПримерКнопки();
КонецПроцедуры

&НаКлиенте
Процедура ЦветТекстаКнопкиЗеленыйПриИзменении(Элемент)
	ОбновитьПримерКнопки();
КонецПроцедуры

&НаКлиенте
Процедура ЦветТекстаКнопкиКрасныйПриИзменении(Элемент)
	ОбновитьПримерКнопки();
КонецПроцедуры

&НаКлиенте
Процедура ЦветТекстаКнопкиСинийПриИзменении(Элемент)
	ОбновитьПримерКнопки();
КонецПроцедуры

&НаКлиенте
Процедура ЦветФонаКнопкиЗеленыйПриИзменении(Элемент)
	ОбновитьПримерКнопки();
КонецПроцедуры

&НаКлиенте
Процедура ЦветФонаКнопкиКрасныйПриИзменении(Элемент)
	ОбновитьПримерКнопки();
КонецПроцедуры

&НаКлиенте
Процедура ЦветФонаКнопкиСинийПриИзменении(Элемент)
	ОбновитьПримерКнопки();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	глЧислоОбъектов = глЧислоОбъектов + 1; глПроверятьСообщения = ИСТИНА;
КонецПроцедуры
