//sza140722-0105 склад
//sza140305-1713  
Процедура НаПечать(ТабДок, Ссылка) Экспорт
	
	Макет = Документы.ОказанияУслугЗаВремя.ПолучитьМакет("НаПечать");
	ЯзыкаМакета = ОбщийМодульПовтор.ПолучитьТекущийЯзыкДокументов(ССылка[0].Клиент, , ЛОЖЬ);	
	Макет.КодЯзыкаМакета = ЯзыкаМакета.Код;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ОказанияУслугЗаВремя.Валюта,
	|	ОказанияУслугЗаВремя.ВидЦен,
	|	ОказанияУслугЗаВремя.Дата,
	|	ОказанияУслугЗаВремя.ДатаНачалаОказанияУслуг,
	|	ОказанияУслугЗаВремя.ДатаОкончанияОказанияУслуг,
	|	ОказанияУслугЗаВремя.ДатаРедакции,
	|	ОказанияУслугЗаВремя.ДатаСоздания,
	|	ОказанияУслугЗаВремя.Договор,
	|	ОказанияУслугЗаВремя.Клиент,
	|	ОказанияУслугЗаВремя.Комментарий,
	|	ОказанияУслугЗаВремя.Курс,
	|	ОказанияУслугЗаВремя.Номенклатура,
	|	ОказанияУслугЗаВремя.Номер,
	|	ОказанияУслугЗаВремя.Организация,
	|	ОказанияУслугЗаВремя.Ответственный,
	|	ОказанияУслугЗаВремя.ОткрыватьНовыйДокументОказанияУслугПриЗавершении,
	|	ОказанияУслугЗаВремя.ПоступилоДенег,
	|	ОказанияУслугЗаВремя.ПроцентСкидки,
	|	ОказанияУслугЗаВремя.Сотрудник,
	|	ОказанияУслугЗаВремя.СуммаБезСкидки,
	|	ОказанияУслугЗаВремя.ТовараВКоличестве,
	|	ОказанияУслугЗаВремя.ТовараНаСумму,
	|	ОказанияУслугЗаВремя.УслугаОказана,
	|	ОказанияУслугЗаВремя.ФормаОплаты,
	|	ОказанияУслугЗаВремя.ХранилищеДенег,
	|	ОказанияУслугЗаВремя.Цена,
	|	ОказанияУслугЗаВремя.Склад
	|ИЗ Документ.ОказанияУслугЗаВремя КАК ОказанияУслугЗаВремя
	|ГДЕ ОказанияУслугЗаВремя.Ссылка В(&Ссылка)";
	
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = ЛОЖЬ;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		Шапка.Параметры.ПредставлениеНоменклатуры = ОбщийМодульТекстСервер.ПолучитьОбщееНаименование(Выборка.Номенклатура, ЯзыкаМакета, Выборка.Клиент);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ВставлятьРазделительСтраниц = ИСТИНА;
	КонецЦикла;
	
КонецПроцедуры
