// sza140722-0105 склад
// sza140305-1713  
Процедура НаПечать(ТабДок, Ссылка) Экспорт
	
	ТабДок.ИмяПараметровПечати  = "докОказаниеУслугЗаВремя" + СокрЛП(ИмяКомпьютера());
	ТабДок.КлючПараметровПечати = ТабДок.ИмяПараметровПечати;
	
	ТабДок.Очистить();
	
	СсылкаНаОбъектПечати = Ссылка[0];
	
	РазрядМетаданных = ""; ИмяМетаданных = "";
	ПроизвольнаяПечатнаяФорма = ОбщийМодульТекстСервер.ОпределитьПроизвольнуюПечатнуюФорму(, , СсылкаНаОбъектПечати, РазрядМетаданных, ИмяМетаданных);
	
	Если ЗначениеЗаполнено(ПроизвольнаяПечатнаяФорма) Тогда
		ТабДок = ОбщийМодульТекстСервер.СформироватьДокументПоПроизвольнойФорме(ПроизвольнаяПечатнаяФорма, , ТабДок, СсылкаНаОбъектПечати, РазрядМетаданных, ИмяМетаданных);
		
	Иначе		
		Макет = Документы.ОказанияУслугЗаВремя.ПолучитьМакет("НаПечать");
		ЯзыкаМакета = ОбщийМодульПовтор.ПолучитьТекущийЯзыкДокументов(ССылка[0].Клиент, , ЛОЖЬ);	
		Макет.КодЯзыкаМакета = ЯзыкаМакета.Код;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ОказанияУслугЗаВремя.Валюта,
		|	ОказанияУслугЗаВремя.ВидЦен,
		|	ОказанияУслугЗаВремя.Дата,
		|	ОказанияУслугЗаВремя.ДатаНачалаОказанияУслуг,
		|	ОказанияУслугЗаВремя.ДатаОкончанияОказанияУслуг,
		|	ОказанияУслугЗаВремя.ДатаРедакции,
		|	ОказанияУслугЗаВремя.ДатаСоздания,
		|	ОказанияУслугЗаВремя.Договор,
		|	ОказанияУслугЗаВремя.Клиент,
		|	ОказанияУслугЗаВремя.Комментарий,
		|	ОказанияУслугЗаВремя.Курс,
		|	ОказанияУслугЗаВремя.Номенклатура,
		|	ОказанияУслугЗаВремя.Номер,
		|	ОказанияУслугЗаВремя.Организация,
		|	ОказанияУслугЗаВремя.Ответственный,
		|	ОказанияУслугЗаВремя.ОткрыватьНовыйДокументОказанияУслугПриЗавершении,
		|	ОказанияУслугЗаВремя.ПоступилоДенег,
		|	ОказанияУслугЗаВремя.ПроцентСкидки,
		|	ОказанияУслугЗаВремя.Сотрудник,
		|	ОказанияУслугЗаВремя.СуммаБезСкидки,
		|	ОказанияУслугЗаВремя.ТовараВКоличестве,
		|	ОказанияУслугЗаВремя.ТовараНаСумму,
		|	ОказанияУслугЗаВремя.УслугаОказана,
		|	ОказанияУслугЗаВремя.ФормаОплаты,
		|	ОказанияУслугЗаВремя.ХранилищеДенег,
		|	ОказанияУслугЗаВремя.Цена,
		|	ОказанияУслугЗаВремя.ПредметСделки,
		|	ОказанияУслугЗаВремя.Склад
		|ИЗ Документ.ОказанияУслугЗаВремя КАК ОказанияУслугЗаВремя
		|ГДЕ ОказанияУслугЗаВремя.Ссылка В(&Ссылка)";
		
		Запрос.Параметры.Вставить("Ссылка", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		Шапка = Макет.ПолучитьОбласть("Шапка");
		
		ВставлятьРазделительСтраниц = ЛОЖЬ;
		Пока Выборка.Следующий() Цикл
			Если ВставлятьРазделительСтраниц Тогда
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ОбластьЗаголовок);
			ТабДок.Вывести(ОбластьЗаголовок);
			
			Шапка.Параметры.Заполнить(Выборка);
			Шапка.Параметры.ПредставлениеНоменклатуры = ОбщийМодульТекстСервер.ПолучитьОбщееНаименование(Выборка.Номенклатура, ЯзыкаМакета, Выборка.Клиент);
			ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(Шапка);
			ТабДок.Вывести(Шапка, Выборка.Уровень());
			
			Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьТекстовоеПолеПредметСделки")
				И НЕ ПустаяСтрока(Выборка.ПредметСделки) Тогда
				
				ПредметСделки = Макет.ПолучитьОбласть("ПредметСделки");
				ПредметСделки.Параметры.Заполнить(Выборка);
				ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(ПредметСделки);
				ТабДок.Вывести(ПредметСделки);
			КонецЕсли;
			
			ВставлятьРазделительСтраниц = ИСТИНА;
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры
