//sza140612-0105 Хозяин: 
//sza131125-0342 SZA: 

Процедура Печать(ТабДок, Ссылка) Экспорт
	
	Макет = Справочники.Договора.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Договора.ВидЦен,
	               |	Договора.ДатаЗаключения,
	               |	Договора.ДатаНачала,
	               |	Договора.ДатаОкончания,
	               |	Договора.ДатаРедакции,
	               |	Договора.ДатаСоздания,
	               |	Договора.КлиентПоставщик,
	               |	Договора.Комментарий,
	               |	Договора.Наименование,
	               |	Договора.НомерДоговора,
	               |	Договора.ОграничиваетКоличествоТоваров,
	               |	Договора.ОграничиваетСуммуЗадолженности,
	               |	Договора.ОграничиваетСуммуТоваров,
	               |	Договора.Организация,
	               |	Договора.Ответственный,
	               |	Договора.ПредусматриваетСтрогиеЦены,
	               |	Договора.УстанавливаетСрокОплатыВДнях,
	               |	Договора.Товары.(
	               |		Ссылка,
	               |		НомерСтроки,
	               |		Номенклатура,
	               |		ЕдиницаИзмерения,
	               |		Цена,
	               |		Коментарий
	               |	),
	               |	Договора.ПроцентКомиссионногоВознаграждения
	               |ИЗ
	               |	Справочник.Договора КАК Договора
	               |ГДЕ
	               |	Договора.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОбластьЗаголовок 	= Макет.ПолучитьОбласть("Заголовок");
	ОбластьТоварыШапка 	= Макет.ПолучитьОбласть("ТоварыШапка");
	Шапка 			= Макет.ПолучитьОбласть("Шапка");
	ОбластьТовары 	= Макет.ПолучитьОбласть("Товары");
	Подвал 			= Макет.ПолучитьОбласть("Подвал");
	
	ТабДок.Очистить();
	
	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ТабДок.Вывести(ОбластьЗаголовок);
		
		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());
		
		ВыборкаТовары = Выборка.Товары.Выбрать();
		Если НЕ ВыборкаТовары.Количество() = 0 Тогда
			ТабДок.Вывести(ОбластьТоварыШапка);
			Пока ВыборкаТовары.Следующий() Цикл
				ОбластьТовары.Параметры.Заполнить(ВыборкаТовары);
				ТабДок.Вывести(ОбластьТовары, ВыборкаТовары.Уровень());
			КонецЦикла;
		КонецЕсли;
		
		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);
		
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ДляУскоренияРаботыСБазойДанныхНеВыводитьДополнительныхДанных") Тогда
		
		Если ВидФормы = "ФормаОбъекта" Тогда
			ВыбраннаяФорма = "ФормаЭлементаУпрощенная";
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если НЕ ОбщийМодульПовтор.ТекущийЯзыкРусский()
		и ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ПоддерживатьНаименованияНаДругихЯзыкахКромеРусского", Истина) Тогда
		
		ВозможноеПредставление = ОбщийМодульПовтор.получитьПредставлениеНаЯзыке(Данные.ссылка, , Истина);
		Если НЕ ВозможноеПредставление = Неопределено Тогда
			Представление = ВозможноеПредставление;
			СтандартнаяОбработка = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
