//sza140411-1659 : 
//sza131116-2308

Функция   АвтоНаменованиеДоговораНаСервере() Экспорт
	
	НаименованиеС = ?(ЗначениеЗаполнено(Организация), Организация + ?(ЗначениеЗаполнено(КлиентПоставщик), " - ", ""), "") + ?(ЗначениеЗаполнено(КлиентПоставщик), КлиентПоставщик, "") + ?(ЗначениеЗаполнено(НомерДоговора), НомерДоговора, "") + ?(ЗначениеЗаполнено(ДатаЗаключения), ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("от") + ДатаЗаключения, "");
	Если ЗначениеЗаполнено(ОграничиваетСуммуЗадолженности) Тогда
		НаименованиеС = НаименованиеС + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке(" на сумму") + " " + ОграничиваетСуммуЗадолженности;
	ИначеЕсли ЗначениеЗаполнено(ОграничиваетСуммуТоваров) Тогда
		НаименованиеС = НаименованиеС + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке(" на сумму товаров") + " " + ОграничиваетСуммуТоваров;
	ИначеЕсли ЗначениеЗаполнено(ОграничиваетКоличествоТоваров) Тогда
		НаименованиеС = НаименованиеС + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке(" на количество товаров") + " " + ОграничиваетКоличествоТоваров;
	ИначеЕсли ЗначениеЗаполнено(ПредусматриваетСтрогиеЦены) Тогда
		НаименованиеС = НаименованиеС + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке(" о Ценах");
	ИначеЕсли ЗначениеЗаполнено(УстанавливаетСрокОплатыВДнях) Тогда
		НаименованиеС = НаименованиеС + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке(" о сроке оплат в") + " " + УстанавливаетСрокОплатыВДнях + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке(" дней");
	КонецЕсли;
	
	Возврат НаименованиеС;
	
КонецФункции

Процедура ПередЗаписью(Отказ)
	
	Если НЕ Отказ 
		И Не ПометкаУдаления Тогда
		
		Если НЕ ЗначениеЗаполнено(Наименование) Тогда		
			АвтоНаменованиеДоговораНаСервере();
		КонецЕсли;
		
		ОбщийМодульСервер.ПроверитьСменуНаименованияНаТекущемЯзыке(Наименование, Ссылка, , Отказ);	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ЭтотОбъект.комментарий = "";
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Клиенты") Тогда
		ВидЦен 			= ДанныеЗаполнения.ВидЦен;
		Комментарий 	= ДанныеЗаполнения.Комментарий;
		Наименование 	= ДанныеЗаполнения.Наименование;
		КлиентПоставщик = ДанныеЗаполнения.Ссылка;
		ХранилищеДенег 	= ДанныеЗаполнения.ХранилищеДенег;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Поставщики") Тогда
		ВидЦен 			= ДанныеЗаполнения.ВидЦен;
		Комментарий 	= ДанныеЗаполнения.Комментарий;
		Наименование 	= ДанныеЗаполнения.Наименование;
		КлиентПоставщик = ДанныеЗаполнения.Ссылка;
		ХранилищеДенег 	= ДанныеЗаполнения.ХранилищеДенег;
	КонецЕсли;
	
КонецПроцедуры
