// sza140411-1659 : 
// sza131116-2308
Функция   АвтоНаменованиеДоговораНаСервере() Экспорт
	
	НаименованиеС = ?(ЗначениеЗаполнено(Организация), Организация + ?(ЗначениеЗаполнено(КлиентПоставщик), " - ", ""), "") + ?(ЗначениеЗаполнено(КлиентПоставщик), КлиентПоставщик, "") + ?(ЗначениеЗаполнено(НомерДоговора), НомерДоговора, "") + ?(ЗначениеЗаполнено(ДатаЗаключения), ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("от") + ДатаЗаключения, "");
	Если ЗначениеЗаполнено(ОграничиваетСуммуЗадолженности) Тогда
		НаименованиеС = НаименованиеС + " " + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("на сумму") + " " + ОграничиваетСуммуЗадолженности;
	ИначеЕсли ЗначениеЗаполнено(ОграничиваетСуммуТоваров) Тогда
		НаименованиеС = НаименованиеС + " " + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("на сумму товаров") + " " + ОграничиваетСуммуТоваров;
	ИначеЕсли ЗначениеЗаполнено(ОграничиваетКоличествоТоваров) Тогда
		НаименованиеС = НаименованиеС + " " + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("на количество товаров") + " " + ОграничиваетКоличествоТоваров;
	ИначеЕсли ЗначениеЗаполнено(ПредусматриваетСтрогиеЦены) Тогда
		НаименованиеС = НаименованиеС + " " + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("о Ценах");
	ИначеЕсли ЗначениеЗаполнено(УстанавливаетСрокОплатыВДнях) Тогда
		НаименованиеС = НаименованиеС + " " + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("о сроке оплат в") + " " + УстанавливаетСрокОплатыВДнях + " " + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("дней");
	КонецЕсли;
	
	Возврат НаименованиеС;
	
КонецФункции

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Клиенты") Тогда
		ВидЦен 			= ДанныеЗаполнения.ВидЦен;
		Комментарий 	= ДанныеЗаполнения.Комментарий;
		Наименование 	= ДанныеЗаполнения.Наименование;
		КлиентПоставщик = ДанныеЗаполнения.Ссылка;
		ХранилищеДенег 	= ДанныеЗаполнения.ХранилищеДенег;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Поставщики") Тогда
		ВидЦен 			= ДанныеЗаполнения.ВидЦен;
		Комментарий 	= ДанныеЗаполнения.Комментарий;
		Наименование 	= ДанныеЗаполнения.Наименование;
		КлиентПоставщик = ДанныеЗаполнения.Ссылка;
		ХранилищеДенег 	= ДанныеЗаполнения.ХранилищеДенег;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если НЕ Отказ 
		И НЕ ПометкаУдаления Тогда
		
		Если НЕ ЗначениеЗаполнено(Наименование) Тогда		
			АвтоНаменованиеДоговораНаСервере();
		КонецЕсли;
		
		ОбщийМодульСервер.ПроверитьСменуНаименованияНаТекущемЯзыке(Наименование, Ссылка, , Отказ);	
		
		Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ФормироватьОписаниеТаблицОбъектовДляИхСписков") Тогда		
			ОбщийМодульСервер.ОформитьОписаниеТаблицы(ЭтотОбъект);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Комментарий = "";
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ЗначениеЗаполнено(КлиентПоставщик)
		И ТипЗнч(КлиентПоставщик) = Тип("СправочникСсылка.Поставщики")
		И НЕ Товары.Количество() = 0
		И ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетЦенПоставщиков") Тогда
		
		Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("00065D", , Отказ, );
		
		Если НЕ Отказ Тогда
			
			ДатаУстановкиЦен = ДатаНачала;
			Если ДатаУстановкиЦен = '00010101' Тогда
				ДатаУстановкиЦен = ДатаЗаключения;
				
				Если ДатаУстановкиЦен = '00010101' Тогда
					ДатаУстановкиЦен = ОбщийМодульСервисСервер.ПользователяТекущаяДата();
				КонецЕсли;
			КонецЕсли;
			
			Для Каждого СтрокаТовара Из Товары Цикл				
				ОбщийМодульСервер.УстановитьЦенуПоставщика(ВидЦен, СтрокаТовара, Ссылка, Комментарий, ДатаУстановкиЦен, КлиентПоставщик);
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры
