//sza140611-1630 Хозяин: 
//sza130902-0532 

&НаКлиенте
Процедура ВзятьСуммуПоДокументу(Команда)
	
	ВзятьСуммуПоДокументуНаСервере();
	РассчитатьЧтоОстанетсяСУчетомПоступления();
	ИзменитьВидДокумента() ;
	
КонецПроцедуры

&НаСервере
Процедура ВзятьСуммуПоДокументуНаСервере(Знач СУчетомДолга = Ложь)
	
	Если РазрешеноПриниматьПриРеализацииДеньгиСразуВНесколькихВалютах Тогда
		
		Объект.Оплаты.Очистить();
		СтрокаОплаты = Объект.Оплаты.Добавить();
		Если ЗначениеЗаполнено(Объект.ВидЦен)
			и ЗначениеЗаполнено(Объект.ВидЦен.ВалютаЦены) Тогда
			
			СтрокаОплаты.Валюта = Объект.ВидЦен.ВалютаЦены;
		КонецЕсли;
		
		СтрокаОплаты.ХранилищеДенег = ПредопределенноеЗначение("Справочник.ХранилищаДенег.ОсновнаяКассаВОсновнойВалюте");
		Если ВестиУчетДенегВНесколькихХранилищах 
			и ЗначениеЗаполнено(СтрокаОплаты.ХранилищеДенег) Тогда
			
			СтрокаОплаты.формаоплаты = СтрокаОплаты.ХранилищеДенег.ФормаОплаты;
		Иначе	
			СтрокаОплаты.формаоплаты = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ФормаОплатыДляДенегВДокументахРасходаИПриходаТоваров");
		КонецЕсли;
		
		СтрокаОплаты.Курс  = ОбщийМодульПовтор.ПолучитьТекущийКурс(СтрокаОплаты.Валюта, Объект.Дата);
		Сумма = Объект.Товары.Итог("Сумма");
		
		СтрокаОплаты.Сумма = Сумма;
		Если СУчетомДолга 
			И НЕ ТекущийДолг = 0 Тогда
			
			Сумма = Сумма + ТекущийДолг;	
		КонецЕсли;
		СтрокаОплаты.Сумма = Сумма;
		
		Если НЕ Объект.ПоступилоДенег = Сумма Тогда
			Объект.ПоступилоДенег = Сумма;
		КонецЕсли;
		
		ОбновитьСуммуОплаты();		
		
	Иначе
		Если ЗначениеЗаполнено(Объект.ВидЦен)
			и ЗначениеЗаполнено(Объект.ВидЦен.ВалютаЦены) Тогда
			
			Объект.Валюта = Объект.ВидЦен.ВалютаЦены;
		КонецЕсли;
		
		Сумма = Объект.Товары.Итог("Сумма");
		
		Если СУчетомДолга 
			И НЕ ТекущийДолг = 0 Тогда
			
			Сумма = Сумма + ТекущийДолг;	
		КонецЕсли;
		
		Если НЕ Объект.ПоступилоДенег = Сумма Тогда
			Объект.ПоступилоДенег = Сумма;
		КонецЕсли;
		
		ПоступилоДенегПоКурсу = ОбщийМодульСервер.ПоКурсу(Объект.ПоступилоДенег, , Объект.Валюта, Объект.Дата);
	КонецЕсли;
	
КонецПроцедуры     

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)          // ПРИ СОЗДАНИИ НА СЕРВЕРЕ
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("001800", ЭтаФорма, Отказ, Объект);
	
	Если НЕ Отказ Тогда
		ОбъектСсылка = Объект.Ссылка;
		
		ДопИнфоТипВладельца = ОбщийМодульПовтор.ПолучитьТипВладельца(ОбъектСсылка); 	
		ОбщийМодульСервисСервер.ЗаполнитьДополнительнуюИнформацию(ОбъектСсылка, ДополнительнаяИнформация, ДопИнфоТипВладельца);
		
		ВестиУчетПоСкладу 	= ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетПоСкладам");
		УчетПоПоставщикам 	= ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетПоПоставщикам");
		УчетПоКлиентам 		= ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетПоКлиентам");
		учетЗаказовКлиентам = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетЗаказовКлиентов");
		УчетПоСериям		= ОбщийМодульПовтор.ПолучитьПараметрСеанса("ВестиУчетПоСериямНоменклатуры");
		ПредставитьДокументРасходаТовараДвумяКолонками  = константы.ПредставитьДокументРасходаТовараДвумяКолонками.Получить(); //без кеширования
		
		СопровождатьНоменклатуруИзображениями		= ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("СопровождатьНоменклатуруИзображениями") ;
		СопровождатьДоговораИзображениями			= ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("СопровождатьДоговораИзображениями") ;
		СопровождатьКлиентовИзображениями			= УчетПоКлиентам И ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("СопровождатьКлиентовИзображениями") ;
		СопровождатьПоставщиковИзображениями		= УчетПоПоставщикам И ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("СопровождатьПоставщиковИзображениями") ;
		СопровождатьОрганизацииИзображениями		= ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("СопровождатьОрганизацииИзображениями") ;
		ПоказыватьИзображения 						= СопровождатьОрганизацииИзображениями ИЛИ СопровождатьПоставщиковИзображениями ИЛИ СопровождатьКлиентовИзображениями ИЛИ СопровождатьДоговораИзображениями ИЛИ СопровождатьНоменклатуруИзображениями;
		
		ФизическоеЛицо 	  = ОбщийМодульПовтор.ЗначениеПредопределенного("Справочники.Клиенты.ФизическоеЛицо");
		ЭтоФизическоеЛицо = объект.КлиентПоставщик 	= ФизическоеЛицо;
		элементы.ЧастныйПокупатель.Видимость 		= УчетПоКлиентам и не ЭтоФизическоеЛицо;
		элементы.ЧастныйПокупатель1.Видимость 		= УчетПоКлиентам и не ЭтоФизическоеЛицо;
		ИспользоватьПодключаемоеОборудование 		= ПодключаемоеОборудованиеДСервер.ИспользоватьПодключаемоеОборудование();
		ИспользоватьСложныйМеханизмЦен 				= ОбщийМодульПовтор.ПолучитьПараметрСеанса("ИспользоватьСложныйМеханизмЦенПС");
		ВестиУчетДенегВНесколькихХранилищах 		= ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетДенегВНесколькихХранилищах");
		Элементы.ОплатаФормаОплаты.Видимость 		= НЕ ВестиУчетДенегВНесколькихХранилищах;
		ИспользоватьРегистрациюПриемаИВыдачиДенегПрямоВДокументахРасходаИПрихода = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ИспользоватьРегистрациюПриемаИВыдачиДенегПрямоВДокументахРасходаИПрихода") ;
		РазрешеноПриниматьПриРеализацииДеньгиСразуВНесколькихВалютах = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("РазрешеноПриниматьПриРеализацииДеньгиСразуВНесколькихВалютах");
		Элементы.ГруппаПоступилоДенег.Видимость 	= ИспользоватьРегистрациюПриемаИВыдачиДенегПрямоВДокументахРасходаИПрихода И НЕ РазрешеноПриниматьПриРеализацииДеньгиСразуВНесколькихВалютах;
		Элементы.ГруппаПоступилоДенег1.Видимость 	= ИспользоватьРегистрациюПриемаИВыдачиДенегПрямоВДокументахРасходаИПрихода И НЕ РазрешеноПриниматьПриРеализацииДеньгиСразуВНесколькихВалютах;	
		Элементы.МногоСтрочнаяОплата.Видимость		= ИспользоватьРегистрациюПриемаИВыдачиДенегПрямоВДокументахРасходаИПрихода И РазрешеноПриниматьПриРеализацииДеньгиСразуВНесколькихВалютах;
		Элементы.ШАПКАОплата1.Видимость				= ИспользоватьРегистрациюПриемаИВыдачиДенегПрямоВДокументахРасходаИПрихода И РазрешеноПриниматьПриРеализацииДеньгиСразуВНесколькихВалютах;
		
		ИспользоватьСкидки 		= ОбщийМодульПовтор.ПолучитьПараметрСеанса("ИспользоватьСкидкиПС");	
		ИспользоватьУчетВалют 	= ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетДвиженияДенег") и ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетВалют");
		ПоступилоРавноСумме 	= ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ОбычноРеализацияОзначаетЧтоДеньгиОтКлиентаПолучены") ;
		ВестиУчетДвиженияДенег 	= ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетДвиженияДенег");
		
		ПоказыватьКнопкуПечатиГарантийногоТаблонаВРасходномДокументе = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ПоказыватьКнопкуПечатиГарантийногоТаблонаВРасходномДокументе");
		Элементы.ПечатьГарантийногоТалона.Видимость = ПоказыватьКнопкуПечатиГарантийногоТаблонаВРасходномДокументе;
		Элементы.ПечатьГарантийногоТалона1.Видимость= ПоказыватьКнопкуПечатиГарантийногоТаблонаВРасходномДокументе;
		
		элементы.ТоварыВводСКоличеством.Видимость   = не ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("НеПоказыватьКомандуДобавленияНоменклатурыСКоличеством") ;
		элементы.ТоварыВводСКоличеством1.Видимость  = не ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("НеПоказыватьКомандуДобавленияНоменклатурыСКоличеством") ;
		Элементы.ВидЦенВалютаЦены.Видимость 		= ИспользоватьСложныйМеханизмЦен;
		
		ПоказыватьСуммуРасходногоДокументаТакжеВВалюте 	= ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ПоказыватьСуммуРасходногоДокументаТакжеВВалюте");
		Элементы.СуммаВДругойВалюте.Видимость  		= ИспользоватьУчетВалют и ЗначениеЗаполнено(ПоказыватьСуммуРасходногоДокументаТакжеВВалюте);
		Элементы.СуммаВДругойВалюте1.Видимость 		= ИспользоватьУчетВалют и ЗначениеЗаполнено(ПоказыватьСуммуРасходногоДокументаТакжеВВалюте);
		
		ВестиДополнительнуюИнформациюДляРасхода		= ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиДополнительнуюИнформациюДляРасхода");
		Элементы.ГруппаДополнительнаяИнформация.Видимость  = ВестиДополнительнуюИнформациюДляРасхода;
		Элементы.ГруппаДополнительнаяИнформация1.Видимость = ВестиДополнительнуюИнформациюДляРасхода;
		
		ИспользуетсяДатаКомиссии = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("УчетТоваровПереданныхОтНасКомиссионерамДляКомиссионнойТорговли")
		И ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("КомиссионерыОтчитываютсяПоОтдельнымДокументамПередачиНаКоммиссию");
		Элементы.ДатаОтчетаПоКомиссии.Видимость 	= ИспользуетсяДатаКомиссии;
		Элементы.ДатаОтчетаПоКомиссии1.Видимость 	= ИспользуетсяДатаКомиссии;
		
		ПечататьЧек = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ПечататьЧек");
		Элементы.ПечатьЧека.Видимость	= ПечататьЧек;
		Элементы.ПечатьЧека1.Видимость	= ПечататьЧек;
		
		РедактироватьАдресИТелефонКлиентаПрямоВДокументахРеализации = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("РедактироватьАдресИТелефонКлиентаПрямоВДокументахРеализации");
		
		Если ИспользоватьПодключаемоеОборудование ТОгда
			ФР = ПодключаемоеОборудованиеДСервер.ВернутьИдентификаторУстройстваФР();	
			Дисплеи.ЗагрузитьЗначения(МенеджерОборудованияВызовСервера.ПолучитьСписокОборудования("ДисплейПокупателя", , МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента()));	
		Иначе
			ФР = "";
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.КлиентПоставщик) Тогда
			Объект.КлиентПоставщик = Параметры.КлиентПоставщик;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ОбъектСсылка) Тогда
			
			Если не ЗначениеЗаполнено(Объект.ХранилищеДенег) Тогда
				Объект.ХранилищеДенег = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ОсновноеХранилищеДенег") ;
				Если не ЗначениеЗаполнено(Объект.ХранилищеДенег) Тогда
					Объект.ХранилищеДенег = ОбщийМодульПовтор.ЗначениеПредопределенного("Справочники.ХранилищаДенег.ОсновнаяКассаВОсновнойВалюте") ;
				КонецЕсли;
			КонецЕсли;
			
			если не ЗначениеЗаполнено(Объект.КлиентПоставщик) тогда
				Если НЕ УчетПоКлиентам Тогда
					Объект.КлиентПоставщик = ФизическоеЛицо ;
				Иначе
					Объект.КлиентПоставщик = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("КлиентПоУмолчанию");
				КонецЕсли;                    	
			КонецЕсли;
			ДемонстрироватьИнформационнуюКолонкуОстатокТовараСУчетомДокументаВНепроведенныхДокументах = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ДемонстрироватьИнформационнуюКолонкуОстатокТовараСУчетомДокументаВНепроведенныхДокументах");
			
			Объект.Дата = ОбщийМодульСервисСервер.ПользователяТекущаяДата();
			
			КлиентПриИзмененииНаСервере(Истина);
			Если НЕ ЗначениеЗаполнено(Объект.Валюта) Тогда
				Объект.Валюта = ОбщийМодульПовтор.ЗначениеПредопределенного("Справочники.Валюты.ОсновнаяВалюта") ;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Объект.Склад ) Тогда
				Объект.Склад = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("СкладПоУмолчанию");		
				Если НЕ ЗначениеЗаполнено(Объект.Склад) Тогда
					Объект.Склад = ОбщийМодульПовтор.ЗначениеПредопределенного("Справочники.Склады.ОсновнойСклад") ;
				КонецЕсли;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Объект.ВидЦен ) Тогда
				Объект.ВидЦен = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВидЦенРасходованияПоУмолчанию") ;	
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Объект.КлиентПоставщик)
				и ЗначениеЗаполнено(Объект.КлиентПоставщик.ВидЦен) Тогда
				
				Объект.ВидЦен = Объект.КлиентПоставщик.ВидЦен;
			КонецЕсли;		
			
			объект.Курс = ОбновитьКурс(Объект.Валюта, Объект.Дата);	
			элементы.Курс.Видимость  = не объект.Курс = 1 и ИспользоватьУчетВалют;
			элементы.Курс1.Видимость = элементы.Курс.Видимость;
			
			Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
				Объект.Организация = ОбщийМодульПовтор.ЗначениеПредопределенного("Справочники.Организации.ОсновноеПредприятие");
			КонецЕсли;
			
			Если ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетПродажПоСотрудникам")
				и не ЗначениеЗаполнено(Объект.Сотрудник) Тогда
				
				Объект.Сотрудник = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("СотрудникРеализацииПоУмолчанию") ;
			КонецЕсли;
			
			Если ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ИспользоватьМеханизмОтсрочкиПлатежа")
				И не ЗначениеЗаполнено(Объект.ДатаОтсрочки) Тогда
				
				Объект.ДатаОтсрочки = Объект.Дата + ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ЧислоДнейОтсрочкиКлиентамПоУмолчанию") * 3600 * 24;
			КонецЕсли;
			
			ОбновитьДатуОтсрочки();
			
		Иначе
			Если не объект.Проведен тогда
				объект.Курс = ОбновитьКурс(Объект.Валюта, Объект.Дата);	
			КонецЕсли;
			элементы.Курс.Видимость  = не объект.Курс = 1 и ИспользоватьУчетВалют;
			элементы.Курс1.Видимость = элементы.Курс.Видимость;
			
			ПоступилоДенегПоКурсу 	 = ОбщийМодульСервер.ПоКурсу(Объект.ПоступилоДенег, , Объект.Валюта, Объект.Дата);
			ДемонстрироватьИнформационнуюКолонкуОстатокТовараСУчетомДокументаВНепроведенныхДокументах = Ложь;
			
			ПроверитьДатуРождения();
			
			Если РазрешеноПриниматьПриРеализацииДеньгиСразуВНесколькихВалютах Тогда
				ОбновитьСуммуОплаты();
			КонецЕсли;
		КонецЕсли;   
		
		ВидЦенПриИзмененииНаСервере(Истина);
		
		ОдинДокументПриходаИлиРасходаТовараМожетБытьОформленДляНесколькихЗаказов = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ОдинДокументПриходаИлиРасходаТовараМожетБытьОформленДляНесколькихЗаказов");
		
		Элементы.ТоварыОстатокСУчетомДокумента.Видимость 	= ДемонстрироватьИнформационнуюКолонкуОстатокТовараСУчетомДокументаВНепроведенныхДокументах;
		Элементы.ТоварыОстатокСУчетомДокумента1.Видимость 	= ДемонстрироватьИнформационнуюКолонкуОстатокТовараСУчетомДокументаВНепроведенныхДокументах;
		
		ПроверкаВидаОтображенияДокумента();	
		
		Если ЗначениеЗаполнено(Параметры.Номенклатура) Тогда
			
			СтруктураНоменклатура = новый структура;
			СтруктураНоменклатура.Вставить("Номенклатура" , Параметры.Номенклатура);
			СтруктураНоменклатура.Вставить("Количество" , Параметры.Количество);
			СтруктураНоменклатура.Вставить("ЕдиницаИзмерения", Параметры.ЕдиницаИзмерения);
			Если СтруктураНоменклатура.Количество 	= 0 Тогда
				СтруктураНоменклатура.Количество 	= 1;
			КонецЕсли;
			СтруктураНоменклатура.Вставить("Цена" , Параметры.Цена);		
			Если СтруктураНоменклатура.Цена = 0 Тогда
				СтруктураНоменклатура.Цена 	= ОбщийМодульСервер.ПолучитьЦенуНаСервере(Параметры.Номенклатура, Объект.ВидЦен, Объект.Дата, истина, СтруктураНоменклатура.Количество, Объект.Договор, , , Объект.Ссылка);
			КонецЕсли;
			
			ДобавитьПозициюНоменклатуры(СтруктураНоменклатура);
			
		КонецЕсли;
		
		Если ОбщийМодульПовтор.ПолучитьПараметрСеанса("НеМожетМенятьЦены") тогда
			
			если ЗначениеЗаполнено(объект.ВидЦен) Тогда
				элементы.ВидЦен.Доступность 	= ложь;	
				элементы.ВидЦен1.Доступность 	= ложь;	
			КонецЕсли;
			
			элементы.ТоварыЦена.Доступность 	= Ложь;
			элементы.ТоварыСумма.Доступность 	= Ложь;
			элементы.ТоварыЦена1.Доступность 	= Ложь;
			элементы.ТоварыСумма1.Доступность 	= Ложь;
			элементы.ТоварыПроцентСкидки1.Доступность = Ложь;
			элементы.ТоварыПроцентСкидки.Доступность  = Ложь;
			
		КонецЕсли;	
		
		НаименованиеОсновнойВалюты = сокрлп(ПредопределенноеЗначение("Справочник.Валюты.ОсновнаяВалюта").Наименование) ;
		элементы.ОстанетсяСУчетомПоступления.Заголовок 	= ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Долг с учетом поступления") + " (" + НаименованиеОсновнойВалюты + ")";
		элементы.ОстанетсяСУчетомПоступления.Видимость 	= ВестиУчетДвиженияДенег и (УчетПоКлиентам или УчетПоПоставщикам) и не ОстанетсяСУчетомПоступления = 0;
		элементы.ОстанетсяСУчетомПоступления1.Заголовок = элементы.ОстанетсяСУчетомПоступления.Заголовок;
		элементы.ОстанетсяСУчетомПоступления1.Видимость = элементы.ОстанетсяСУчетомПоступления.Видимость;
		
		элементы.НаименованиеОсновнойВалюты.Видимость 	= ВестиУчетДвиженияДенег и не ИспользоватьУчетВалют;
		элементы.НаименованиеОсновнойВалюты2.Видимость 	= ВестиУчетДвиженияДенег и не ИспользоватьУчетВалют;
		
		ВалютаПродажВидимость    						= ИспользоватьУчетВалют и не Объект.ТовараНаСумму = 0;
		элементы.ВалютаПродаж.Видимость 				= ВалютаПродажВидимость;	
		элементы.ВалютаПродаж1.Видимость 				= ВалютаПродажВидимость;
		
		элементы.ТоварыСумма.ТолькоПросмотр 			= не ИспользоватьСкидки;	
		элементы.ТоварыСумма1.ТолькоПросмотр 			= не ИспользоватьСкидки;
		
		Если не УчетПоКлиентам 
			и не УчетПоПоставщикам Тогда
			
			элементы.УкажитеВидДокумента.Видимость 	= истина;
			элементы.УкажитеВидДокумента1.Видимость = истина;
			
			Если ЗначениеЗаполнено(объект.КлиентПоставщик) Тогда
				Если ТипЗнч(объект.КлиентПоставщик) = Тип("СправочникСсылка.Клиенты") Тогда
					УкажитеВидДокумента = Перечисления.ВидыДокументаРасходаТовара.Реализация ;
				иначе	
					УкажитеВидДокумента = Перечисления.ВидыДокументаРасходаТовара.ВозвратПоставщику ;
				КонецЕсли;
				
			иначе
				УкажитеВидДокумента = Перечисления.ВидыДокументаРасходаТовара.Списание;
			КонецЕсли;
			
			элементы.ВидДокумента.Видимость  = ложь;
			элементы.ВидДокумента1.Видимость = ложь;
			
		Иначе
			элементы.УкажитеВидДокумента.Видимость 	= ложь;
			элементы.УкажитеВидДокумента1.Видимость = ложь;
			
		КонецЕсли;
		
		ОбновитьЧастыйСпрос();	
		ИзменитьВидДокумента() ;
		ПоказатьДолгКлиентаПоставщика();	
		
		СерииНоменклатурыВидны = ОбщийМодульТоварСервер.ПроверитьНаличиеСерийНоменклатуры(Объект.Ссылка);
		Элементы.ТоварыСерияНоменклатуры.Видимость  = СерииНоменклатурыВидны;
		Элементы.ТоварыСерияНоменклатуры1.Видимость = СерииНоменклатурыВидны;
		Элементы.ТоварыЗаказКлиента.Видимость 		= учетЗаказовКлиентам и ЭтоКлиент И ОдинДокументПриходаИлиРасходаТовараМожетБытьОформленДляНесколькихЗаказов;
		Элементы.Товары1ЗаказКлиента.Видимость 		= учетЗаказовКлиентам и ЭтоКлиент И ОдинДокументПриходаИлиРасходаТовараМожетБытьОформленДляНесколькихЗаказов;
		Элементы.ЗаказКлиента.Видимость 			= учетЗаказовКлиентам и ЭтоКлиент;
		Элементы.ЗаказКлиента1.Видимость 			= учетЗаказовКлиентам и ЭтоКлиент;
		
		Элементы.ТоварыПодборНоменклатуры.Видимость  = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВключитьМеханизмПодбораНоменклатуры");
		Элементы.Товары1ПодборНоменклатуры.Видимость = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВключитьМеханизмПодбораНоменклатуры");
		
		ОбщийМодульСервисСервер.ОформитьФорматКоличества(Элементы.ТоварыИтогКоличество, , Истина);
		ОбщийМодульСервисСервер.ОформитьФорматКоличества(Элементы.ТоварыИтогКоличество1, , Истина);
		ОбщийМодульСервисСервер.ОформитьФорматКоличества(Элементы.ТоварыКоличество);
		ОбщийМодульСервисСервер.ОформитьФорматКоличества(Элементы.ТоварыКоличество1);
		ОбщийМодульСервисСервер.ОформитьФорматКоличества(Элементы.ТоварыОстатокСУчетомДокумента);
		ОбщийМодульСервисСервер.ОформитьФорматКоличества(Элементы.ТоварыОстатокСУчетомДокумента1);	
		
		Если ВестиУчетДвиженияДенег ТОгда
			
			СтруктураОтказа = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("000892", , , , Истина);
			Если СтруктураОтказа.УровеньДоступа = Перечисления.УровниДоступа.ТолькоЧтение Тогда
				Элементы.ГруппаПоступилоДенег.ТолькоПросмотр = Истина;
				Элементы.МногоСтрочнаяОплата.ТолькоПросмотр	 = Истина;
				Элементы.ГруппаПоступилоДенег1.ТолькоПросмотр= Истина;
				Элементы.ШАПКАОплата1.ТолькоПросмотр 		 = Истина;
				Элементы.ВзятьСуммуПоДокументу.Видимость 	 = Ложь;
				Элементы.ОплатаВзятьСуммуПоДокументу.Видимость 	= Ложь;
				Элементы.Оплата1ВзятьСуммуПоДокументу.Видимость	= Ложь;
				Элементы.ВзятьСуммуПоДокументу1.Видимость 	 = Ложь;
				
			ИначеЕсли СтруктураОтказа.Отказ Тогда
				Элементы.ГруппаПоступилоДенег.Видимость 	= Ложь;
				Элементы.МногоСтрочнаяОплата.Видимость 		= Ложь;
				Элементы.ГруппаПоступилоДенег1.Видимость 	= Ложь;
				Элементы.ШАПКАОплата1.Видимость 		 	= Ложь;
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЧастыйСпрос()
	
	
	ТоварыЧастогоСпроса = ОбщийМодульПовтор.ПолучитьСписокНоменклатурыБыстрогоСпроса(ложь).Выгрузить();
	
	если не ТоварыЧастогоСпроса.Количество() = 0 тогда
		ПоказыватьКнопкиДобавленияНоменклатурыЧастогоСпроса = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ПоказыватьКнопкиДобавленияНоменклатурыЧастогоСпроса");
		
		если ПоказыватьКнопкиДобавленияНоменклатурыЧастогоСпроса тогда
			элементыТоварыЧастогоСпроса 	= элементы.ГруппаКомандНоменклатурыЧастогоСпроса;
			элементыТоварыЧастогоСпроса1 	= элементы.ГруппаКомандНоменклатурыЧастогоСпроса1;
			
			НоваяДекорация = Элементы.найти("ЗаголовокЧастогоСпроса");
			если НоваяДекорация = неопределено тогда
				НоваяДекорация = Элементы.Добавить("ЗаголовокЧастогоСпроса", тип("ДекорацияФормы"), элементыТоварыЧастогоСпроса);
				НоваяДекорация.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Частый спрос:");
			конецесли;
			
			НоваяДекорация = Элементы.найти("ЗаголовокЧастогоСпроса1");
			если НоваяДекорация = неопределено тогда
				НоваяДекорация = Элементы.Добавить("ЗаголовокЧастогоСпроса1", тип("ДекорацияФормы"), элементыТоварыЧастогоСпроса1);
				НоваяДекорация.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Частый спрос:");
			конецесли;
			элементыТоварыЧастогоСпроса.Видимость  = Истина;
			элементыТоварыЧастогоСпроса1.Видимость = Истина;
			
		иначе
			элементыТоварыЧастогоСпроса 	= элементы.ТоварыЧастогоСпроса;
			элементыТоварыЧастогоСпроса1 	= элементы.ТоварыЧастогоСпроса1;
		конецесли;	
		
		Для каждого товар из ТоварыЧастогоСпроса цикл
			
			позиция 		= товар.позиция;
			комментарий 	= товар.комментарий;
			номенклатура 	= товар.номенклатура;
			
			КомандаФормы  = команды.Найти("К" + позиция);
			если КомандаФормы  = неопределено тогда
				
				КомандаФормы  = Команды.Добавить("К" + позиция);
				КомандаФормы.Действие = "ПроцедураОбработкиНажатия";
				если позиция < 10 тогда
					КомандаФормы.СочетаниеКлавиш = Новый СочетаниеКлавиш(Клавиша["_" + сокрлп(позиция)], , Истина, Истина) ;	
				КонецЕсли;
				
				Если ЗначениеЗаполнено(комментарий) Тогда
					КомандаФормы.Подсказка = комментарий;
				Иначе
					КомандаФормы.Подсказка = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Добавить") + " " + номенклатура;
				КонецЕсли;
				
				НоваяКнопка = элементы.Найти("КФ" + позиция);
				если НоваяКнопка = неопределено тогда
					НоваяКнопка = элементы.Добавить("КФ" + позиция, тип("КнопкаФормы"), элементыТоварыЧастогоСпроса);		
					НоваяКнопка.Заголовок = сокрлп(номенклатура);
					НоваяКнопка.ИмяКоманды = "К" + позиция;		
				Конецесли;
				
				НоваяКнопка = элементы.Найти("КБ" + позиция);
				если НоваяКнопка = неопределено тогда
					НоваяКнопка = элементы.Добавить("КБ" + позиция, тип("КнопкаФормы"), элементыТоварыЧастогоСпроса1);		
					НоваяКнопка.Заголовок = сокрлп(номенклатура);
					НоваяКнопка.ИмяКоманды = "К" + позиция;			
				КонецЕсли;
			конецесли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроцедураОбработкиНажатия(Элемент)
	
	Позиция = число(стрзаменить(Элемент.Имя, "К", ""));
	ДобавлениеЧастогоСпроса(Позиция);
	
КонецПроцедуры  

&НаСервере
Процедура ДобавлениеЧастогоСпроса(Знач Позиция)
	ДобавитьПозициюНоменклатуры(ОбщийМодульПовтор.ПолучитьНоменклатуруБыстрогоСпроса(Позиция));
КонецПроцедуры

&НаСервере
процедура ПроверкаВидаОтображенияДокумента() 
	
	Элементы.ВнешнийВидВертикаль.видимость 	= не ПредставитьДокументРасходаТовараДвумяКолонками;	
	Элементы.ВнешнийВидГоризонт.видимость 	= ПредставитьДокументРасходаТовараДвумяКолонками;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВводШтрихКода(Команда)
	
	ТекКод = "";
	Если ВвестиШтрихКод(ТекКод) Тогда
		если не ОбработатьПолученныйШКНаСервере(ТекКод) тогда
			ОбщийМодульКлиент.ВыдатьСигнал();
		иначе
			
			ПересчитатьДокументНаКлиенте();   		
		КонецЕсли;
	КонецЕсли;                              	
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПозициюНоменклатуры(Знач НоменклатураВх, Знач НеСтановитсяНаЭтуСтроку = Ложь, Знач множительКоличества = 1)
	
	СерияНоменклатуры = Неопределено;
	ЕдиницаИзмерения  = Неопределено;
	
	Если ТипЗнч(НоменклатураВх) = Тип("СправочникСсылка.Номенклатура") Тогда  		
		Номенклатура = НоменклатураВх;
		Количество 	 = множительКоличества * ОбщийМодульСервер.ПолучитьКоличествоПоУмолчанию(НоменклатураВх);
		Цена 		 = 0;
		ЦенаЕсть 	 = Ложь;
		
	Иначе
		Номенклатура = НоменклатураВх.Номенклатура;
		Количество 	 = НоменклатураВх.Количество * множительКоличества * ОбщийМодульСервер.ПолучитьКоличествоПоУмолчанию(НоменклатураВх.Номенклатура);
		НоменклатураВх.Свойство("СерияНоменклатуры", СерияНоменклатуры);
		НоменклатураВх.Свойство("ЕдиницаИзмерения", ЕдиницаИзмерения);
		Цена 		 = 0;
		ЦенаЕсть 	 = НоменклатураВх.Свойство("Цена", Цена);
		
	КонецЕсли; 
	ТоварВедетсяПоСериям = УчетПоСериям И ОбщийМодульПовтор.ТоварВедетсяПоСериям(Номенклатура) и ЗначениеЗаполнено(СерияНоменклатуры);
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Номенклатура", Номенклатура);
	
	Если ТоварВедетсяПоСериям Тогда
		ПараметрыОтбора.Вставить("СерияНоменклатуры", СерияНоменклатуры);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЕдиницаИзмерения) Тогда
		ПараметрыОтбора.Вставить("ЕдиницаИзмерения", ЕдиницаИзмерения);
	КонецЕсли;
	
	СтрокаТовара = Объект.Товары.НайтиСтроки(ПараметрыОтбора);
	если не ДокументЗаблокирован Тогда
		
		Если СтрокаТовара.Количество() = 0 Тогда
			СтрокаТовара = Объект.Товары.Добавить();				
			СтрокаТовара.Номенклатура = Номенклатура;
			СтрокаТовара.ЕдиницаИзмерения = ЕдиницаИзмерения;
			
			Если ТоварВедетсяПоСериям 
				И НЕ СерииНоменклатурыВидны Тогда
				
				СерииНоменклатурыВидны = Истина;		
				Элементы.ТоварыСерияНоменклатуры.Видимость 	= Истина;
				Элементы.ТоварыСерияНоменклатуры1.Видимость = Истина;	
			КонецЕсли;
			
		иначе
			СтрокаТовара = СтрокаТовара[0];
		КонецЕсли;		
		
		СтрокаТовара.Количество = СтрокаТовара.Количество + Количество;
		если ТоварВедетсяПоСериям тогда
			
			СтрокаТовара.Количество = 1;
			СтрокаТовара.серияНоменклатуры = серияНоменклатуры;	
			
		конецесли;
		
		если ЦенаЕсть тогда
			СтрокаТовара.Цена = Цена;
		Иначе			
			СтрокаТовара.Цена = ПолучитьЦенуНаСервере(СтрокаТовара.Номенклатура, Строкатовара.Количество, СтрокаТовара.ЕдиницаИзмерения);
		КонецЕсли;		
		
		Если ИспользоватьСкидки Тогда
			СтрокаТовара.ПроцентСкидки = ОбщийМодульСервер.ПолучитьПроцентСкидкиНаСервере(Номенклатура, строкатовара.Количество, объект.ВидЦен, объект.КлиентПоставщик);	
		КонецЕсли;
		
		пересчитатьСтрокуНаСервере(СтрокаТовара);	
		
		если не НеСтановитсяНаЭтуСтроку тогда
			Элементы.Товары.ТекущаяСтрока 	= СтрокаТовара.ПолучитьИдентификатор();
			Элементы.Товары.ТекущийЭлемент 	= элементы.ТоварыКоличество;			
		КонецЕсли;
		
	иначеЕсли не НеСтановитсяНаЭтуСтроку
		И НЕ СтрокаТовара.Количество() = 0 Тогда //Встать на строку
		
		СтрокаТовара = СтрокаТовара[0];
		Элементы.Товары.ТекущаяСтрока 	= СтрокаТовара.ПолучитьИдентификатор();
		Элементы.Товары.ТекущийЭлемент 	= элементы.ТоварыКоличество;		
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция   ПроверитьСменуТипа()
	
	Если ЗначениеЗаполнено(Объект.КлиентПоставщик) ТОгда
		
		ПересчитатьНасильно = Ложь;
		
		//сменился тип - сменим вид цен насильно	
		СталоКлиентом = ТипЗнч(Объект.КлиентПоставщик) = Тип("СправочникСсылка.Клиенты");
		
		Если ЭтоРасчетысПоставщиком 
			и СталоКлиентом Тогда
			
			Если ЗначениеЗаполнено(Объект.КлиентПоставщик.ВидЦен) Тогда
				Объект.ВидЦен = Объект.КлиентПоставщик.ВидЦен;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(Объект.ВидЦен) Тогда
				Объект.ВидЦен = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВидЦенРасходованияПоУмолчанию") ;
			КонецЕсли;
			ПересчитатьНасильно = Истина;
			
		ИначеЕсли НЕ ЭтоРасчетысПоставщиком 
			и НЕ СталоКлиентом Тогда
			
			Если ЗначениеЗаполнено(Объект.КлиентПоставщик.ВидЦен) Тогда
				Объект.ВидЦен = Объект.КлиентПоставщик.ВидЦен;
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(Объект.ВидЦен) Тогда
				Объект.ВидЦен = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВидЦенПриходованияТовараПоУмолчанию") ;
			КонецЕсли;
			ПересчитатьНасильно = Истина;
			
		КонецЕсли;
		
		Если ПересчитатьНасильно Тогда
			Для Каждого СтрокаТовара Из Объект.Товары Цикл
				
				//Если ИспользоватьСложныйМеханизмЦен Тогда
				СтрокаТовара.Цена = ПолучитьЦенуНаСервере(СтрокаТовара.Номенклатура, СтрокаТовара.Количество, СтрокаТовара.ЕдиницаИзмерения);
				//Иначеесли ЗначениеЗаполнено(СтрокаТовара.Номенклатура) тогда
				//	СтрокаТовара.Цена = СтрокаТовара.Номенклатура.Цена;
				//КонецЕсли;
				//
				Если ИспользоватьСкидки Тогда
					СтрокаТовара.СуммаБезСкидки = СтрокаТовара.Количество * СтрокаТовара.Цена;
					если не СтрокаТовара.СуммаБезСкидки = 0 тогда
						СтрокаТовара.Сумма = СтрокаТовара.СуммаБезСкидки - СтрокаТовара.ПроцентСкидки * СтрокаТовара.СуммаБезСкидки / 100;
					иначе
						СтрокаТовара.Сумма = 0;
					КонецЕсли;	
				иначе
					СтрокаТовара.Сумма = СтрокаТовара.Количество * СтрокаТовара.Цена;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;   	
		
		Возврат Истина;
		
	Иначе //не заполнено - выбрали тип
		Если НЕ УчетПоПоставщикам
			И ТипЗнч(Объект.КлиентПоставщик) = Тип("СправочникСсылка.Поставщики") Тогда
			
			Объект.КлиентПоставщик = Справочники.Поставщики.ФизическоеЛицо ;
			
			Возврат Ложь;
			
		ИначеЕсли НЕ УчетПоКлиентам
			И ТипЗнч(Объект.КлиентПоставщик) = Тип("СправочникСсылка.Клиенты") Тогда
			
			Объект.КлиентПоставщик = Справочники.Клиенты.ФизическоеЛицо;
			
			Возврат Ложь;
			
		КонецЕсли;
		
		Возврат Истина;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
процедура ПоказатьДолгКлиентаПоставщика()
	
	ТекущийДолг = ОбщийМодульСервер.ПолучитьДолгКлиентаПоставщика(Объект.КлиентПоставщик, Объект.Дата - 1);
	ТекущийДолг = ОбщийМодульСервер.ПоКурсу(ТекущийДолг, ВалютаПродаж, Объект.Валюта, Объект.Дата);
	Видимость   = не ТекущийДолг = 0 и ЗначениеЗаполнено(Объект.КлиентПоставщик) и (УчетПоКлиентам или УчетПоПоставщикам);
	
	элементы.ТекущийДолг.Видимость 	= Видимость;
	элементы.ТекущийДолг1.Видимость = Видимость;
	элементы.ВзятьСуммуСУчетомДолгаКлиента.видимость 	= Видимость;
	элементы.ВзятьСуммуСУчетомДолгаКлиента1.видимость 	= Видимость;
	
КонецПроцедуры

&НаСервере
Процедура КлиентПриИзмененииНаСервере(Знач НеПересчитыватьТаблицу = Ложь)
	
	элементы.ЧастныйПокупатель.Видимость 	= УчетПоКлиентам и не объект.КлиентПоставщик = ФизическоеЛицо;
	элементы.ЧастныйПокупатель1.Видимость 	= УчетПоКлиентам и не объект.КлиентПоставщик = ФизическоеЛицо;
	
	Элементы.ДатаРождения.Видимость 		= Ложь;
	Элементы.ДатаРождения1.Видимость 		= Ложь;
	Элементы.ДатаРожденияСкидка.Видимость 	= Ложь;
	Элементы.ДатаРожденияСкидка1.Видимость 	= Ложь;
	
	Если ЗначениеЗаполнено(Объект.КлиентПоставщик) ТОгда
		
		ПроверитьДатуРождения();
		
		Если НЕ НеПересчитыватьТаблицу Тогда
			Если ИспользоватьУчетВалют
				и ЗначениеЗаполнено(Объект.КлиентПоставщик.ОсновнаяВалюта) Тогда
				
				Объект.Валюта = Объект.КлиентПоставщик.ОсновнаяВалюта;
			КонецЕсли;	
			
			Если ЗначениеЗаполнено(Объект.КлиентПоставщик.ВидЦен) Тогда
				Объект.ВидЦен = Объект.КлиентПоставщик.ВидЦен;
			КонецЕсли;
			
			Если не ЗначениеЗаполнено(объект.Склад)
				и ЗначениеЗаполнено(объект.КлиентПоставщик.Склад) Тогда
				
				объект.Склад = объект.КлиентПоставщик.Склад;
			КонецЕсли;
			
			Если ИспользоватьСкидки Тогда
				Для Каждого СтрокаТовара из Объект.Товары Цикл
					СтрокаТовара.ПроцентСкидки = ОбщийМодульСервер.ПолучитьПроцентСкидкиНаСервере(СтрокаТовара.Номенклатура, СтрокаТовара.Количество, объект.ВидЦен, объект.КлиентПоставщик);
					
					пересчитатьСтрокуНаСервере(СтрокаТовара);
				КонецЦикла;		
			КонецЕсли;
			
			Если ОбщийМодульПовтор.ПолучитьПараметрСеанса("ВестиУчетОтдельныхДоговоровСКонтрагентамиПС")
				И НЕ ЗначениеЗаполнено(Объект.Договор) 
				ИЛИ не объект.Договор.КлиентПоставщик = Объект.КлиентПоставщик Тогда			
				
				Объект.Договор = ОбщийМодульСервер.ПодобратьДоговор(Объект.Организация, Объект.КлиентПоставщик, Объект.Дата, Объект.ВидЦен);
			КонецЕсли;	
			
			Если РедактироватьАдресИТелефонКлиентаПрямоВДокументахРеализации Тогда
				Объект.Адрес   = Объект.КлиентПоставщик.Адрес;
				Объект.Телефон = Объект.КлиентПоставщик.Телефон;
			КонецЕсли; 	
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.КлиентПоставщик.СпособДоставки) Тогда
			Объект.СпособДоставки = Объект.КлиентПоставщик.СпособДоставки;
		КонецЕсли;
		
	Иначе
		ПроцентСкидки = 0;
		Если НЕ НеПересчитыватьТаблицу
			И РедактироватьАдресИТелефонКлиентаПрямоВДокументахРеализации Тогда
			
			Если НЕ Объект.Адрес = "" Тогда
				Объект.Адрес = "";	
			КонецЕсли;
			Если НЕ Объект.Телефон = "" Тогда
				Объект.Телефон = "";	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьДатуОтсрочки();
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьДатуРождения()
	
	Если ТипЗнч(Объект.КлиентПоставщик) = Тип("СправочникСсылка.Клиенты") Тогда
		ДатаРождения = Объект.КлиентПоставщик.ДатаРождения;
		
		Если ЗначениеЗаполнено(ДатаРождения) 
			и Месяц(ДатаРождения) = Месяц(Объект.Дата)
			и День(ДатаРождения) = День(Объект.Дата) Тогда
			
			Если ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("РазмерСкидкиНаДатаРождения") = 0 Тогда
				Элементы.ДатаРождения.Видимость 	= Истина;
				Элементы.ДатаРождения1.Видимость 	= Истина;
			Иначе
				Элементы.ДатаРожденияСкидка.Видимость 	= Истина;
				Элементы.ДатаРожденияСкидка1.Видимость 	= Истина;
			КонецЕсли;
		КонецЕсли;          	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
процедура ДобавитьВсеЭлементыСостава(Знач Номенклатура, Состав, Знач Количество)
	
	Для Каждого СтрокаНабора Из Номенклатура.Состав Цикл
		
		если ОбщийМодульПовтор.ЭтоНабор(Номенклатура) тогда
			ДобавитьВсеЭлементыСостава(СтрокаНабора.Номенклатура, Состав, Количество)
			
		иначе
			СтрокаСостава = состав.добавить();
			СтрокаСостава.Номенклатура 		= СтрокаНабора.Номенклатура;
			СтрокаСостава.Количество 		= СтрокаНабора.Количество * Количество;
			СтрокаСостава.СерияНоменклатуры = Неопределено;
			
		конецесли;
	КонецЦикла;
	
конецпроцедуры

&НаСервере
Функция   ДобавитьСоставНабораВСвязиССерийнымУчетомКомпонент(Знач Номенклатура, Количество = 1)
	
	Результат = неопределено;
	
	Состав = новый ТаблицаЗначений;
	Состав.Колонки.Добавить("Номенклатура");
	Состав.Колонки.Добавить("Количество");
	Состав.Колонки.Добавить("СерияНоменклатуры");
	
	ДобавитьВсеЭлементыСостава(Номенклатура, Состав, Количество);
	
	сч = 0;
	Для Каждого СтрокаСостава Из Состав Цикл
		
		если сч = 0 тогда
			Результат = Новый Структура;
			Результат.Вставить("Номенклатура", строкасостава.номенклатура);
			Результат.Вставить("Количество", строкасостава.Количество * Количество);
			
		иначе
			ДобавитьПозициюНоменклатуры(строкасостава, Истина, Количество);
		конецесли;
		сч = сч + 1;
	КонецЦикла;
	
	Возврат Результат;
	
конецФункции

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)  	
	ПриИзмененииНоменклатуры();
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииНоменклатуры(СтрокаТовара = Неопределено, Знач НеМенятьЦену = Ложь) 
	
	Если СтрокаТовара = Неопределено Тогда
		если ПредставитьДокументРасходаТовараДвумяКолонками тогда
			СтрокаТовара = Элементы.Товары1.ТекущиеДанные;	
		иначе
			СтрокаТовара = Элементы.Товары.ТекущиеДанные;	
		КонецЕсли;
	КонецЕсли;
	
	Номенклатура = СтрокаТовара.Номенклатура;
	Если ЗначениеЗаполнено(Номенклатура) Тогда  		
		
		если СтрокаТовара.Количество = 0 тогда
			СтрокаТовара.Количество = ОбщийМодульСервер.ПолучитьКоличествоПоУмолчанию(Номенклатура);
		КонецЕсли;
		
		если ОбщийМодульПовтор.ЭтоНабор(Номенклатура) 
			и ОбщийМодульТоварСервер.ПроверитьСерийностьЭлементовНабора(Номенклатура) тогда
			
			СтрокаТовараСтруктура = ДобавитьСоставНабораВСвязиССерийнымУчетомКомпонент(Номенклатура, СтрокаТовара.Количество);
			
			если не СтрокаТовараСтруктура = неопределено тогда
				Номенклатура = СтрокаТовараСтруктура.Номенклатура;
				СтрокаТовара.Номенклатура = Номенклатура;
				СтрокаТовара.Количество   = СтрокаТовараСтруктура.Количество;
			конецесли;
		конецесли;
		
		Если УчетПоСериям ТОгда
			//И НЕ СерииНоменклатурыВидны Тогда
			
			ТоварВедетсяПоСериям = ОбщийМодульПовтор.ТоварВедетсяПоСериям(Номенклатура);
			
			Если ТоварВедетсяПоСериям Тогда
				СтрокаТовара.Количество = 1;
				СерииНоменклатурыВидны 	= Истина;		
				Элементы.ТоварыСерияНоменклатуры.Видимость 	= Истина;	
				Элементы.ТоварыСерияНоменклатуры1.Видимость = Истина;	
			КонецЕсли;             				
		КонецЕсли;
		
		Если НЕ НеМенятьЦену Тогда
			СтрокаТовара.Цена = ПолучитьЦенуНаСервере(СтрокаТовара.Номенклатура, СтрокаТовара.Количество, СтрокаТовара.ЕдиницаИзмерения);
		КонецЕсли;
		
		если ИспользоватьСкидки тогда
			СтрокаТовара.СуммаБезСкидки = СтрокаТовара.Цена * СтрокаТовара.Количество;
			СтрокаТовара.ПроцентСкидки 	= ПолучитьПроцентСкидкиНаСервере(СтрокаТовара.Номенклатура, СтрокаТовара.Количество);
		иначе
			СтрокаТовара.Сумма = СтрокаТовара.Цена * СтрокаТовара.Количество;
		КонецЕсли;
		
		ПересчитатьСтроку(, , , СтрокаТовара);
		ТоварыПриИзмененииНаСервере();	
		ПоказатьТовар();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция   остатоктоваравстроке(Номенклатура, Количество)
	
	если ОбщийМодульПовтор.ТоварНеУчитываетсяПоКоличеству(Номенклатура) Тогда
		Возврат 0;			
	Иначе		
		Возврат ОбщийМодульСервер.ПолучитьОстатокТовара(Номенклатура, Объект.Склад, Объект.Дата) - Количество;	
	КонецЕсли;
	
КонецФункции 

&НаСервере
Функция   ПолучитьПроцентСкидкиНаСервере(Знач НоменклатураИлиКлиентПоставщик, Знач Количество = 0)
	
	если ИспользоватьСкидки тогда
		Возврат ОбщийМодульСервер.ПолучитьПроцентСкидкиНаСервере(НоменклатураИлиКлиентПоставщик, Количество, объект.ВидЦен, объект.КлиентПоставщик);
		
	иначе
		возврат 0;
	КонецЕсли;
	
КонецФункции //ПолучитьПроцентСкидкиНаСервере

&НаСервере
Функция   ПолучитьЦенуНаСервере(Знач Номенклатура, Знач Количество, Знач ЕдиницаИзмерения)
	
	Цена = 0 ;
	Если ЗначениеЗаполнено(объект.КлиентПоставщик)
		и ТипЗнч(объект.КлиентПоставщик) = Тип("СправочникСсылка.Поставщики") Тогда
		
		Цена = ОпределитьЦенуПоследнейПокупки(Номенклатура);
	КонецЕсли;	
	
	Если Цена = 0 Тогда
		Цена = ОбщийМодульСервер.ПолучитьЦенуНаСервере(Номенклатура, Объект.ВидЦен, Объект.Дата, истина, Количество, Объект.Договор, , , Объект.Ссылка, , ЕдиницаИзмерения);
	КонецЕсли;
	
	Возврат Цена;
	
КонецФункции

&НаСервере
Функция   ОпределитьЦенуПоследнейПокупки(Знач Номенклатура)
	
	ОпределитьЦенуПоследнейПокупки = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 Закупки.Количество,
	|	Закупки.Сумма
	|ИЗ РегистрНакопления.Закупки КАК Закупки
	|ГДЕ Закупки.Номенклатура = &Номенклатура
	|	И Закупки.Поставщик = &Поставщик
	|УПОРЯДОЧИТЬ ПО Закупки.Период УБЫВ";
	
	Запрос.УстановитьПараметр("Поставщик", Объект.КлиентПоставщик);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Количество = ВыборкаДетальныеЗаписи.Количество;
			Если Количество = 0 Тогда
				ОпределитьЦенуПоследнейПокупки = ВыборкаДетальныеЗаписи.Сумма;
			Иначе
				ОпределитьЦенуПоследнейПокупки = ВыборкаДетальныеЗаписи.Сумма / ВыборкаДетальныеЗаписи.Количество;
			КонецЕсли;
			
		КонецЦикла;                            	
	КонецЕсли;
	
	Возврат ОпределитьЦенуПоследнейПокупки;
	
КонецФункции //ОпределитьЦенуПоследнейПокупки

&НаКлиенте
процедура ПересчитатьСтроку(изколичества = ложь, изпроцентаскидки = ложь, изсуммы = ложь, СтрокаТовара = Неопределено)
	
	если не изсуммы тогда
		
		Если СтрокаТовара = Неопределено Тогда
			если ПредставитьДокументРасходаТовараДвумяКолонками тогда
				СтрокаТовара = Элементы.Товары1.ТекущиеДанные;	
			иначе
				СтрокаТовара = Элементы.Товары.ТекущиеДанные;	
			КонецЕсли;
		КонецЕсли;
		
		Номенклатура = СтрокаТовара.Номенклатура;
		
		Если УчетПоСериям 
			И НЕ СтрокаТовара.Количество = 1 Тогда
			
			ТоварВедетсяПоСериям = ОбщийМодульПовтор.ТоварВедетсяПоСериям(Номенклатура);
			
			Если ТоварВедетсяПоСериям Тогда
				СтрокаТовара.Количество = 1;
			КонецЕсли;             				
		КонецЕсли;
		
		если ИспользоватьСкидки тогда
			СтрокаТовара.СуммаБезСкидки = СтрокаТовара.Количество * СтрокаТовара.Цена;	
			если не изпроцентаскидки тогда
				СтрокаТовара.ПроцентСкидки = ПолучитьПроцентСкидкиНаСервере(Номенклатура, СтрокаТовара.Количество);	
			КонецЕсли;
			
			если не СтрокаТовара.СуммаБезСкидки = 0 тогда
				СтрокаТовара.Сумма = СтрокаТовара.СуммаБезСкидки - СтрокаТовара.ПроцентСкидки * (СтрокаТовара.СуммаБезСкидки / 100);
			иначе
				СтрокаТовара.Сумма = 0;
			КонецЕсли;
			
		иначе
			СтрокаТовара.Сумма = СтрокаТовара.Количество * СтрокаТовара.Цена;		
		КонецЕсли;	
		
		Если ДемонстрироватьИнформационнуюКолонкуОстатокТовараСУчетомДокументаВНепроведенныхДокументах Тогда
			СтрокаТовара.ОстатокСУчетомДокумента = остатоктоваравстроке(Номенклатура, СтрокаТовара.Количество) ;
		КонецЕсли;
		
	КонецЕсли;
	
	ТоварыПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере         
процедура ПересчитатьСтрокуНаСервере(СтрокаТовара)
	
	если ИспользоватьСкидки тогда
		
		СтрокаТовара.СуммаБезСкидки = СтрокаТовара.Количество * СтрокаТовара.Цена;
		если не СтрокаТовара.СуммаБезСкидки = 0 тогда
			СтрокаТовара.Сумма = СтрокаТовара.СуммаБезСкидки - СтрокаТовара.ПроцентСкидки * СтрокаТовара.СуммаБезСкидки / 100;
		иначе
			СтрокаТовара.Сумма = 0;
		КонецЕсли;
		
	иначе
		СтрокаТовара.Сумма = СтрокаТовара.Количество * СтрокаТовара.Цена;	
		
	КонецЕсли;
	
	ТоварыПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)     						// ПРИ ОТКРЫТИИ	
	
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0, Объект.Ссылка, истина);
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбработатьБлокировку(истина);		
	КонецЕсли;
	
	Если ИспользоватьПодключаемоеОборудование И 
		МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда
		
		ОписаниеОшибки = "" ;
		ПоддерживаемыеТипыВО = Новый Массив();
		ПоддерживаемыеТипыВО.Добавить("СчитывательМагнитныхКарт");
		ПоддерживаемыеТипыВО.Добавить("СканерШтрихКода");
		ПоддерживаемыеТипыВО.Добавить("ДисплейПокупателя");
		
		Если Не МенеджерОборудованияКлиент.ПодключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО, ОписаниеОшибки) Тогда
			ТекстСообщения = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке( "При подключении оборудования произошла ошибка") + ": " + ОписаниеОшибки + ".";
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	
	ТоварыПриИзмененииНаСервере(Истина);
	РассчитатьЧтоОстанетсяСУчетомПоступления();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()                                                  // ПРИ ЗАКРЫТИИ   	
	
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1, Объект.Ссылка, Истина);
	
	Если ИспользоватьПодключаемоеОборудование Тогда
		ПоддерживаемыеТипыВО = Новый Массив ();
		ПоддерживаемыеТипыВО.Добавить("СчитывательМагнитныхКарт");
		ПоддерживаемыеТипыВО.Добавить("СканерШтрихКода");
		ПоддерживаемыеТипыВО.Добавить("ДисплейПокупателя");
		МенеджерОборудованияКлиент.ОтключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник = "ПодключаемоеОборудование"
		И ВводДоступен() Тогда
		
		Если НЕ СканерЗаблокирован
			И ИмяСобытия = "ScanData" Тогда
			
			Если Параметр[ 1 ] = Неопределено Тогда
				ТекКод = Параметр[ 0 ];
			Иначе
				ТекКод = Параметр[ 1 ][ 1 ];
			КонецЕсли;
			
			ОбработатьПолученныйШКНаКлиенте(ТекКод);
			
		ИначеЕсли ИмяСобытия = "TracksData" Тогда
			ПолученКодИзСМК(Параметр);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьДокументНаКлиенте()
	
	ПересчитатьДокументНаСервере();
	ВывестиИнформациюНаДисплейПокупателя();
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьДокументНаСервере()
	ТоварыПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПолученКодИзСМК(Параметр)
	
	Если Параметр[1][3] <> Неопределено Тогда
		МКод = Параметр[1][3][0].ДанныеДорожек[0].ЗначениеПоля;
	Иначе
		МКод = Параметр[0];
	КонецЕсли;
	ПолучитьКлиентаНаСервере(МКод);
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьКлиентаНаСервере(МКод)
	
	если не ДокументЗаблокирован Тогда
		
		Клиент = ПодключаемоеОборудованиеДСервер.НайтиКлиентаПоМК(МКод);
		Если Клиент <> Неопределено Тогда
			Объект.КлиентПоставщик = Клиент;
		Иначе
			ПустаяСсылка = Новый (Тип("СправочникСсылка.Клиенты"));
			Объект.КлиентПоставщик = ПустаяСсылка;
			ОбщегоНазначения.СообщитьПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Клиент не найден."));
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция   ОбработатьПолученныйШКНаСервере(Знач ТекКод, Знач Количество = 1)
	
	Результат = Истина;
	
	если не ДокументЗаблокирован тогда
		РезультатОбработки = ОбщийМодульТоварСервер.ПолучитьНоменклатуруПоШтрихКоду(ТекКод, Истина, , Объект.Дата);
		
		Если ЗначениеЗаполнено(РезультатОбработки) Тогда
			ДобавитьПозициюНоменклатуры(РезультатОбработки);
			СтрокаДисплеяПокупателя = СокрЛП(РезультатОбработки.Номенклатура);	
			
		Иначе		
			ОстановитьПоиск = Ложь;
			
			Если НЕ ОстановитьПоиск
				И ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетПродажПоСотрудникам") тогда
				
				РезультатОбработки = ОбщийМодульСервер.ПолучитьСотрудникаПоШтрихКоду(ТекКод);
				если ЗначениеЗаполнено(РезультатОбработки) Тогда
					объект.Сотрудник = РезультатОбработки;
					ОстановитьПоиск = Истина;
				КонецЕсли;	
			КонецЕсли;
			
			Если НЕ ОстановитьПоиск
				И ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ИспользоватьШтрихКодыДляИдентификацииКонтрагентов") Тогда
				
				РезультатОбработки = ОбщийМодульСервер.ПолучитьКонтрагентаПоШтрихКоду(ТекКод);
				Если ЗначениеЗаполнено(РезультатОбработки) Тогда
					Объект.КлиентПоставщик = РезультатОбработки;					
					КлиентПриИзмененииНаСервере();
					ОстановитьПоиск = Истина;
				КонецЕсли;		
			КонецЕсли;
			
			Если НЕ ОстановитьПоиск
				И ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетСобственныхЮридическихЛиц") Тогда
				
				РезультатОбработки = ОбщийМодульСервер.ПолучитьКонтрагентаПоШтрихКоду(ТекКод, , , Истина);				
				Если ЗначениеЗаполнено(РезультатОбработки) Тогда
					Объект.Организация = РезультатОбработки;
					ОстановитьПоиск = Истина;
				КонецЕсли;	
			КонецЕсли;
			
			Если НЕ ОстановитьПоиск Тогда
				ОбщегоНазначения.СообщитьПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Объект по штрих-коду не найден (") + ТекКод + ").");
				Результат = Ложь;	
			КонецЕсли;
		КонецЕсли; 	 	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент) 	
	ПересчитатьСтроку(истина);	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)	
	ПересчитатьСтроку();	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПроцентСкидкиПриИзменении(Элемент)	
	пересчитатьСтроку(ложь, истина)  ;	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаБезСкидкиПриИзменении(Элемент)
	
	если ПредставитьДокументРасходаТовараДвумяКолонками тогда
		СтрокаТовара = Элементы.Товары1.ТекущиеДанные;	
	иначе
		СтрокаТовара = Элементы.Товары.ТекущиеДанные;	
	КонецЕсли;
	
	Если не СтрокаТовара.Количество = 0 Тогда
		СтрокаТовара.Цена = СтрокаТовара.СуммаБезСкидки / СтрокаТовара.Количество;
	КонецЕсли;
	пересчитатьСтроку(, , , СтрокаТовара)	;
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиИнформациюНаДисплейПокупателя()
	
	Если НЕ ИспользоватьПодключаемоеОборудование Тогда
		Возврат;
	КонецЕсли;
	
	Дисплей = Неопределено;
	
	ФорматнаяСтрока = "ЧДЦ=2; ЧРГ=' '; ЧН=0.00; ЧГ=0";
	ДлинаТекста     = 20;
	
	ДПТекст1 = "";
	ДПТекст2 = "";
	
	Если Расчет Тогда
		
		ДПТекст1 = ?(
		Не ЗначениеЗаполнено(СтрокаДисплеяПокупателя),
		"",
		Лев(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке(" К ОПЛАТЕ:") + " " + Формат(Объект.СуммаДокумента, ФорматнаяСтрока), ДлинаТекста));
		
		Доплата = Объект.СуммаДокумента - Объект.СуммаОплаты;
		
		ДПТекст2 = ?(
		Не ЗначениеЗаполнено(СтрокаДисплеяПокупателя),
		"",
		Лев(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("    СДАЧА:") + " " + Формат(Объект.Сдача, ФорматнаяСтрока), ДлинаТекста));
		
	Иначе
		
		ДПТекст1 = ?(
		Не ЗначениеЗаполнено(СтрокаДисплеяПокупателя),
		"",
		Лев(СтрокаДисплеяПокупателя, ДлинаТекста));
		
		ДПТекст2 = ?(
		Не ЗначениеЗаполнено(СтрокаДисплеяПокупателя),
		"",
		Лев(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("ИТОГО:") + " " + Формат(Объект.ТовараНаСумму, ФорматнаяСтрока), ДлинаТекста));
		
	КонецЕсли;
	
	Для каждого ЭлементСписка Из Дисплеи Цикл
		
		Дисплей = ЭлементСписка.Значение;
		
		ВходныеПараметры  = Новый Массив();
		ВыходныеПараметры = Неопределено;
		
		Результат = МенеджерОборудованияКлиент.ВыполнитьКоманду(
		Дисплей.Ссылка,
		"ClearText",
		ВходныеПараметры,
		ВыходныеПараметры);
		
		Пока СтрДлина(ДПТекст1) < ДлинаТекста Цикл
			ДПТекст1 = ДПТекст1 + " ";
		КонецЦикла;
		
		Пока СтрДлина(ДПТекст2) < ДлинаТекста Цикл
			ДПТекст2 = ДПТекст2 + " ";
		КонецЦикла;
		
		ВходныеПараметры  = Новый Массив();
		ВыходныеПараметры = Неопределено;
		
		ВходныеПараметры.Добавить(ДПТекст1 + Символы.ПС + ДПТекст2);
		
		Результат = МенеджерОборудованияКлиент.ВыполнитьКоманду(
		Дисплей.Ссылка,
		"DisplayText",
		ВходныеПараметры,
		ВыходныеПараметры);
		
		Если НЕ Результат Тогда
			ТекстСообщения = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("При использовании дисплея покупателя произошла ошибка.
			|Дополнительное описание: %ДополнительноеОписание%");
			ТекстСообщения = СтрЗаменить(ТекстСообщения,
			"%ДополнительноеОписание%",
			ВыходныеПараметры[1]);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция   ВвестиШтрихКод(ШтрихКод, ТекстЗаголовка = "") Экспорт
	
	Результат = Ложь;
	
	Если НЕ ЗначениеЗаполнено(ТекстЗаголовка) Тогда
		ТекстЗаголовка = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Введите ШтрихКод");
	КонецЕсли;
	
	ШтрихКод = "";
	Если ВвестиЗначение(ШтрихКод, ТекстЗаголовка) Тогда
		Если Не ПустаяСтрока(ШтрихКод) Тогда
			Результат = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьПолученныйШКНаклиенте(ТекКод)
	
	если не ОбработатьПолученныйШКНаСервере(ТекКод) тогда
		
		СканерЗаблокирован = ОбщийМодульКлиент.ВыдатьСигнал(ТекКод) и не ДокументЗаблокирован;
		элементы.разблокироватьсканер.видимость 	= СканерЗаблокирован;
		элементы.разблокироватьсканер1.видимость 	= СканерЗаблокирован;
		
	Иначе
		ПересчитатьДокументНаКлиенте();
	конецесли;
	
КонецПроцедуры

Процедура ИзменитьВидДокумента() 
	
	ЗначениеЗаполненоКлиентПоставщик = ЗначениеЗаполнено(Объект.КлиентПоставщик);
	
	Элементы.ГруппаАдресТелефон.Видимость 	 = РедактироватьАдресИТелефонКлиентаПрямоВДокументахРеализации И ЗначениеЗаполненоКлиентПоставщик;
	Элементы.ГруппаАдресТелефон1.Видимость 	 = РедактироватьАдресИТелефонКлиентаПрямоВДокументахРеализации И ЗначениеЗаполненоКлиентПоставщик;
	
	УчетТоваровПереданныхОтНасКомиссионерамДляКомиссионнойТорговли = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("УчетТоваровПереданныхОтНасКомиссионерамДляКомиссионнойТорговли") И Объект.ПередачаДляКомиссионнойТорговли;
	Элементы.ДатаОтчетаПоКомиссии.Видимость  = ИспользуетсяДатаКомиссии И УчетТоваровПереданныхОтНасКомиссионерамДляКомиссионнойТорговли;
	Элементы.ДатаОтчетаПоКомиссии1.Видимость = ИспользуетсяДатаКомиссии И УчетТоваровПереданныхОтНасКомиссионерамДляКомиссионнойТорговли;
	
	Если ЗначениеЗаполненоКлиентПоставщик Тогда
		
		ЭтоКлиент = ТипЗнч(Объект.КлиентПоставщик) = Тип("СправочникСсылка.Клиенты");
		
		Если ЭтоКлиент Тогда
			
			Элементы.ПартияПриобретения.Видимость 	= Ложь;
			Элементы.ПартияПриобретения1.Видимость 	= Ложь;
			
			Если объект.ПоступилоДенег = 0 Тогда
				если УчетТоваровПереданныхОтНасКомиссионерамДляКомиссионнойТорговли Тогда
					Если не ТекущийТипДокумента = 15 тогда
						
						ЭтаФорма.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Передача товара");	
						Элементы.ФормаПровестиИЗакрыть.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Передать товар и закрыть");				
						ТекущийТипДокумента = 15;           	
					КонецЕсли;	
				Иначе
					Если не ТекущийТипДокумента = 5 тогда
						
						ЭтаФорма.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Выдача товара");	
						Элементы.ФормаПровестиИЗакрыть.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Выдать товар и закрыть");				
						ТекущийТипДокумента = 5;           	
					КонецЕсли;	
				КонецЕсли;
				
			Иначе
				если УчетТоваровПереданныхОтНасКомиссионерамДляКомиссионнойТорговли Тогда
					если не ТекущийТипДокумента = 14 тогда
						
						ЭтаФорма.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("На Комиссию");	
						Элементы.ФормаПровестиИЗакрыть.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Передать на комиссию и закрыть");
						ТекущийТипДокумента = 14;	
					КонецЕсли;	
				Иначе
					если не ТекущийТипДокумента = 4 тогда
						
						ЭтаФорма.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Реализация товара");	
						Элементы.ФормаПровестиИЗакрыть.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Продать товар и закрыть");
						ТекущийТипДокумента = 4;	
					КонецЕсли;	
				КонецЕсли;
				
			КонецЕсли;			
			
		Иначе
			Элементы.ПартияПриобретения.Видимость 	= Истина;
			Элементы.ПартияПриобретения1.Видимость 	= Истина;
			
			Если объект.ПоступилоДенег = 0 Тогда
				Если не ТекущийТипДокумента = 3 тогда
					
					Элементы.ФормаПровестиИЗакрыть.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Отдать поставщику и закрыть");
					ЭтаФорма.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Выдача Поставщику");	
					ТекущийТипДокумента = 3;	
				КонецЕсли;	
				
			Иначеесли не ТекущийТипДокумента = 2 тогда
				
				Элементы.ФормаПровестиИЗакрыть.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Вернуть поставщику и закрыть");
				ЭтаФорма.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Возврат Поставщику");	
				ТекущийТипДокумента = 2;
				
			КонецЕсли;			
			
		КонецЕсли;
		
	иначе
		Элементы.ПартияПриобретения.Видимость 	= Ложь;
		Элементы.ПартияПриобретения1.Видимость 	= Ложь;
		ЭтоКлиент = Ложь;
		
		Если объект.ПоступилоДенег = 0 Тогда
			если УчетТоваровПереданныхОтНасКомиссионерамДляКомиссионнойТорговли Тогда
				Если не ТекущийТипДокумента = 11 тогда
					ЭтаФорма.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Комиссование");	
					Элементы.ФормаПровестиИЗакрыть.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Комиссовать товар и закрыть");
					ТекущийТипДокумента = 11;
				КонецЕсли;	
			иначе
				Если не ТекущийТипДокумента = 1 тогда			
					ЭтаФорма.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Списание товара");	
					Элементы.ФормаПровестиИЗакрыть.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Списать и закрыть");
					ТекущийТипДокумента = 1;	
				КонецЕсли;	
			КонецЕсли;
			
		иначе
			
			если УчетТоваровПереданныхОтНасКомиссионерамДляКомиссионнойТорговли Тогда
				если не ТекущийТипДокумента = 1 тогда 	
					
					ЭтаФорма.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Комиссование за деньги");	
					Элементы.ФормаПровестиИЗакрыть.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Комиссовать, принять деньги и закрыть");
					ТекущийТипДокумента = 1;	
				КонецЕсли;	
			Иначе
				если не ТекущийТипДокумента = 6 тогда 	
					
					ЭтаФорма.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Списание товара за деньги");	
					Элементы.ФормаПровестиИЗакрыть.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Списать товар, принять деньги и закрыть");
					ТекущийТипДокумента = 6;	
				КонецЕсли;	
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Элементы.ФормаПровестиИЗакрыть1.Заголовок = Элементы.ФормаПровестиИЗакрыть.Заголовок;
	
КонецПроцедуры

&НаКлиенте
Процедура ВзятьСуммуСУчетомДолгаКлиента(Команда)
	
	ПоказатьДолгКлиентаПоставщика();
	ВзятьСуммуПоДокументуНаСервере(Истина);
	
	РассчитатьЧтоОстанетсяСУчетомПоступления();
	ИзменитьВидДокумента() ;
	
	Элементы.ТекущийДолг.Заголовок 	= ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Текущий долг (") + формат(ОбщийМодульКлиент.ПользователяТекущаяДата(), "ДФ='dd.MM.yy ЧЧ:мм'") + ")";
	Элементы.ТекущийДолг1.Заголовок = Элементы.ТекущийДолг.Заголовок;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	если НЕ ПараметрыЗаписи.режимзаписи = РежимЗаписиДокумента.Запись тогда
		ОбработатьБлокировку();                                                	
	КонецЕсли;
	
	Если ДопИнформацияИзменена Тогда
		ОбщийМодульСервисСервер.ЗаписатьДополнительнуюИнформацию(Объект.Ссылка, ДополнительнаяИнформация);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьБлокировку(Знач ПриСозданииФормы = ложь);
	
	Если ОбщийМодульСервер.ОбработатьБлокировку(Объект, ЭтаФорма, ПриСозданииФормы) Тогда		
		
		Если НЕ ПредставитьДокументРасходаТовараДвумяКолонками Тогда
			Элементы.ТоварыВводШтрихКода.Доступность 			= Ложь;
			Элементы.ВзятьСуммуПоДокументу.Доступность 			= Ложь;
			Элементы.ВзятьСуммуСУчетомДолгаКлиента.Доступность 	= Ложь;
			Элементы.ТоварыВводСКоличеством.Доступность 		= Ложь;
			Элементы.ФормаПровестиИЗакрыть.Доступность 			= Ложь;
			Элементы.ФормаПровести.Доступность 					= Ложь;
			Элементы.РаспечататьПровестиИЗакрыть.Заголовок 		= ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Распечатать и закрыть");
			Элементы.ФормаЗакрыть.КнопкаПоУмолчанию 			= истина;
			Элементы.Записать.Видимость 						= ложь;
			Элементы.ТоварыНазначитьСкидкуДляВсехСтрок.Доступность 	= Ложь;
			Элементы.ТоварыПозицияИзСпискаЧастогоСпроса.Доступность = Ложь;
			Элементы.ТоварыЧастогоСпроса.Видимость 				= ложь;
			Элементы.ЧастныйПокупатель.Видимость 				= ложь;
			Элементы.ОплатаВзятьСуммуПоДокументу.Видимость 		= ложь;
			Элементы.ГруппаКомандНоменклатурыЧастогоСпроса.Видимость = Ложь;
			
		Иначе
			Элементы.ТоварыВводШтрихКода1.доступность 			= Ложь;
			Элементы.ВзятьСуммуПоДокументу1.доступность 		= Ложь;
			Элементы.ВзятьСуммуСУчетомДолгаКлиента1.доступность = Ложь;
			Элементы.ТоварыВводСКоличеством1.доступность 		= Ложь;
			Элементы.ФормаПровестиИЗакрыть1.доступность 		= Ложь;
			Элементы.ФормаПровести1.доступность 				= Ложь;
			Элементы.РаспечататьПровестиИЗакрыть1.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Распечатать и закрыть");
			Элементы.ФормаЗакрыть1.КнопкаПоУмолчанию 			= истина;
			Элементы.Записать1.Видимость 						= ложь;
			Элементы.ТоварыНазначитьСкидкуДляВсехСтрок1.доступность 	= Ложь;
			Элементы.ТоварыПозицияИзСпискаЧастогоСпроса1.Доступность 	= Ложь;
			Элементы.ГруппаКомандыТаблицы.Видимость 			= ложь;
			Элементы.ЧастныйПокупатель1.Видимость 				= ложь;
			Элементы.Оплата1ВзятьСуммуПоДокументу.Видимость 	= ложь;
			Элементы.ГруппаКомандНоменклатурыЧастогоСпроса1.Видимость = Ложь;
			
		КонецЕсли;
		
	Иначе
		Если НЕ ПредставитьДокументРасходаТовараДвумяКолонками Тогда
			Элементы.ТоварыВводШтрихКода.Доступность 			= Истина;
			Элементы.ВзятьСуммуПоДокументу.Доступность 			= Истина;
			Элементы.ВзятьСуммуСУчетомДолгаКлиента.Доступность 	= Истина;
			Элементы.ТоварыВводСКоличеством.Доступность 		= истина;
			Элементы.ФормаПровестиИЗакрыть.Доступность 			= истина;
			Элементы.ФормаПровести.Доступность 					= Истина;
			Элементы.Записать.Видимость 						= истина;
			Элементы.РаспечататьПровестиИЗакрыть.Заголовок 		= ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Распечатать, провести и закрыть");
			Элементы.ФормаПровестиИЗакрыть.КнопкаПоУмолчанию 	= истина;
			Элементы.ТоварыНазначитьСкидкуДляВсехСтрок.Доступность 	= истина;
			Элементы.ТоварыПозицияИзСпискаЧастогоСпроса.Доступность = истина;
			Элементы.ТоварыЧастогоСпроса.Видимость 				= истина;
			Элементы.ЧастныйПокупатель.Видимость 				= УчетПоКлиентам и не объект.КлиентПоставщик = Справочники.Клиенты.ФизическоеЛицо;
			Элементы.ОплатаВзятьСуммуПоДокументу.Видимость 		= Истина;	
			Элементы.ГруппаКомандНоменклатурыЧастогоСпроса.Видимость = Истина;
			
		Иначе
			Элементы.ТоварыВводШтрихКода1.доступность 			= Истина;
			Элементы.ВзятьСуммуПоДокументу1.доступность 		= Истина;
			Элементы.ВзятьСуммуСУчетомДолгаКлиента1.доступность = Истина;
			Элементы.ТоварыВводСКоличеством1.доступность 		= истина;
			Элементы.ФормаПровестиИЗакрыть1.доступность 		= истина;
			Элементы.ФормаПровести1.доступность 				= Истина;
			Элементы.Записать1.Видимость 						= истина;
			Элементы.РаспечататьПровестиИЗакрыть1.Заголовок 	= ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Распечатать, провести и закрыть");
			Элементы.ФормаПровестиИЗакрыть1.КнопкаПоУмолчанию 	= истина;		
			Элементы.ТоварыНазначитьСкидкуДляВсехСтрок1.доступность 	= истина;
			Элементы.ТоварыПозицияИзСпискаЧастогоСпроса1.Доступность 	= истина;
			Элементы.ГруппаКомандыТаблицы.Видимость 			= истина;
			Элементы.ЧастныйПокупатель1.Видимость 				= УчетПоКлиентам и не объект.КлиентПоставщик = Справочники.Клиенты.ФизическоеЛицо;
			Элементы.Оплата1ВзятьСуммуПоДокументу.Видимость 	= Истина;
			Элементы.ГруппаКомандНоменклатурыЧастогоСпроса1.Видимость = Истина;
			
		КонецЕсли;
		ТекущийТипДокумента = 0;
		ИзменитьВидДокумента() ;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	
	если ПредставитьДокументРасходаТовараДвумяКолонками тогда
		СтрокаТовара = Элементы.Товары1.ТекущиеДанные;	
	иначе
		СтрокаТовара = Элементы.Товары.ТекущиеДанные;	
	КонецЕсли;
	
	Если СтрокаТовара.Количество = 0 Тогда
		СтрокаТовара.Количество = 1;		
	КонецЕсли;
	
	если ИспользоватьСкидки тогда
		Если СтрокаТовара.СуммаБезСкидки = 0 Тогда
			СтрокаТовара.СуммаБезСкидки = строкатовара.цена * строкатовара.количество;
		КонецЕсли;
		
		СтрокаТовара.ПроцентСкидки = (СтрокаТовара.СуммаБезСкидки - СтрокаТовара.Сумма) / (СтрокаТовара.СуммаБезСкидки / 100);	
	КонецЕсли;
	
	пересчитатьСтроку(ложь, ложь, истина, СтрокаТовара)	;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидЦенПриИзменении(Элемент) 	
	ВидЦенПриИзмененииНаСервере(Ложь);
КонецПроцедуры

&НаСервере
Процедура ВидЦенПриИзмененииНаСервере(НеМенятьЦеныТаблицы = Ложь)
	
	Если ЗначениеЗаполнено(Объект.ВидЦен)
		и ЗначениеЗаполнено(Объект.ВидЦен.ВалютаЦены) Тогда
		
		ВалютаПродаж  = Объект.ВидЦен.ВалютаЦены;
		Если НЕ НеМенятьЦеныТаблицы Тогда
			Объект.Валюта = ВалютаПродаж;    	
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ НеМенятьЦеныТаблицы Тогда
		Для Каждого СтрокаТовара из Объект.Товары Цикл
			СтрокаТовара.Цена = ПолучитьЦенуНаСервере(СтрокаТовара.Номенклатура, строкатовара.количество, СтрокаТовара.ЕдиницаИзмерения);
			
			если ИспользоватьСкидки тогда
				СтрокаТовара.СуммаБезСкидки = СтрокаТовара.Количество * СтрокаТовара.Цена;
				если не СтрокаТовара.СуммаБезСкидки = 0 тогда
					СтрокаТовара.Сумма = СтрокаТовара.СуммаБезСкидки - СтрокаТовара.ПроцентСкидки * СтрокаТовара.СуммаБезСкидки / 100;
				иначе
					СтрокаТовара.Сумма = 0;
				КонецЕсли;
				
			иначе
				СтрокаТовара.Сумма = СтрокаТовара.Количество * СтрокаТовара.Цена;	
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентПоставщикПриИзменении(Элемент)    	
	
	ПриСменеКонтрагента();
	
	Если ПоказыватьИзображения
		И ЗначениеЗаполнено(Объект.КлиентПоставщик)
		И ((ТипЗнч(Объект.КлиентПоставщик) = Тип("СправочникСсылка.Клиенты") И СопровождатьКлиентовИзображениями)
		ИЛИ (ТипЗнч(Объект.КлиентПоставщик) = Тип("СправочникСсылка.Поставщики") И СопровождатьПоставщиковИзображениями)) Тогда
		
		ПоказатьИзображениеРеквизита(Объект.КлиентПоставщик);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриСменеКонтрагента()
	
	ПроверитьСменуТипа();
	ПоказатьДолгКлиентаПоставщика();
	КлиентПриИзмененииНаСервере();
	ПересчитатьДокументНаКлиенте();
	ИзменитьВидДокумента();	
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	если ПредставитьДокументРасходаТовараДвумяКолонками тогда
		СтрокаТовара = Элементы.Товары1.ТекущиеДанные;	
	иначе
		СтрокаТовара = Элементы.Товары.ТекущиеДанные;	
	КонецЕсли;
	
	ОбщийМодульКлиент.ПоискОшибкиКодировки("Номенклатура", ДанныеВыбора, Текст, СтрокаТовара.Номенклатура);
	
	Если ЗначениеЗаполнено(ДанныеВыбора) Тогда
		ПриИзмененииНоменклатуры() 	;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентПоставщикОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если ТипЗнч(Объект.КлиентПоставщик) = Тип("СправочникСсылка.Поставщики") ТОгда
		ОбщийМодульКлиент.ПоискОшибкиКодировки("Поставщики", ДанныеВыбора, Текст, Объект.КлиентПоставщик);	
	Иначе
		ОбщийМодульКлиент.ПоискОшибкиКодировки("Клиенты", ДанныеВыбора, Текст, Объект.КлиентПоставщик);		
	КонецЕсли;
	ПриСменеКонтрагента();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция   ОбновитьКурс(Знач Валюта, Знач Дата)
	
	Если ЗначениеЗаполнено(Валюта) Тогда
		Возврат ОбщийМодульПовтор.ПолучитьТекущийКурс(Валюта, Дата);
	Иначе
		Возврат 1;	
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	
	если не ТекущаяВалюта = объект.Валюта тогда
		ПересчитатьСуммуПриСменеВалюты();          	
	КонецЕсли;
	
	объект.Курс = ОбновитьКурс(Объект.Валюта, Объект.Дата);	
	элементы.Курс.Видимость 	= не объект.Курс = 1 и ИспользоватьУчетВалют;
	элементы.Курс1.Видимость 	= элементы.Курс.Видимость;
	РассчитатьЧтоОстанетсяСУчетомПоступления();
	
КонецПроцедуры

&НаСервере
процедура ПересчитатьСуммуПриСменеВалюты()
	
	Если ЗначениеЗаполнено(объект.Валюта) 
		и не объект.ПоступилоДенег = 0 Тогда
		
		объект.ПоступилоДенег = ОбщийМодульСервер.ПоКурсу(объект.ПоступилоДенег, объект.Валюта, ТекущаяВалюта, объект.Дата);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура КурсОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	объект.Курс = ОбновитьКурс(Объект.Валюта, Объект.Дата);	
	элементы.Курс.Видимость 	= не объект.Курс = 1 и ИспользоватьУчетВалют;
	элементы.Курс1.Видимость 	= элементы.Курс.Видимость;
	
КонецПроцедуры

&НаКлиенте
Процедура КурсПриИзменении(Элемент)
	
	Если Объект.Курс = 0 Тогда
		Объект.Курс = 1;
	КонецЕсли;
	
	РассчитатьЧтоОстанетсяСУчетомПоступления();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	Если ИспользоватьСложныйМеханизмЦен
		и ЗначениеЗаполнено(Объект.ВидЦен) Тогда
		
		ПараметрыФормы.Вставить("ВидЦен", Объект.ВидЦен);
	КонецЕсли;
	
	Если ВестиУчетПоСкладу
		и ЗначениеЗаполнено(Объект.Склад) Тогда
		
		ПараметрыФормы.Вставить("ОтборПоСкладу", Объект.Склад);
	КонецЕсли;	
	
	ПараметрыФормы.Вставить("ВызовИзРасходаТовара", истина);
	
	ПараметрыФормы.Вставить("ОтборПоДате", Объект.Дата);
	если ПредставитьДокументРасходаТовараДвумяКолонками тогда
		СтрокаТовара = Элементы.Товары1.ТекущиеДанные;	
	иначе
		СтрокаТовара = Элементы.Товары.ТекущиеДанные;	
	КонецЕсли;
	ПараметрыФормы.Вставить("ТекущаяСтрока", СтрокаТовара.Номенклатура);
	ФормаВыбора = ПолучитьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормы);
	
	Номенклатура = ФормаВыбора.ОткрытьМодально();
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		если ПредставитьДокументРасходаТовараДвумяКолонками тогда
			Элементы.Товары1.ТекущиеДанные.Номенклатура = Номенклатура;	
			ПриИзмененииНоменклатуры() ;
			элементы.Товары1.ЗакончитьРедактированиеСтроки(лОЖЬ);
			Элементы.Товары1.ТекущийЭлемент = элементы.ТоварыКоличество1;
			
		иначе
			Элементы.Товары.ТекущиеДанные.Номенклатура = Номенклатура;	
			ПриИзмененииНоменклатуры() ;
			элементы.Товары.ЗакончитьРедактированиеСтроки(лОЖЬ);
			Элементы.Товары.ТекущийЭлемент = элементы.ТоварыКоличество;
			
		КонецЕсли; 
		
	иначе
		если ПредставитьДокументРасходаТовараДвумяКолонками тогда
			элементы.Товары1.ЗакончитьРедактированиеСтроки(истина);			
		иначе
			элементы.Товары.ЗакончитьРедактированиеСтроки(истина);			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СкладОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, Параметры, СтандартнаяОбработка)
	ОбщийМодульКлиент.ПоискОшибкиКодировки("Склады", ДанныеВыбора, Текст, Объект.Склад);
КонецПроцедуры

&НаКлиенте
Процедура ВалютаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	ОбщийМодульКлиент.ПоискОшибкиКодировки("Валюты", ДанныеВыбора, Текст, Объект.Валюта);
	
	если не ТекущаяВалюта = объект.Валюта тогда
		ПересчитатьСуммуПриСменеВалюты();          	
	КонецЕсли;
	
	объект.Курс = ОбновитьКурс(Объект.Валюта, Объект.Дата);	
	элементы.Курс.Видимость 	= не объект.Курс = 1 и ИспользоватьУчетВалют;
	элементы.Курс1.Видимость 	= элементы.Курс.Видимость;
	
КонецПроцедуры

&НаКлиенте
Процедура ВводСКоличеством(Команда)
	
	Если ИспользоватьПодключаемоеОборудование Тогда
		ПоддерживаемыеТипыВО = Новый Массив ();
		ПоддерживаемыеТипыВО.Добавить("СканерШтрихКода");
		МенеджерОборудованияКлиент.ОтключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО);
	КонецЕсли;
	
	СтруктураДляВВода = Новый Структура;
	СтруктураДляВВода.Вставить("Дата", Объект.Дата);
	СтруктураДляВВода.Вставить("ВидЦен", Объект.ВидЦен);
	СтруктураДляВВода.Вставить("Склад", Объект.Склад);
	СтруктураДляВВода.Вставить("БлокВидаЦенИЦены", Ложь);
	СтруктураДляВВода.Вставить("ВызовИзРасходаТовара", истина);
	
	СтруктураПараметров = ОбщийМодульКлиент.ВвестиНоменклатуруИКоличество(СтруктураДляВВода);	
	
	Если НЕ СтруктураПараметров = Неопределено Тогда
		
		если ОбщийМодульПовтор.ЭтоНабор(СтруктураПараметров.Номенклатура) 
			и ОбщийМодульТоварСервер.ПроверитьСерийностьЭлементовНабора(СтруктураПараметров.Номенклатура) тогда
			
			СтрокаТовараСтруктура = ДобавитьСоставНабораВСвязиССерийнымУчетомКомпонент(СтруктураПараметров.Номенклатура, СтруктураПараметров.Количество);
			
			если не СтрокаТовараСтруктура = неопределено тогда
				СтруктураПараметров.Номенклатура = СтрокаТовараСтруктура.Номенклатура;
				СтруктураПараметров.Количество 	 = СтрокаТовараСтруктура.Количество;
			конецесли;
		конецесли;
		
		ДобавитьПозициюНоменклатуры(СтруктураПараметров);
		ПересчитатьДокументНаКлиенте();	
		
		если ПредставитьДокументРасходаТовараДвумяКолонками тогда
			ЭтаФорма.ТекущийЭлемент = Элементы.Товары1;
		иначе
			ЭтаФорма.ТекущийЭлемент = Элементы.Товары;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИспользоватьПодключаемоеОборудование И 
		МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда
		
		ОписаниеОшибки = "" ;
		ПоддерживаемыеТипыВО = Новый Массив();
		ПоддерживаемыеТипыВО.Добавить("СканерШтрихКода");
		Если Не МенеджерОборудованияКлиент.ПодключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО, ОписаниеОшибки) Тогда
			ТекстСообщения = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке( "При подключении оборудования произошла ошибка") + ": " + ОписаниеОшибки + ".";
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ТоварыПриИзмененииНаСервере(Знач ПриОткрытии = Ложь)
	
	если НЕ ПриОткрытии
		И не ДокументЗаблокирован тогда
		
		Количество = Объект.Товары.Итог("Количество");
		Если НЕ Объект.ТовараВКоличестве = Количество Тогда
			Объект.ТовараВКоличестве = Количество;	
		КонецЕсли;
		Сумма = Объект.Товары.Итог("Сумма");	
		Если НЕ Объект.ТовараНаСумму = Сумма Тогда
			Объект.ТовараНаСумму 	 = Сумма;		
		КонецЕсли;
		
		Если ПоступилоРавноСумме Тогда
			
			ВзятьСуммуПоДокументуНаСервере();
			РассчитатьЧтоОстанетсяСУчетомПоступления();
			ИзменитьВидДокумента() ;
			
		КонецЕсли;
	КонецЕсли;
	
	элементы.ТоварыИтогКоличество.Видимость  = не объект.ТовараВКоличестве = 0;
	элементы.ТоварыИтогКоличество1.Видимость = элементы.ТоварыИтогКоличество.Видимость;
	элементы.ТоварыИтогСумма.Видимость 		 = не Объект.ТовараНаСумму = 0;
	элементы.ТоварыИтогСумма1.Видимость 	 = элементы.ТоварыИтогСумма.Видимость;
	ВалютаПродажВидимость 					 = ИспользоватьУчетВалют И не Объект.ТовараНаСумму = 0;
	элементы.ВалютаПродаж.Видимость 		 = ВалютаПродажВидимость;
	элементы.ВалютаПродаж1.Видимость 		 = ВалютаПродажВидимость;
	
КонецПроцедуры

&НаКлиенте
Процедура УкажитеВидДокументаПриИзменении(Элемент)
	
	объект.КлиентПоставщик = УкажитеВидДокументаПриИзмененииНаСервере(УкажитеВидДокумента);
	ИзменитьВидДокумента() ;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция   УкажитеВидДокументаПриИзмененииНаСервере(Знач УкажитеВидДокументаБК)
	
	Если УкажитеВидДокументаБК = Перечисления.ВидыДокументаРасходаТовара.ВозвратПоставщику Тогда  		
		Возврат Справочники.Поставщики.ФизическоеЛицо ;
	ИначеЕсли УкажитеВидДокументаБК = Перечисления.ВидыДокументаРасходаТовара.Реализация Тогда
		Возврат Справочники.Клиенты.ФизическоеЛицо;
	Иначе
		Возврат Справочники.Клиенты.ПустаяСсылка() ;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если УчетПоСериям Тогда
		Отказ = ПроверитьУчетПоСериям(Отказ);
	КонецЕсли;
	
	Если Не Отказ Тогда
		Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение тогда
			
			Если не значениеЗаполнено(объект.КлиентПоставщик) 
				и Вопрос(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Вы не указали Клиента или Поставщика.") + символы.ПС + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Списать этот товар?"), РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
				
				Отказ = Истина;
				
			ИначеЕсли ВестиУчетДвиженияДенег
				и объект.КлиентПоставщик = ФизическоеЛицо 
				и не объект.ТовараНаСумму = ПоступилоДенегПоКурсу 
				и Вопрос("" + ФизическоеЛицо + ?(объект.ТовараНаСумму > ПоступилоДенегПоКурсу, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке(" НЕ доплатил: "), ОбщийМодульПовтор.ПолучитьТекстНаЯзыке(" переплатил: ")) + сокрлп(?(объект.ТовараНаСумму - ПоступилоДенегПоКурсу > 0, объект.ТовараНаСумму - ПоступилоДенегПоКурсу, -(объект.ТовараНаСумму - ПоступилоДенегПоКурсу))) + " ?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
				
				Отказ = Истина;
				
			ИначеЕсли объект.Товары.Количество() > 10 Тогда
				Состояние(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Проведение документа.."));	
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	ПодготовкаКПроведению(Отказ);
	глПроверятьСообщения = Истина;
	
КонецПроцедуры

&НаСервере
Функция   ПроверитьУчетПоСериям(Отказ)
	
	если не отказ тогда
		
		МассивСерий = Новый Массив;
		Для Каждого СтрокаТовара Из Объект.Товары Цикл
			СерияНоменклатуры = СтрокаТовара.СерияНоменклатуры;
			
			Если ЗначениеЗаполнено(СерияНоменклатуры) Тогда
				Если МассивСерий.Найти(СерияНоменклатуры) = Неопределено Тогда
					МассивСерий.Добавить(СерияНоменклатуры);
					
				Иначе
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("В строке №") + СтрокаТовара.НомерСтроки + " " + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Серия повторяется!");
					Сообщение.Поле 	= "ТоварыСерияНоменклатуры";
					Сообщение.УстановитьДанные(Объект);
					Сообщение.Сообщить();
					
					Отказ = Истина;
					
				КонецЕсли;
				
			ИначеЕсли ОбщийМодульПовтор.ТоварВедетсяПоСериямИСерияОбязательна(СтрокаТовара.номенклатура) тогда
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("В строке №") + СтрокаТовара.НомерСтроки + " " + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("обязательная Серия НЕ указана!");
				Сообщение.Поле 	= "ТоварыСерияНоменклатуры";
				Сообщение.УстановитьДанные(Объект);
				Сообщение.Сообщить();
				
				Отказ = Истина;
				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат отказ;
	
КонецФункции //ПроверитьУчетПоСериям

&НаКлиенте
Процедура ПоступилоДенегПриИзменении(Элемент)
	
	РассчитатьЧтоОстанетсяСУчетомПоступления();
	ИзменитьВидДокумента() ;
	
КонецПроцедуры

&НаСервере
процедура РассчитатьЧтоОстанетсяСУчетомПоступления()
	
	ВалютаПродажи = Неопределено;
	
	если УчетПоКлиентам или УчетПоПоставщикам тогда
		
		ПоступилоДенегПоКурсу = ОбщийМодульСервер.ПоКурсу(Объект.ПоступилоДенег, , Объект.Валюта, Объект.Дата);
		
		ОстанетсяСУчетомПоступления = 0;
		
		если ЗначениеЗаполнено(объект.КлиентПоставщик)
			и не объект.КлиентПоставщик.Предопределенный тогда
			
			если ИспользоватьУчетВалют тогда
				
				Если ИспользоватьСложныйМеханизмЦен
					и ЗначениеЗаполнено(объект.ВидЦен)
					и ЗначениеЗаполнено(объект.ВидЦен.ВалютаЦены) Тогда
					
					ВалютаПродажи = объект.ВидЦен.ВалютаЦены;
				иначе
					ВалютаПродажи = ПредопределенноеЗначение("Справочник.Валюты.ОсновнаяВалюта");
				КонецЕсли;
				
				Если ЗначениеЗаполнено(объект.Валюта) Тогда
					валютапоступления = объект.Валюта;
				иначе
					валютапоступления = ПредопределенноеЗначение("Справочник.Валюты.ОсновнаяВалюта");
				КонецЕсли;
				
				ОстанетсяСУчетомПоступления = (ТекущийДолг + ?(валютапоступления = ВалютаПродажи, Объект.ТовараНаСумму, ОбщийМодульСервер.ПоКурсу(Объект.ТовараНаСумму, валютапоступления, ВалютаПродажи, объект.Дата)) - объект.ПоступилоДенег ) * объект.Курс;		
				
			иначеЕсли ВестиУчетДвиженияДенег тогда
				
				ОстанетсяСУчетомПоступления = ТекущийДолг + Объект.ТовараНаСумму - объект.ПоступилоДенег;
				
			КонецЕсли; 	
			элементы.ОстанетсяСУчетомПоступления.Видимость 	= не ОстанетсяСУчетомПоступления = 0;
			элементы.ОстанетсяСУчетомПоступления1.Видимость = элементы.ОстанетсяСУчетомПоступления.Видимость;
			
		иначе
			элементы.ОстанетсяСУчетомПоступления.Видимость 	= ложь;
			элементы.ОстанетсяСУчетомПоступления1.Видимость = ложь;
			
		КонецЕсли; 	
		
	иначе
		элементы.ОстанетсяСУчетомПоступления.Видимость 	= ложь;
		элементы.ОстанетсяСУчетомПоступления1.Видимость = ложь;
		
	КонецЕсли;
	
	Если ИспользоватьУчетВалют
		И ЗначениеЗаполнено(ПоказыватьСуммуРасходногоДокументаТакжеВВалюте) Тогда
		
		Если ВалютаПродажи = Неопределено Тогда
			Если ИспользоватьСложныйМеханизмЦен
				и ЗначениеЗаполнено(объект.ВидЦен)
				и ЗначениеЗаполнено(объект.ВидЦен.ВалютаЦены) Тогда
				
				ВалютаПродажи = объект.ВидЦен.ВалютаЦены;
			иначе
				ВалютаПродажи = ПредопределенноеЗначение("Справочник.Валюты.ОсновнаяВалюта");
			КонецЕсли;                     	
		КонецЕсли;
		
		СуммаВДругойВалюте = " " + Формат(ОбщийМодульСервер.ПоКурсу(Объект.Товары.Итог("Сумма"), ПоказыватьСуммуРасходногоДокументаТакжеВВалюте, ВалютаПродажи, Объект.Дата), "ЧДЦ=2") + " " + НаименованиеОсновнойВалюты;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура РаспечататьПровестиИЗакрыть(Команда)
	
	ПараметрыФормы = Новый структура;
	ПараметрыФормы.Вставить("СразуНаПечать", Истина);
	ПараметрыФормы.Вставить("СразуЗакрыть", Истина);
	
	ФормаПечати = получитьформу("ОбщаяФорма.ФормаПечати", ПараметрыФормы);
	Печать(ФормаПечати.Результат,Объект.Ссылка);
	
	ФормаПечати.Результат.ОтображатьСетку = Ложь;
	ФормаПечати.Результат.Защита = Истина;
	ФормаПечати.Результат.ТолькоПросмотр = Истина;
	ФормаПечати.Результат.ОтображатьЗаголовки = Ложь;
	ФормаПечати.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("печать:") + " " + ЭтаФорма.Заголовок;
	ФормаПечати.открыть();	
	
	если не ДокументЗаблокирован тогда
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));	
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура Печать(ТабДок, ПараметрКоманды)
	
	ОбщийМодульСервер.ДобавитьСобытиеЖурналаНаСервере(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Напечатал Расход товара "), 2);
	Документы.РасходыТовара.Печать(ТабДок, ПараметрКоманды);
	
КонецПроцедуры

&НаКлиенте
Процедура НазначитьСкидкуДляВсехСтрок(Команда)
	
	РазмерСкидки = 0;
	
	если ВвестиЧисло(РазмерСкидки, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Введите %процент скидки:"), 10,4 ) тогда
		
		НазначитьСкидкуДляВсехСтрокНаСервере(РазмерСкидки);                                                                        	
	КонецЕсли;
	ТоварыПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура НазначитьСкидкуДляВсехСтрокНаСервере(Знач РазмерСкидки)
	
	Для каждого СтрокаТовара Из Объект.товары Цикл
		
		СтрокаТовара.процентСкидки = РазмерСкидки;
		ПересчитатьСтрокуНаСервере(СтрокаТовара);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СменитьВидОкна(Команда)
	
	сменитьвидотображениядокумента();
	ПроверкаВидаОтображенияДокумента() ;
	ОбработатьБлокировку();
	Этаформа.ОбновитьОтображениеДанных();
	
КонецПроцедуры

&НаСервере
Процедура сменитьвидотображениядокумента()
	
	ПредставитьДокументРасходаТовараДвумяКолонками = не ПредставитьДокументРасходаТовараДвумяКолонками;
	Константы.ПредставитьДокументРасходаТовараДвумяКолонками.Установить(ПредставитьДокументРасходаТовараДвумяКолонками) ;
	
КонецПроцедуры

&НаКлиенте
Процедура ПозицияИзСпискаЧастогоСпроса(Команда)
	
	СписокНоменклатурыЧастогоСпроса = ОбщийМодульПовтор.ПолучитьСписокНоменклатурыБыстрогоСпроса();	
	
	если СписокНоменклатурыЧастогоСпроса.количество() тогда
		
		формаменеджерапозицийчастогоспроса = получитьформу("РегистрСведений.НоменклатураЧастогоСпроса.ФормаСписка");
		формаменеджерапозицийчастогоспроса.открытьМодально();
		ОбновитьЧастыйСпрос();
		
	иначе
		РаботаетВыборЧастогоСпроса = истина;
		
		если ПредставитьДокументРасходаТовараДвумяКолонками тогда
			
			попытка
				выполнить(" элементы.ТоварыНоменклатура1.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать; ");
			исключение //старая 1С				
			КонецПопытки;
			
			элементы.Товары1.ДобавитьСтроку();			
			ТекущиеДанные = Элементы.Товары1.ТекущиеДанные;
			
			Номенклатура = ВыбратьИзСписка(СписокНоменклатурыЧастогоСпроса, ТекущиеДанные.Номенклатура); 
			если не Номенклатура = Неопределено тогда
				ТекущиеДанные.Номенклатура = Номенклатура.Значение;
				элементы.Товары1.ЗакончитьРедактированиеСтроки(ложь); 	
				ПриИзмененииНоменклатуры() ;
			иначе
				элементы.Товары1.ЗакончитьРедактированиеСтроки(истина);
			КонецЕсли;
			
			попытка
				выполнить(" элементы.ТоварыНоменклатура1.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.Авто; ");
			исключение //старая 1С				
			КонецПопытки;
			
		иначе
			попытка
				выполнить(" элементы.ТоварыНоменклатура.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать; ");
			исключение //старая 1С				
			КонецПопытки;
			
			элементы.Товары.ДобавитьСтроку();
			ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
			
			Номенклатура = ВыбратьИзСписка(СписокНоменклатурыЧастогоСпроса, ТекущиеДанные.Номенклатура) ;
			если не Номенклатура = Неопределено тогда
				ТекущиеДанные.Номенклатура = Номенклатура.Значение;
				элементы.Товары.ЗакончитьРедактированиеСтроки(ложь);	                                   	
				ПриИзмененииНоменклатуры() ;
			иначе
				элементы.Товары.ЗакончитьРедактированиеСтроки(истина);
			КонецЕсли;
			
			попытка
				выполнить(" элементы.ТоварыНоменклатура.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.Авто; ");
			исключение //старая 1С				
			КонецПопытки;
			
		КонецЕсли;
		
		РаботаетВыборЧастогоСпроса = ложь;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатура1АвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	СтандартнаяОбработка = не РаботаетВыборЧастогоСпроса;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	СтандартнаяОбработка = не РаботаетВыборЧастогоСпроса;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатура1ОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = не РаботаетВыборЧастогоСпроса;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	СтандартнаяОбработка = не РаботаетВыборЧастогоСпроса;
КонецПроцедуры

&НаКлиенте
Процедура ЧастныйПокупатель(Команда)
	
	объект.КлиентПоставщик = ФизическоеЛицо;
	ПриСменеКонтрагента();
	
КонецПроцедуры

&НаКлиенте
Процедура Валюта1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекущаяВалюта = объект.Валюта;
КонецПроцедуры

&НаКлиенте
Процедура ВалютаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ТекущаяВалюта = объект.Валюта;
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	объект.Курс = ОбновитьКурс(Объект.Валюта, Объект.Дата);	
	элементы.Курс.Видимость 	= не объект.Курс = 1 и ИспользоватьУчетВалют;
	элементы.Курс1.Видимость 	= элементы.Курс.Видимость;
	
	Если ИспользуетсяДатаКомиссии Тогда
		ОбновитьДатуКомиссии();
	КонецЕсли;
	
	РассчитатьЧтоОстанетсяСУчетомПоступления();
	ОбновитьДатуОтсрочки();
	
КонецПроцедуры

&НаСервере
Процедура ПереСчитатьУчетныеОстатки()
	
	Для Каждого СтрокаТовара Из Объект.Товары Цикл
		СтрокаТовара.ОстатокСУчетомДокумента = остатоктоваравстроке(СтрокаТовара.Номенклатура, СтрокаТовара.Количество) ;	
	КонецЦикла;
	
КонецПроцедуры //ПереСчитатьУчетныеОстатки

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	
	Если ДемонстрироватьИнформационнуюКолонкуОстатокТовараСУчетомДокументаВНепроведенныхДокументах Тогда
		ПереСчитатьУчетныеОстатки();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РазблокироватьСканер(Команда)
	
	СканерЗаблокирован = Ложь;
	элементы.разблокироватьсканер.видимость 	= СканерЗаблокирован;
	элементы.разблокироватьсканер1.видимость 	= СканерЗаблокирован;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
	Если ПоказыватьИзображения
		И ЗначениеЗаполнено(Объект.Организация)
		И СопровождатьОрганизацииИзображениями Тогда
		
		ПоказатьИзображениеРеквизита(Объект.Организация);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Организация) тогда
		если ОбщийМодульПовтор.ПолучитьПараметрСеанса("ВестиУчетОтдельныхДоговоровСКонтрагентамиПС") Тогда
			
			Если ЗначениеЗаполнено(Объект.Договор) Тогда
				Если не объект.Договор.Организация = Объект.Организация Тогда		
					объект.Договор = Справочники.Договора.ПустаяСсылка() ;	
				КонецЕсли;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(Объект.Договор)
				И ЗначениеЗаполнено(Объект.Клиент) Тогда
				
				Объект.Договор = ОбщийМодульСервер.ПодобратьДоговор(Объект.Организация, Объект.КлиентПоставщик, Объект.Дата, Объект.ВидЦен);
			КонецЕсли;	
		КонецЕсли;
		Если ВестиУчетПоСкладу
			и не ЗначениеЗаполнено(Объект.Склад) Тогда
			
			Объект.Склад = Объект.Организация.Склад;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	ДоговорПриИзмененииНаСервере();
	ПриСменеКонтрагента();
	
	Если ПоказыватьИзображения
		И ЗначениеЗаполнено(Объект.Договор)
		И СопровождатьДоговораИзображениями Тогда
		
		ПоказатьИзображениеРеквизита(Объект.Договор);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДоговорПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Договор) Тогда //насильно
		
		Если НЕ Объект.КлиентПоставщик 	= Объект.Договор.КлиентПоставщик тогда
			Объект.КлиентПоставщик 	= Объект.Договор.КлиентПоставщик;             	
		КонецЕсли;
		
		если не Объект.КлиентПоставщик 	= Объект.Договор.КлиентПоставщик тогда
			Объект.Организация 		= Объект.Договор.Организация;             	
		КонецЕсли;
		
		ПредусматриваетСтрогиеЦены = Объект.Договор.ПредусматриваетСтрогиеЦены;
		Если ПредусматриваетСтрогиеЦены Тогда
			
			Договор = Объект.Договор;
			Дата 	= Объект.Дата;
			ВидЦен 	= Объект.ВидЦен;
			
			Для Каждого СтрокаТовара Из Объект.Товары Цикл
				Цена 	= ОбщийМодульСервер.ПолучитьЦенуНаСервере(Строкатовара.Номенклатура, ВидЦен, Дата, Ложь, СтрокаТовара.Количество, Договор, ПредусматриваетСтрогиеЦены, Строкатовара.Цена, Объект.Ссылка, , СтрокаТовара.ЕдиницаИзмерения);
				
				Если НЕ Цена = СтрокаТовара.Цена Тогда
					СтрокаТовара.ПроцентСкидки 	= 0;
					СтрокаТовара.Цена 			= Цена;
					СтрокаТовара.СуммаБезСкидки = СтрокаТовара.Количество * СтрокаТовара.Цена;
					СтрокаТовара.Сумма 			= СтрокаТовара.СуммаБезСкидки;	
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;				
		
	Иначе		
		Дата 	= Объект.Дата;
		ВидЦен 	= Объект.ВидЦен;
		
		Для Каждого СтрокаТовара Из Объект.Товары Цикл
			СтрокаТовара.Цена = ОбщийМодульСервер.ПолучитьЦенуНаСервере(Строкатовара.Номенклатура, ВидЦен, Дата, Ложь, СтрокаТовара.Количество, , , Строкатовара.Цена, Объект.Ссылка, , СтрокаТовара.ЕдиницаИзмерения);
			
			если ИспользоватьСкидки тогда
				СтрокаТовара.СуммаБезСкидки = СтрокаТовара.Количество * СтрокаТовара.Цена;	
				СтрокаТовара.ПроцентСкидки 	= ПолучитьПроцентСкидкиНаСервере(СтрокаТовара.Номенклатура, СтрокаТовара.Количество);	
				
				если не СтрокаТовара.СуммаБезСкидки = 0 тогда
					СтрокаТовара.Сумма = СтрокаТовара.СуммаБезСкидки - СтрокаТовара.ПроцентСкидки * (СтрокаТовара.СуммаБезСкидки / 100);
				иначе
					СтрокаТовара.Сумма = 0;
				КонецЕсли;
				
			иначе
				СтрокаТовара.Сумма = СтрокаТовара.Количество * СтрокаТовара.Цена;		
			КонецЕсли;	
			
		КонецЦикла;
		
	КонецЕсли;
	
	ОбновитьДатуОтсрочки();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если НЕ Отказ
		И ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Если ЗначениеЗаполнено(объект.КлиентПоставщик) Тогда
			
			Если ТипЗнч(объект.КлиентПоставщик) = Тип("СправочникСсылка.Клиенты") 
				И ВестиУчетПоСкладу
				И ЗначениеЗаполнено(Объект.Склад) 
				И Объект.Склад.СДанногоСкладаПродаватьЗапрещено Тогда
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Вы не склад, с которого нельзя продавать!");
				Сообщение.Поле  = "Склал";
				Сообщение.УстановитьДанные(ТекущийОбъект);
				Сообщение.Сообщить();
				
				Отказ = Истина;				
			КонецЕсли;
			
			Если ОбщийМодульПовтор.ПолучитьПараметрСеанса("ВестиУчетОтдельныхДоговоровСКонтрагентамиПС") Тогда
				
				Если НЕ ЗначениеЗаполнено(Объект.Договор) тогда
					Если ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ДоговорДолженБытьВыбранОбязательноИначеПрограммаВыберетДоговорПоУмолчанию") Тогда
						
						ДатаСКоторойТребуетсяОбязательноеУказаниеДоговора = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ДатаСКоторойТребуетсяОбязательноеУказаниеДоговора");
						
						Если ДатаСКоторойТребуетсяОбязательноеУказаниеДоговора = '00010101000000' 
							ИЛИ ДатаСКоторойТребуетсяОбязательноеУказаниеДоговора <= Объект.Дата Тогда
							
							Сообщение = Новый СообщениеПользователю;
							Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Вы не указали обязательный Договор с контрагентом!");
							Сообщение.Поле  = "Договор";
							Сообщение.УстановитьДанные(ТекущийОбъект);
							Сообщение.Сообщить();
							
							Отказ = Истина;
							
						КонецЕсли;	
					КонецЕсли;
					
				ИначеЕсли Объект.Договор.ПредусматриваетСтрогиеЦены тогда
					
					Договор = Объект.Договор;
					Дата 	= Объект.Дата;
					ВидЦен 	= Объект.ВидЦен;
					
					Для Каждого СтрокаТовара Из Объект.Товары Цикл
						
						Цена = ОбщийМодульСервер.ПолучитьЦенуНаСервере(Строкатовара.Номенклатура, ВидЦен, Дата, Ложь, СтрокаТовара.Количество, Договор, Истина, Строкатовара.Цена, Объект.Ссылка, , СтрокаТовара.ЕдиницаИзмерения);
						Если НЕ Строкатовара.Цена = Цена тогда
							
							Отказ = Истина;
							
							Сообщение = Новый СообщениеПользователю;
							Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Цена в строке №") + " " + СтрокаТовара.НомерСтроки + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке(" не соответствует строгой цене из договора:") + " " + Цена;
							Сообщение.УстановитьДанные(ТекущийОбъект);					
							Сообщение.Сообщить();
							
						КонецЕсли;
					КонецЦикла;
					
				КонецЕсли;		
			КонецЕсли;		
		КонецЕсли;	
		
		Если НЕ Отказ Тогда
			Для Каждого СтрокаТовара Из ТекущийОбъект.Товары Цикл
				
				Если СтрокаТовара.процентскидки = 0
					И строкатовара.суммабезскидки = 0 Тогда
					
					строкатовара.суммабезскидки = строкатовара.сумма;
				КонецЕсли;
			КонецЦикла;	
		КонецЕсли;
		
		Если не отказ
			И ИспользоватьРегистрациюПриемаИВыдачиДенегПрямоВДокументахРасходаИПрихода Тогда
			
			Если НЕ ЗначениеЗаполнено(Объект.ХранилищеДенег) Тогда
				
				Объект.ХранилищеДенег = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ОсновноеХранилищеДенег") ;
				Если НЕ ЗначениеЗаполнено(Объект.ХранилищеДенег) Тогда
					Объект.ХранилищеДенег = ПредопределенноеЗначение("Справочник.ХранилищаДенег.ОсновнаяКассаВОсновнойВалюте");
				КонецЕсли;	
			КонецЕсли;
			
			Если РазрешеноПриниматьПриРеализацииДеньгиСразуВНесколькихВалютах Тогда
				
				Если НЕ Объект.ПоступилоДенег = 0 
					И Объект.Оплаты.Количество() = 0 Тогда
					
					Оплата = Объект.Оплаты.Добавить();
					Оплата.ХранилищеДенег = Объект.ХранилищеДенег;
					Оплата.ФормаОплаты    = ?(ЗначениеЗаполнено(Объект.ХранилищеДенег), Объект.ХранилищеДенег.ФормаОплаты, ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ФормаОплатыДляДенегВДокументахРасходаИПриходаТоваров")) ;				
					Оплата.Сумма  = Объект.ПоступилоДенег;
					Оплата.Валюта = Объект.Валюта;
					Оплата.Курс	  = Объект.Курс; 	
				КонецЕсли;
				
				ОбновитьСуммуОплаты();
				
				Объект.ПоступилоДенег = ИтогоОплата;
				Объект.Курс   = 1;
				Объект.Валюта = ПредопределенноеЗначение("Справочник.Валюты.ОсновнаяВалюта");
				
			КонецЕсли;
		КонецЕсли;
		
		Если не отказ Тогда			
			Отказ = ПроверитьНаОтказ();
		КонецЕсли;    	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
процедура ПодготовкаКПроведению(Отказ)
	
	Если Не Отказ тогда
		ДокументОбъект = РеквизитФормыВЗначение("Объект"); 
		ДокументОбъект.ПодготовкаКПроведению(Отказ);
		ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция   ПроверитьНаОтказ()
	
	Отказ = ложь;
	
	Ссылка = Объект.Ссылка;
	Валюта = Объект.Валюта;
	Дата   = Объект.Дата;
	ВидЦен = Объект.ВидЦен;
	Склад  = Объект.Склад;
	ЭтоЗаказ = Объект.ЭтоЗаказ;
	Товары   = Объект.Товары;
	Договор  = Объект.Договор;
	ПоступилоДенег  = объект.ПоступилоДенег;
	ХранилищеДенег  = объект.ХранилищеДенег;
	КлиентПоставщик = Объект.КлиентПоставщик;
	ТовараНаСумму   = Объект.ТовараНаСумму;
	ТовараВКоличестве = Объект.ТовараВКоличестве;	
	
	ЗначениеЗаполненоКлиентПоставщик = ЗначениеЗаполнено(КлиентПоставщик);
	Клиент = ЗначениеЗаполненоКлиентПоставщик И (ТипЗнч(КлиентПоставщик) = Тип("СправочникСсылка.Клиенты"));
	ВестиУчетДвиженияДенег = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетДвиженияДенег") ;
	
	ВестиУчетЗаказовКлиентов = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетЗаказовКлиентов") ;
	
	Если ТовараВКоличестве = 0
		И НЕ ТовараНаСумму = 0 
		И НЕ ЗначениеЗаполненоКлиентПоставщик Тогда
		
		ОбщийМодульСервисСервер.ДобавитьСообщениеПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Списание услуги? Контрагент не указан!"), , Объект.Ссылка);
	КонецЕсли;
	
	Если ОбщийМодульПовтор.ПолучитьПараметрСеанса("ВестиУчетОтдельныхДоговоровСКонтрагентамиПС")
		И ЗначениеЗаполнено(Договор) Тогда
		
		Отказ = ОбщийМодульСервер.ПроверитьОтказПоСуммеИлиКоличествуДляДоговора(Отказ, Договор, Клиент, Дата, ТовараНаСумму, ТовараВКоличестве, Ложь, ПоступилоДенег, Ссылка);
	КонецЕсли;
	
	Если Не Отказ ТОгда
		
		ИспользоватьСложныйМеханизмЦен = ОбщийМодульПовтор.ПолучитьПараметрСеанса("ИспользоватьСложныйМеханизмЦенПС") ;
		ВестиУчетВаловойПрибыли 	   = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетВаловойПрибыли") ;
		
		ВестиУчетПоСкладам = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетПоСкладам");
		
		Если ВестиУчетПоСкладам
			и НЕ ЗначениеЗаполнено(Склад) Тогда
			
			ОбщийМодульСервисСервер.ДобавитьСообщениеПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Не указан склад!"), , Ссылка);
			
			Отказ = Истина;	
		КонецЕсли;
		
		Если ИспользоватьСложныйМеханизмЦен
			и ЗначениеЗаполнено(видцен)
			и ЗначениеЗаполнено(видцен.ВалютаЦены) Тогда
			
			ВалютаЦены = видцен.ВалютаЦены ;
		иначе
			ВалютаЦены = ОбщийМодульПовтор.ЗначениеПредопределенного("Справочники.Валюты.ОсновнаяВалюта") ;
		КонецЕсли;
		
		ПоведениеПрограммыПриРасходеТоваровНижеРекомендованногоМинимальногоОстатка = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ПоведениеПрограммыПриРасходеТоваровНижеРекомендованногоМинимальногоОстатка");
		ПоведениеПрограммыПриРасходеТоваровБезОстатка = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ПоведениеПрограммыПриРасходеТоваровБезОстатка");
		
		ОстаткиСледуетПроверять = (ЗначениеЗаполнено(ПоведениеПрограммыПриРасходеТоваровНижеРекомендованногоМинимальногоОстатка)
		И НЕ ПоведениеПрограммыПриРасходеТоваровНижеРекомендованногоМинимальногоОстатка = Перечисления.ИгнорироватьРазрешитьЗапретить.Игнорировать )
		ИЛИ (ЗначениеЗаполнено(ПоведениеПрограммыПриРасходеТоваровБезОстатка)
		И НЕ ПоведениеПрограммыПриРасходеТоваровБезОстатка = Перечисления.ИгнорироватьРазрешитьЗапретить.Игнорировать) ;
		
		СтруктураТаблиц    = ОбщийМодульСервер.ПолучитьТаблицыЦенСписанияИОстатков(Объект.ссылка, склад, дата, ОстаткиСледуетПроверять);
		ТаблицаЦенСписания = СтруктураТаблиц.ТаблицаЦенСписания;
		
		если ОстаткиСледуетПроверять тогда
			ГТ = СтруктураТаблиц.ТаблицаОстатков;	
		КонецЕсли;	
		
		Для Каждого ТекСтрокаТовары Из Товары Цикл
			
			Номенклатура 	  = ТекСтрокаТовары.Номенклатура;
			СерияНоменклатуры = ТекСтрокаТовары.СерияНоменклатуры;
			Количество 		  = ТекСтрокаТовары.Количество;
			КоличествоОстаток = неопределено;
			
			если ОстаткиСледуетПроверять тогда
				СтрокаОстаток = ГТ.найти(номенклатура, "Номенклатура");
				
				Если не СтрокаОстаток = Неопределено Тогда
					ПредопределенныйТовар = СтрокаОстаток.НеОтслеживатьОстаток или СтрокаОстаток.Предопределенный;
					ЭтоНабор 			  = СтрокаОстаток.ЭтоНабор;
					
				иначе
					ЭтоНабор 			  = ОбщийМодульПовтор.ЭтоНабор(Номенклатура);
					ПредопределенныйТовар = ОбщийМодульПовтор.ТоварНеУчитываетсяПоКоличеству(Номенклатура);		
					
				КонецЕсли;			
				
			иначе 			
				ЭтоНабор 			  = ОбщийМодульПовтор.ЭтоНабор(Номенклатура);
				ПредопределенныйТовар = ОбщийМодульПовтор.ТоварНеУчитываетсяПоКоличеству(Номенклатура);		
				
			КонецЕсли;	
			
			если не ПредопределенныйТовар
				и не этонабор тогда
				
				если ОстаткиСледуетПроверять тогда
					Отказ = ОбщийМодульСервер.ПроверитьОстатокТоваров(ПоведениеПрограммыПриРасходеТоваровНижеРекомендованногоМинимальногоОстатка, ПоведениеПрограммыПриРасходеТоваровБезОстатка, Склад, Номенклатура, Количество, Дата, Истина, КоличествоОстаток, Ссылка);	
				КонецЕсли;
				
			КонецЕсли;
			
			Если Не отказ тогда
				
				сумма 	 = ТекСтрокаТовары.Сумма;
				СуммаТов = ОбщийМодульСервер.ПоКурсу(Сумма, , ВалютаЦены, Дата);			
				
				если ЭтоНабор Тогда 										
					отказ = обработатьОТКАЗдвижениядлянабора(Номенклатура, ТекСтрокаТовары.Количество, СуммаТов, ВестиУчетВаловойПрибыли, клиент, ЗначениеЗаполненоКлиентПоставщик, отказ, ПоведениеПрограммыПриРасходеТоваровНижеРекомендованногоМинимальногоОстатка, ПоведениеПрограммыПриРасходеТоваровБезОстатка);
					
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	если ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ВестиУчетДвиженияДенег") 
		и ИспользоватьРегистрациюПриемаИВыдачиДенегПрямоВДокументахРасходаИПрихода тогда
		
		Если РазрешеноПриниматьПриРеализацииДеньгиСразуВНесколькихВалютах Тогда
			Для Каждого Оплата Из Объект.Оплаты Цикл
				если НЕ Оплата.Сумма = 0 тогда
					
					Если ЗначениеЗаполнено(Оплата.ХранилищеДенег) Тогда
						ФормаОплаты = Оплата.ХранилищеДенег.ФормаОплаты;
					Иначе
						ФормаОплаты = Оплата.ФормаОплаты;				
					КонецЕсли;
					
					Отказ = ОбщийМодульСервер.ПроверитьОстатокДенежныхСредств( -Оплата.Сумма, Объект.Дата, ФормаОплаты, Оплата.Валюта, Оплата.ХранилищеДенег, , Объект.Ссылка);	
					
				КонецЕсли;   	
			КонецЦикла;
			
		Иначеесли НЕ ПоступилоДенег = 0 тогда
			
			Если ЗначениеЗаполнено(ХранилищеДенег) Тогда
				ФормаОплаты = ХранилищеДенег.ФормаОплаты;
			Иначе
				ФормаОплаты = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ФормаОплатыДляДенегВДокументахРасходаИПриходаТоваров") ;				
			КонецЕсли;
			
			Отказ = ОбщийМодульСервер.ПроверитьОстатокДенежныхСредств( -ПоступилоДенег, Дата, ФормаОплаты, Валюта, ХранилищеДенег, , Объект.Ссылка);	
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат Отказ;
	
КонецФункции //ПроверитьНаОтказ

&НаСервере
Функция   ОбработатьОТКАЗдвижениядлянабора(Знач Номенклатура, Знач КоличествоВх, Знач Сумма, Знач ВестиУчетВаловойПрибыли, Знач клиент, Знач ЗначениеЗаполненоКлиентПоставщик, отказ, Знач ПоведениеПрограммыПриРасходеТоваровНижеРекомендованногоМинимальногоОстатка, Знач ПоведениеПрограммыПриРасходеТоваровБезОстатка) //для вложенных наборов
	
	общкво = Номенклатура.Состав.Итог("Количество");
	Если общкво = 0 Тогда
		общкво = 1;
	КонецЕсли;
	
	для каждого СтрокаСоставаНабора из Номенклатура.Состав цикл
		СуммаЭлемента = (Сумма / общкво) * СтрокаСоставаНабора.количество;
		НоменклатураСостава = СтрокаСоставаНабора.Номенклатура;
		
		Если НоменклатураСостава.ЭтоНабор = ИСТИНА Тогда
			отказ = обработатьОТКАЗдвижениядлянабора(НоменклатураСостава, КоличествоВх * СтрокаСоставаНабора.количество, СуммаЭлемента, ВестиУчетВаловойПрибыли, клиент, ЗначениеЗаполненоКлиентПоставщик, отказ, ПоведениеПрограммыПриРасходеТоваровНижеРекомендованногоМинимальногоОстатка, ПоведениеПрограммыПриРасходеТоваровБезОстатка);
		иначе
			
			количество = СтрокаСоставаНабора.количество * КоличествоВх;
			
			ПредопределенныйТовар = ОбщийМодульПовтор.ТоварНеУчитываетсяПоКоличеству(НоменклатураСостава);
			
			Если НЕ ПредопределенныйТовар Тогда
				Отказ = ОбщийМодульСервер.ПроверитьОстатокТоваров(ПоведениеПрограммыПриРасходеТоваровНижеРекомендованногоМинимальногоОстатка, ПоведениеПрограммыПриРасходеТоваровБезОстатка, Объект.Склад, НоменклатураСостава, Количество, Объект.Дата, Истина, , Объект.Ссылка);
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;	
	
	Возврат Отказ;
	
КонецФункции

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	глЧислоОбъектов = глЧислоОбъектов + 1; глПроверятьСообщения = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеИзображения(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) 
		и Вопрос(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Сначала следует записать этот элемент. Записать?"), РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		
		Записать();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПараметрыФормы = Новый Структура("СвязанныйОбъект", Объект.Ссылка);
		ОткрытьФорму("Справочник.Изображения.ФормаСписка", ПараметрыФормы);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИзображение(Команда)
	
	Если НЕ ЗначениеЗаполнено(объект.Ссылка) 
		и Вопрос(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Сначала следует записать этот элемент. Записать?"), РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		
		Записать();			
	КонецЕсли;
	
	Если ЗначениеЗаполнено(объект.Ссылка) Тогда
		ПараметрыФормы = Новый Структура("СвязанныйОбъект", объект.Ссылка);
		формаИзображения = ПолучитьФорму("Справочник.Изображения.ФормаОбъекта", ПараметрыФормы);	
		формаИзображения.Открыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)	
	ПоказатьТовар();	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьТовар()
	
	Если ПоказыватьИзображения
		И СопровождатьНоменклатуруИзображениями Тогда
		
		СтрокаТовара = Элементы.Товары.ТекущиеДанные;	
		
		Если Не СтрокаТовара = Неопределено Тогда
			Номенклатура = СтрокаТовара.Номенклатура;
			Если ЗначениеЗаполнено(Номенклатура) ТОгда
				Если не Номенклатура = НоменклатураИзображения Тогда
					НоменклатураИзображения = Номенклатура;
					ЕстьЧтоПоказать = ПоказатьИзображениеРеквизита(Номенклатура);	
				КонецЕсли;
			КонецЕсли;			                     	
		КонецЕсли;
		
		Если НоменклатураИзображения = Неопределено Тогда
			элементы.СсылкаНаИзображение.Видимость     = Ложь;
			элементы.ИзображениеВБазеДанных.Видимость  = Ложь;
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

Функция   ПоказатьИзображениеРеквизита(Знач ЭлементСИзображением)
	
	ОсновноеИзображениеОбъекта = ОбщийМодульПовтор.ПолучитьОсновноеИзображениеОбъекта(ЭлементСИзображением);
	Результат = Ложь;
	
	Если ЗначениеЗаполнено(ОсновноеИзображениеОбъекта) Тогда				
		
		СтруктураИзображения = ОбщийМодульСервер.ПолучитьСтруктуруИзображения(ОсновноеИзображениеОбъекта);
		ПодСсылку = СтруктураИзображения.ПодСсылку;
		
		Если СтруктураИзображения.ИзображениеВБазеДанных ТОгда
			элементы.СсылкаНаИзображение.Видимость     = Ложь;
			элементы.ИзображениеВБазеДанных.Видимость  = Истина;
			
			если СтруктураИзображения.РазмерПриОтображении = 1 тогда
				элементы.ИзображениеВБазеДанных.РазмерКартинки = РазмерКартинки.АвтоРазмер
			иначеесли СтруктураИзображения.РазмерПриОтображении = 2 тогда
				элементы.ИзображениеВБазеДанных.РазмерКартинки = РазмерКартинки.Пропорционально
			иначеесли СтруктураИзображения.РазмерПриОтображении = 3 тогда
				элементы.ИзображениеВБазеДанных.РазмерКартинки = РазмерКартинки.Растянуть
			иначеесли СтруктураИзображения.РазмерПриОтображении = 4 тогда
				элементы.ИзображениеВБазеДанных.РазмерКартинки = РазмерКартинки.РеальныйРазмер
			иначеесли СтруктураИзображения.РазмерПриОтображении = 5 тогда
				элементы.ИзображениеВБазеДанных.РазмерКартинки = РазмерКартинки.Черепица
			конецесли; 
			
		иначе
			элементы.СсылкаНаИзображение.Видимость     = Истина;
			элементы.ИзображениеВБазеДанных.Видимость  = Ложь;
		КонецЕсли; 		
		
		Результат = Истина;
		
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОтключитьИзображения(Команда)
	
	ПоказыватьИзображения = не ПоказыватьИзображения;
	если не ПоказыватьИзображения Тогда
		элементы.СсылкаНаИзображение.Видимость     = Ложь;
		элементы.ИзображениеВБазеДанных.Видимость  = Ложь;	
		элементы.СсылкаНаИзображение1.Видимость    = Ложь;
		элементы.ИзображениеВБазеДанных1.Видимость = Ложь;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьГарантийногоТалона(Команда)
	
	ПараметрыВыбораЭлементов = Новый Структура;
	ВыборЭлементовПечатнойФормы = получитьформу("ОбщаяФорма.ВыборЭлементовПечатнойФормы", ПараметрыВыбораЭлементов);
	ПереченьЭлементов = ВыборЭлементовПечатнойФормы.ОткрытьМодально();
	
	Если НЕ ПереченьЭлементов = Неопределено Тогда
		ПараметрыФормы = новый Структура;
		ПараметрыФормы.Вставить("Документ", Объект.Ссылка);		
		ФормаПечати = получитьформу("ОбщаяФорма.ФормаПечати", ПараметрыФормы);
		
		ПараметрыПечати = Новый Структура("ПереченьЭлементов", ПереченьЭлементов);
		ПараметрыПечати.Вставить("Ссылка", Объект.Ссылка);
		
		ПечатьГарантийногоТалонаНаСервере(ФормаПечати.Результат, ПараметрыПечати);
		
		ФормаПечати.Результат.ОтображатьСетку = Ложь;
		ФормаПечати.Результат.Защита 		  = Истина;
		ФормаПечати.Результат.ТолькоПросмотр  = Истина;
		ФормаПечати.Результат.ОтображатьЗаголовки = Ложь;
		ФормаПечати.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("печать: Гарантийные обязательства");
		
		ФормаПечати.открыть();	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПечатьГарантийногоТалонаНаСервере(ТабДок, Знач ПараметрыПечати)  
	
	ОбщийМодульСервер.ДобавитьСобытиеЖурналаНаСервере(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Напечатал гарантийные обязательства. "), 2);
	ОбщийМодульТоварСервер.ПечатьГарантийногоТалона(ТабДок, ПараметрыПечати);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборНоменклатуры(Команда)
	
	ПараметрыФормы = Новый Структура("Дата", Объект.Дата);
	ПараметрыФормы.Вставить("Документ", Объект.Ссылка);
	ПараметрыФормы.Вставить("ВидЦен", Объект.ВидЦен);
	ПараметрыФормы.Вставить("Добавление", Истина);
	ПараметрыФормы.Вставить("Договор", Объект.Договор);
	ПараметрыФормы.Вставить("Склад", Объект.Склад);
	ПараметрыФормы.Вставить("Товары", Объект.Товары);
	
	Если ПредставитьДокументРасходаТовараДвумяКолонками Тогда
		ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаПодбора", ПараметрыФормы, Элементы.Товары1);
	Иначе
		ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаПодбора", ПараметрыФормы, Элементы.Товары);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Объект.Товары.Очистить();
		Для каждого Подбор Из ВыбранноеЗначение Цикл
			
			Строка = Объект.Товары.Добавить();
			Строка.номенклатура      = Подбор.номенклатура;
			Строка.СерияНоменклатуры = Подбор.СерияНоменклатуры;
			Строка.Количество        = Подбор.Количество;
			Строка.Цена  			 = Подбор.Цена;
			Строка.Сумма 			 = Подбор.Сумма;
			Строка.ОСтроке 			 = Подбор.ОСтроке;
			
			ПриИзмененииНоменклатуры(Строка, Истина);
			
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры   

&НаКлиенте
Процедура ПечатьНалоговойНакладной(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Записать();
	КонецЕсли;
	
	ПараметрыВыбораЭлементов = Новый Структура("НалоговаяНакладная", Истина);
	ПараметрыВыбораЭлементов.Вставить("Организация", Объект.Организация);
	ВыборЭлементовПечатнойФормы = ПолучитьФорму("ОбщаяФорма.ВыборЭлементовПечатнойФормы", ПараметрыВыбораЭлементов);
	ПереченьЭлементов = ВыборЭлементовПечатнойФормы.ОткрытьМодально();
	
	Если НЕ ПереченьЭлементов = Неопределено Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Документ", Объект.Ссылка);		
		ФормаПечати = получитьформу("ОбщаяФорма.ФормаПечати", ПараметрыФормы);
		
		ПараметрыПечати = Новый Структура("ПереченьЭлементов", ПереченьЭлементов);
		ПараметрыПечати.Вставить("Ссылка", Объект.Ссылка);
		ПараметрыПечати.Вставить("ПечататьОригинал", ПереченьЭлементов.ПечататьОригинал);
		ПараметрыПечати.Вставить("ПечататьКопию",  ПереченьЭлементов.ПечататьКопию);
		
		ФормаПечатиРезультатОчистить(ФормаПечати.Результат);
		
		Если ПереченьЭлементов.ПечататьТОРГ12 Тогда
			ПечатьТорг12(ФормаПечати.Результат, Объект.Ссылка, Истина, , ПереченьЭлементов.ТОРГ12ВДваЭкземпляра);
		КонецЕсли;
		Если ПереченьЭлементов.ПечатьСчета Тогда
			ПечатьРН(ФормаПечати.Результат, Объект.Ссылка, Истина, , ПереченьЭлементов.СчетВДваЭкземпляра);
		КонецЕсли;
		Если ПереченьЭлементов.ПечататьТакжеРасходнуюНакладную Тогда
			ПечатьРН(ФормаПечати.Результат, Объект.Ссылка, Ложь, ПереченьЭлементов.ПечатьСчета, ПереченьЭлементов.РасходнаяВДваЭкземпляра, ПереченьЭлементов.ЗаголовокРасходнойНакладной);
		КонецЕсли;
		
		ФормаПечати.Результат.АвтоМасштаб = Ложь;
		
		Если ПереченьЭлементов.ПечататьОригинал 
			или ПереченьЭлементов.ПечататьКопию Тогда
			
			ПечатьНалоговойНакладнойНаСервере(ФормаПечати.Результат, ПараметрыПечати);	
		КонецЕсли;
		
		ФормаПечати.Результат.ОтображатьСетку = Ложь;
		ФормаПечати.Результат.Защита 		  = Истина;
		ФормаПечати.Результат.ТолькоПросмотр  = Истина;
		ФормаПечати.Результат.ОтображатьЗаголовки = Ложь;
		ФормаПечати.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("печать: Пакет документов");
		
		ФормаПечати.открыть();	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПечатьНалоговойНакладнойНаСервере(ТабДок, Знач ПараметрыПечати) 	
	
	ОбщийМодульСервер.ДобавитьСобытиеЖурналаНаСервере(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Напечатал налоговую накладную."), 2);
	ОбщийМодульТоварСервер.ПечатьНалоговойНакладной(ТабДок, ПараметрыПечати);			
	
КонецПроцедуры

&НаСервере
Процедура ПечатьРН(ТабДок, Знач ПараметрКоманды, Знач ЭтоСчет, Знач НоСчетЕсть = Ложь, Знач ВДваЭкземпляра = Ложь, Знач ЗаголовокРасходнойНакладной = "")  
	
	ОбщийМодульСервер.ДобавитьСобытиеЖурналаНаСервере(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Напечатал") + " " + ?(ЭтоСчет, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Счет"), ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Расход товара")), 2);
	Документы.РасходыТовара.Печать(ТабДок, ПараметрКоманды, ЭтоСчет, НоСчетЕсть, , , , ЗаголовокРасходнойНакладной, ВДваЭкземпляра);
	ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	
КонецПроцедуры

&НаСервере
Процедура ПечатьТорг12(ТабДок, Знач ПараметрКоманды, Знач ЭтоСчет, Знач НоСчетЕсть = Ложь, Знач ТОРГ12ВДваЭкземпляра = Ложь)  
	
	ОбщийМодульСервер.ДобавитьСобытиеЖурналаНаСервере(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Напечатал ТОРГ 12"), 2);
	Документы.РасходыТовара.Печать(ТабДок, ПараметрКоманды, ЭтоСчет, НоСчетЕсть, Ложь, Истина, , , ТОРГ12ВДваЭкземпляра);
	ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	
КонецПроцедуры

&НаСервере
процедура ФормаПечатиРезультатОчистить(ФормаПечатиРезультат)
	ФормаПечатиРезультат.Очистить()
КонецПроцедуры

&НаКлиенте
Процедура ОплатаХранилищеДенегПриИзменении(Элемент)
	ОплатаХранилищеДенегПриИзмененииНаСервере(Элементы.Оплата.ТекущаяСтрока);
КонецПроцедуры

&НаСервере
Процедура ОплатаХранилищеДенегПриИзмененииНаСервере(Знач ТекСтрока)	
	
	ТекущаяСтрока = Объект.Оплаты[ТекСтрока];
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.ХранилищеДенег) Тогда
		ТекущаяСтрока.ФормаОплаты = ТекущаяСтрока.ХранилищеДенег.ФормаОплаты;
		ТекущаяСтрока.Валюта	  = ТекущаяСтрока.ХранилищеДенег.Валюта;
		ТекущаяСтрока.Курс        = ОбщийМодульПовтор.ПолучитьТекущийКурс(ТекущаяСтрока.Валюта, Объект.Дата);
		
		ОбновитьСуммуОплаты();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатаПоступилоДенегПриИзменении(Элемент)
	ОбновитьСуммуОплаты();
КонецПроцедуры

&НаКлиенте
Процедура ОплатаВалютаПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Оплата.ТекущиеДанные;
	ТекущаяСтрока.Курс = ОбщийМодульПовтор.ПолучитьТекущийКурс(ТекущаяСтрока.Валюта, Объект.Дата);
	ТекущаяСтрока.сумма = ТекущаяСтрока.сумма / ?(ТекущаяСтрока.Курс = 0, 1, ТекущаяСтрока.Курс);
	ОбновитьСуммуОплаты();
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатаКурсПриИзменении(Элемент)
	ОбновитьСуммуОплаты();
КонецПроцедуры

Процедура ОбновитьСуммуОплаты()
	
	ИтогоОплата = 0;
	Для Каждого Оплата Из Объект.Оплаты Цикл
		ИтогоОплата = ИтогоОплата + Оплата.Сумма * Оплата.Курс;
	КонецЦикла;
	ПоступилоДенегПоКурсу = ИтогоОплата;
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатаХранилищеДенег1ПриИзменении(Элемент)
	ОплатаХранилищеДенегПриИзмененииНаСервере(Элементы.Оплата1.ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура ОплатаВалюта1ПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Оплата1.ТекущаяСтрока;
	ТекущаяСтрока.Курс = ОбщийМодульПовтор.ПолучитьТекущийКурс(ТекущаяСтрока.Валюта, Объект.Дата);
	ОбновитьСуммуОплаты();
	
КонецПроцедуры

&НаКлиенте
Процедура Оплата1ПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ВводНОвойСтрок(Элементы.Оплата1.ТекущиеДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВводНОвойСтрок(ТекущаяСтрока)
	
	ТекущаяСтрока.ХранилищеДенег = Объект.ХранилищеДенег;
	Если ЗначениеЗаполнено(Объект.ХранилищеДенег) Тогда
		ТекущаяСтрока.ФормаОплаты = ОбщийМодульСервисСервер.ПолучитьЗначениеРеквизита(Объект.ХранилищеДенег, "ФормаОплаты");
		ТекущаяСтрока.Валюта = ОбщийМодульСервисСервер.ПолучитьЗначениеРеквизита(Объект.ХранилищеДенег, "Валюта");
	Иначе
		ТекущаяСтрока.ФормаОплаты = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ФормаОплатыДляДенегВДокументахРасходаИПриходаТоваров");
		ТекущаяСтрока.Валюта = Объект.Валюта;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущаяСтрока.Валюта) Тогда
		ТекущаяСтрока.Курс = ОбщийМодульПовтор.ПолучитьТекущийКурс(ТекущаяСтрока.Валюта, Объект.Дата);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатаПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ВводНОвойСтрок(Элементы.Оплата.ТекущиеДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЕдиницаИзмеренияПриИзменении(Элемент)
	ПриИзмененииНоменклатуры();
КонецПроцедуры

&НаКлиенте
Процедура Товары1ЕдиницаИзмеренияПриИзменении(Элемент)
	ПриИзмененииНоменклатуры() ;	
КонецПроцедуры

&НаКлиенте
Процедура Адрес1ПриИзменении(Элемент)	
	Адрес1ПриИзмененииНаСервере();		
КонецПроцедуры

&НаСервере
Процедура Адрес1ПриИзмененииНаСервере()
	
	КлиентПоставщик = Объект.КлиентПоставщик;
	Если ЗначениеЗаполнено(КлиентПоставщик) Тогда
		
		ПравоРедакции = ОбщийМодульСервисСервер.ПроверитьПравоРедакции("000600", КлиентПоставщик);
		
		Если ПравоРедакции 
			и (не КлиентПоставщик.Адрес   = Объект.Адрес
			или не КлиентПоставщик.Телефон = Объект.Телефон) Тогда
			
			КлиентПоставщикОбъект = КлиентПоставщик.ПолучитьОбъект();
			КлиентПоставщикОбъект.Адрес   = Объект.Адрес;
			КлиентПоставщикОбъект.Телефон = Объект.Телефон;
			КлиентПоставщикОбъект.Записать();
			Объект.КлиентПоставщик = КлиентПоставщикОбъект.Ссылка;
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЧека(Команда)
	
	Текст = ПечатьТоварногоЧекаНаСервере();
	
	Если ИспользоватьПодключаемоеОборудование
		И НЕ Текст = "" Тогда
		
		ОбщийМодульКлиент.ПечатьЧека(Текст, УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция   ПечатьТоварногоЧекаНаСервере()
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат ОбщийМодульСервер.ПечатьТоварногоЧека(Объект.Ссылка, Ложь, Объект.КлиентПоставщик, "Товары", ?(ЗначениеЗаполнено(Объект.ХранилищеДенег), Объект.ХранилищеДенег.ФормаОплаты, ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ФормаОплатыДляДенегВДокументахРасходаИПриходаТоваров")), ?(РазрешеноПриниматьПриРеализацииДеньгиСразуВНесколькихВалютах, "Оплаты", ""));
	Иначе
		Возврат "";
	КонецЕсли;		
	
КонецФункции 

&НаКлиенте
Процедура ДополнительнаяИнформацияПриИзменении(Элемент)
	ДопИнформацияИзменена = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДополнительнаяИнформацияВидИнформацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыФормы = Новый Структура("ТипВладельца", ДопИнфоТипВладельца);
	ФормаВыбораВидаИнформации = ПолучитьФорму("Справочник.ДополнительныеРеквизиты.ФормаВыбора", ПараметрыФормы, ЭтаФорма);	
	ВидИнформации = ФормаВыбораВидаИнформации.ОткрытьМодально();
	Если ЗначениеЗаполнено(ВидИнформации) Тогда
		Элементы.ДополнительнаяИнформация.ТекущиеДанные.ВидИнформации = ВидИнформации;
		Элементы.ДополнительнаяИнформация.ТекущиеДанные.Информация = ОбщийМодульКлиент.ПолучитьЗначениеПоУмолчаниюПоляДополнительнойИнформации(ВидИнформации);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварОтправленПриИзменении(Элемент)
	
	Если Объект.ТоварОтправлен
		и НЕ ЗначениеЗаполнено(Объект.ДатаОтправки) Тогда
		
		Объект.ДатаОтправки = ОбщийМодульСервисСервер.ПользователяТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентОповещенПриИзменении(Элемент)
	
	Если Объект.КлиентОповещен
		и НЕ ЗначениеЗаполнено(Объект.ДатаОповещения) Тогда
		
		Объект.ДатаОповещения = ОбщийМодульСервисСервер.ПользователяТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДатуОтсрочки()
	
	Если ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ИспользоватьМеханизмОтсрочкиПлатежа") Тогда
		
		Если ЗначениеЗаполнено(Объект.КлиентПоставщик)
			и не объект.КлиентПоставщик.СрокОплатыВДняхПоУмолчанию = 0 Тогда
			
			Объект.ДатаОтсрочки = Объект.ДатаОкончанияОказанияУслуг + объект.КлиентПоставщик.СрокОплатыВДняхПоУмолчанию * 3600 * 24;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.Договор) Тогда
			
			Если Объект.Договор.УстанавливаетСрокОплатыВДнях = 0 Тогда
				Элементы.ДатаОтсрочки.Доступность = Истина;
			Иначе
				Объект.ДатаОтсрочки = Объект.ДатаОкончанияОказанияУслуг + Объект.Договор.УстанавливаетСрокОплатыВДнях * 3600 * 24;
				Элементы.ДатаОтсрочки.Доступность = Ложь;
			КонецЕсли;
			
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДатуКомиссии()
	
	Если ЗначениеЗаполнено(Объект.КлиентПоставщик)
		и ТипЗнч(Объект.КлиентПоставщик) = Тип("СправочникСсылка.Клиенты")
		и ЗначениеЗаполнено(Объект.КлиентПоставщик.СрокОтчетаКомиссионераПоОтдельномуДокументуПередачиТоваров) Тогда
		
		СрокОтчетаКомиссионераПоОтдельномуДокументуПередачиТоваров = Объект.КлиентПоставщик.СрокОтчетаКомиссионераПоОтдельномуДокументуПередачиТоваров;
	Иначе
		СрокОтчетаКомиссионераПоОтдельномуДокументуПередачиТоваров = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("СрокОтчетаКомиссионераПоОтдельномуДокументуПередачиТоваровПоУмолчаниюВДнях");	
	КонецЕсли;
	
	Объект.ДатаОтчетаПоКомиссии = Объект.Дата + СрокОтчетаКомиссионераПоОтдельномуДокументуПередачиТоваров * 3600 * 24;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередачаДляКомиссионнойТорговлиПриИзменении(Элемент)
	ИзменитьВидДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ПередачаДляКомиссионнойТорговли1ПриИзменении(Элемент)
	ИзменитьВидДокумента();
КонецПроцедуры
