//sza140412-0227 : 
//sza131210-2245 : 

Функция   ЦенаУжеСтоит(Знач ВидЦен, Знач Номенклатура, Знач Дата, Знач Цена, Вручную, Знач Ссылка, Знач ЕдиницаИзмерения = Неопределено) Экспорт
	
	Возврат Цена = ОбщийМодульСервер.ПолучитьСложнуюЦену(Номенклатура, ВидЦен, Дата, Ложь, , Истина, Вручную, Ссылка, ЕдиницаИзмерения);
	
КонецФункции

Функция   ВыводитьСообщенияМожно() Экспорт
	Возврат Не параметрысеанса.НеВыводитьСообщений;
КонецФункции //ВыводитьСообщенияМожно

Функция   НайтиПоНаименованиюНоменклатурнуюГруппу(Знач Наименование, Знач ВтороеНаименование, Знач ПоПервомуСлову = Ложь) Экспорт
	
	Результат = ПредопределенноеЗначение("Справочник.НоменклатурныеГруппы.ПустаяСсылка");
	
	Если ЗначениеЗаполнено(наименование) Тогда
		Результат = Справочники.НоменклатурныеГруппы.НайтиПоНаименованию(Наименование, Ложь);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Результат)
		И ЗначениеЗаполнено(ВтороеНаименование) Тогда
		
		Результат = Справочники.НоменклатурныеГруппы.НайтиПоНаименованию(Наименование, Ложь);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Результат)
		И ПоПервомуСлову Тогда
		
		НаименованиеСлово = СокрЛП(Лев(Наименование, Найти(Наименование, " ") ));
		Результат = Справочники.НоменклатурныеГруппы.НайтиПоНаименованию(НаименованиеСлово, Ложь);
		Если НЕ ЗначениеЗаполнено(Результат) Тогда
			
			НаименованиеСлово = СокрЛП(Лев(ВтороеНаименование, Найти(ВтороеНаименование, " ") ));
			Результат = Справочники.НоменклатурныеГруппы.НайтиПоНаименованию(НаименованиеСлово, Ложь);
		КонецЕсли;	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции //ОбнаружитьПоНаименованию
