//sza141203-1412
//sza141102-0100 : 
//sza140412-0227 : 
//sza131210-2245 : 
Функция   ВыводитьСообщенияМожно() Экспорт
	Возврат Не параметрысеанса.НеВыводитьСообщений;
КонецФункции //ВыводитьСообщенияМожно

Функция   НайтиПоНаименованиюНоменклатурнуюГруппу(Знач Наименование, Знач ВтороеНаименование, Знач ПоПервомуСлову = ЛОЖЬ) Экспорт
	
	Результат = ПредопределенноеЗначение("Справочник.НоменклатурныеГруппы.ПустаяСсылка");
	
	Если ЗначениеЗаполнено(наименование) Тогда
		Результат = Справочники.НоменклатурныеГруппы.НайтиПоНаименованию(Наименование, ЛОЖЬ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Результат)
		И ЗначениеЗаполнено(ВтороеНаименование) Тогда
		
		Результат = Справочники.НоменклатурныеГруппы.НайтиПоНаименованию(Наименование, ЛОЖЬ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Результат)
		И ПоПервомуСлову Тогда
		
		НаименованиеСлово = СокрЛП(Лев(Наименование, Найти(Наименование, " ") ));
		Результат = Справочники.НоменклатурныеГруппы.НайтиПоНаименованию(НаименованиеСлово, ЛОЖЬ);
		Если НЕ ЗначениеЗаполнено(Результат) Тогда
			
			НаименованиеСлово = СокрЛП(Лев(ВтороеНаименование, Найти(ВтороеНаименование, " ") ));
			Результат = Справочники.НоменклатурныеГруппы.НайтиПоНаименованию(НаименованиеСлово, ЛОЖЬ);
		КонецЕсли;	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции //ОбнаружитьПоНаименованию

Функция   ЦенаУжеСтоит(Знач ВидЦен, Знач Номенклатура, Знач Дата, Знач Цена, Вручную, Знач Ссылка, Знач ЕдиницаИзмерения = Неопределено) Экспорт	
	Возврат Цена = ОбщийМодульСервер.ПолучитьСложнуюЦену(Номенклатура, ВидЦен, Дата, ЛОЖЬ, , ИСТИНА, Вручную, Ссылка, ЕдиницаИзмерения);	
КонецФункции

Функция   ЦенаУжеПроставлена(Знач ВидЦен, Знач Номенклатура, Знач Дата, Знач Ссылка, Знач ЕдиницаИзмерения = Неопределено) Экспорт
	
	Возврат ЗначениеЗаполнено(ОбщийМодульСервер.ПолучитьСложнуюЦену(Номенклатура, ВидЦен, Дата, ЛОЖЬ, , ИСТИНА, , Ссылка, ЕдиницаИзмерения));	
	
КонецФункции //ЦенаУжеПроставлена

Функция   ПолучитьЦенуСписания(Знач Номенклатура, Знач Количество = 1, Знач ДатаОкончанияОтчета = Неопределено) Экспорт
	
	Если ДатаОкончанияОтчета = Неопределено Тогда
		ДатаОкончанияОтчета = ОбщийМодульСервисСервер.ПользователяТекущаяДата();
	КонецЕсли;
	
	Возврат ОбщийМодульСервер.ПолучитьЦенуСписания(Номенклатура, Количество, ДатаОкончанияОтчета);
	
КонецФункции //ПолучитьЦенуСписания
