// sza131216-1423  
// sza131212-0244  
&НаКлиенте
Процедура ДобавитьГруппуИзображений(Команда)
	
	Если ЗначениеЗаполнено(ОтборСсылка) Тогда
		ПараметрыФормы   = Новый Структура("СвязанныйОбъект", ОтборСсылка);
		формаИзображения = ПолучитьФорму("Справочник.Изображения.ФормаГруппы", ПараметрыФормы);	
		формаИзображения.Открыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИзображение(Команда)
		
	ПараметрыФормы   = Новый Структура("СвязанныйОбъект", ОтборСсылка);
	формаИзображения = ПолучитьФорму("Справочник.Изображения.ФормаОбъекта", ПараметрыФормы);	
	формаИзображения.Открыть();
	
КонецПроцедуры

&НаСервере
Процедура обновитьотбор()
	
	Список.Параметры.УстановитьЗначениеПараметра("НетОтбора", не ЗначениеЗаполнено(ОтборСсылка));
	Список.Параметры.УстановитьЗначениеПараметра("СвязанныйОбъект", ОтборСсылка);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПриИзменении(Элемент)
	обновитьотбор();
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
	Если ЗначениеЗаполнено(параметры.СвязанныйОбъект) Тогда
		ОтборСсылка = параметры.СвязанныйОбъект;
	КонецЕсли;
	ОбновитьОтбор();
	
	ПодключитьОбработчикОжидания("ПослеИзображенияОкнаФормы", 0.3, ИСТИНА);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеИзображенияОкнаФормы() // Когда окно уже нарисовано пользователю
	ЭтаФорма.Элементы.ФормаЗакрыть.Видимость = НЕ ЭтаФорма.Окно = Неопределено;	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьСобственныйПереводЭлементовИнтерфейса") Тогда
			ОбщийМодульСервер.ПеревестиРеквизитыФормы(ЭтаФорма);	
		КонецЕсли;
		
	Список.Параметры.УстановитьЗначениеПараметра("ВБазеДанных", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("В Базе данных"));
	ОбщийМодульСервер.ОбеспечитьСписокОтборов(Список);

КонецПроцедуры                                    

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТекущийЭлементСписка = Элементы.Список.ТекущаяСтрока;
	Если ЗначениеЗаполнено(ТекущийЭлементСписка) Тогда
		СтруктураИзображения = ОбщийМодульСервер.ПолучитьСтруктуруИзображения(ТекущийЭлементСписка);
		ПодСсылку = СтруктураИзображения.ПодСсылку;
		
		Элементы.СсылкаНаИзображение.Видимость    = НЕ СтруктураИзображения.ИзображениеВБазеДанных;
		Элементы.ИзображениеВБазеДанных.Видимость = СтруктураИзображения.ИзображениеВБазеДанных;
		
		Если СтруктураИзображения.РазмерПриОтображении = 1 тогда
			Элементы.ИзображениеВБазеДанных.РазмерКартинки = РазмерКартинки.АвтоРазмер
		Иначеесли СтруктураИзображения.РазмерПриОтображении = 2 тогда
			Элементы.ИзображениеВБазеДанных.РазмерКартинки = РазмерКартинки.Пропорционально
		Иначеесли СтруктураИзображения.РазмерПриОтображении = 3 тогда
			Элементы.ИзображениеВБазеДанных.РазмерКартинки = РазмерКартинки.Растянуть
		Иначеесли СтруктураИзображения.РазмерПриОтображении = 4 тогда
			Элементы.ИзображениеВБазеДанных.РазмерКартинки = РазмерКартинки.РеальныйРазмер
		Иначеесли СтруктураИзображения.РазмерПриОтображении = 5 тогда
			Элементы.ИзображениеВБазеДанных.РазмерКартинки = РазмерКартинки.Черепица
		КонецЕсли; 		 
		
	КонецЕсли;
	
КонецПроцедуры
