// sza150506-0123 
// sza150418-2209 
// sza150403-1401 ППФ
// sza141119-0055 
// sza141010-1258
// sza140704-1117 Номенклатрура
// sza140412-0931  
// sza130825-0107
&НаКлиенте
Процедура ВидЦенПриИзменении(Элемент)
	
	ВидЦенПриИзмененииНаСервере();
	проверитьнаименованиевалюты();	
	
КонецПроцедуры

&НаСервере
Процедура ВидЦенПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Номенклатура) Тогда
		Объект.Цена = ОбщийМодульСервер.ПолучитьЦенуНаСервере(Объект.Номенклатура, Объект.ВидЦен, Объект.Дата, ЛОЖЬ, , , , , , , Объект.ЕдиницаИзмерения);
	КонецЕсли;
	
	НаСумму = Объект.Количество * Объект.Цена;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПредыдущуюНоменклатуру(Команда)
	
	Если ЗначениеЗаполнено(ПредыдущаяНоменклатура) Тогда
		Объект.Номенклатура = ПредыдущаяНоменклатура;
		НоменклатураПриИзмененииКлиентИСервер();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДанныеНоменклатурыПриИзмененииНаСервере()
	
	Если ИспользуютсяФормулы 
		И ЗначениеЗаполнено(Объект.НоменклатурнаяГруппа) Тогда		
		
		ОбщийМодульТоварСервер.УстановитьРеквизитНоменклатурыПоФормуле(Объект);	
	КонецЕсли;
	
	Если ОбщийМодульТоварСервер.НаименованиеЭтойНоменклатрнойГруппыНазначается(Объект.НоменклатурнаяГруппа) Тогда
		Элементы.Наименование.Доступность 			= ЛОЖЬ;
		Элементы.Наименование.ПропускатьПриВводе 	= ИСТИНА;
		
	Иначе
		Элементы.Наименование.Доступность 			= ИСТИНА;
		Элементы.Наименование.ПропускатьПриВводе 	= ЛОЖЬ;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЕдиницаИзмеренияПриИзменении(Элемент)
	НоменклатураПриИзмененииКлиентИСервер();
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьИПередать(Знач ПечататьЦенникШтрихКод) 
	
	Отмена = ЛОЖЬ;				
	
	Если НЕ ЗначениеЗаполнено(Объект.Номенклатура) Тогда
		//И ЗначениеЗаполнено(Объект.Цена)
		//И ЗначениеЗаполнено(Объект.ШтрихКод)
		//И ЗначениеЗаполнено(Объект.Производитель)
		//И ЗначениеЗаполнено(Объект.НоменклатурнаяГруппа) Тогда // не всё ах
		
		СтруктураНоменклатура = ОбщийМодульСерверПолучитьНоменклатуруПоШтрихКоду(Объект.ШтрихКод);
		Объект.Номенклатура   = СтруктураНоменклатура.Номенклатура;
		Объект.СерияСуществующейНоменклатуры = СтруктураНоменклатура.СерияНоменклатуры;
		
		Если НЕ ЗначениеЗаполнено(Объект.Номенклатура) Тогда
			
			Если ИспользоватьСложныйМеханизмЦен
				И НЕ ЗначениеЗаполнено(Объект.ВидЦен) Тогда
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Вид цен не указан!");
				Сообщение.Поле  = "ВидЦен";
				Сообщение.УстановитьДанные(Объект);
				Сообщение.Сообщить();
				
				Отмена = ИСТИНА;				
				
			КонецЕсли;
			
			Объект.Номенклатура = ОбщийМодульСерверСоздатьНоменклатуру(Объект.ШтрихКод, Объект.Производитель, Объект.НоменклатурнаяГруппа, Объект.Цена, Объект.наименование);
			
			Если ВестиУчетСерийНоменклатуры Тогда
				Объект.СерияСуществующейНоменклатуры = ОбщийМодульТоварСервер.ОбнаружитьСериюНоменклатуры(Объект.Номенклатура, Объект.СерияНоменклатуры);			                                	
			КонецЕсли;
			
			Если Объект.Номенклатура = Неопределено
				ИЛИ НЕ ЗначениеЗаполнено(Объект.Номенклатура) Тогда
				
				Отмена = ИСТИНА;
			Иначе
				ОбщийМодульСервер.ДобавитьСобытиеЖурналаНаСервере(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Создал номенклатуру") + ": " + Объект.Номенклатура + Объект.СерияНоменклатуры, 2);
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ отмена
		И ПечататьЦенникШтрихКод Тогда
		
		Если Объект.Количество <= 30 Тогда
			ЗакрытьИПередатьЗавершениеФрагмент(ПечататьЦенникШтрихКод);
		Иначе
			ПоказатьВопрос(Новый ОписаниеОповещения("ЗакрытьИПередатьЗавершение", ЭтаФорма, Новый Структура("ПечататьЦенникШтрихКод", ПечататьЦенникШтрихКод)), ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Вы уверены, что хотите распечатать такое число") + " (" + Объект.Количество + ")?", режимдиалогавопрос.ДаНет);
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьИПередатьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	ПечататьЦенникШтрихКод = ДополнительныеПараметры.ПечататьЦенникШтрихКод;	
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда		
		ЗакрытьИПередатьЗавершениеФрагмент(ПечататьЦенникШтрихКод);			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьИПередатьЗавершениеФрагмент(Знач ПечататьЦенникШтрихКод);
	
	глПроверятьСообщения = ИСТИНА;
	Если НЕ ЗначениеЗаполнено(Объект.Цена) Тогда
		// Сообщить(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Не указана цена!"));
		ОбщийМодульСервисСервер.ДобавитьСообщениеПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Не указана цена!"));			
	КонецЕсли;
	
	Если ПечататьЦенникШтрихКод Тогда
		
		// !!сюда!	
		Табдок = ОбщийМодульСерверНапечататьЭтикетку();
		
		Если НЕ табдок = Неопределено Тогда 
			Если НЕ ЗначениеЗаполнено(ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("НаименованиеПринтераШтрихКодов")) Тогда
				
				ПараметрыФормыПечати = Новый Структура("ТабДок", ТабДок);
				ПараметрыФормыПечати.Вставить("НаименованиеДокумента", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Этикетка"));
				ПараметрыФормыПечати.Вставить("НеПечататьНичегоДополнительно", ИСТИНА);
				
				ФормаПечати = ПолучитьФорму("ОбщаяФорма.ФормаПечати", ПараметрыФормыПечати);	
				ФормаПечати.Заголовок = ПараметрыФормыПечати.НаименованиеДокумента;
				ФормаПечати.Открыть();
			Иначе
				Табдок.напечатать();  
			КонецЕсли;	
		КонецЕсли;
		
		ОбщийМодульСервер.ДобавитьСобытиеЖурналаНаСервере(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Напечатал этикетку."), 2);
	КонецЕсли;
	
	Если Объект.ЭтоДобавлениеИзДокумента Тогда
		
		структураОтпечати = Новый Структура;
		структураОтпечати.Вставить("ШтрихКод", Объект.ШтрихКод);
		структураОтпечати.Вставить("Количество", Объект.Количество);
		структураОтпечати.Вставить("Номенклатура", Объект.Номенклатура);
		структураОтпечати.Вставить("СерияНоменклатуры", Объект.СерияСуществующейНоменклатуры);
		структураОтпечати.Вставить("Цена", Объект.Цена);
		структураОтпечати.Вставить("Склад", Объект.Склад);
		структураОтпечати.Вставить("ЕдиницаИзмерения", Объект.ЕдиницаИзмерения);
		структураОтпечати.Вставить("Дата", Объект.Дата);
		этаформа.Закрыть(структураОтпечати);
		
	КонецЕсли;		
	
КонецПроцедуры // ЗакрытьИПередать

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	
	Если Объект.Количество < 1 Тогда
		Объект.Количество = 1;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Номенклатура) Тогда
		этаформа.ТекущийЭлемент = Элементы.Напечатать;
	КонецЕсли;
	НаСумму = Объект.Количество * Объект.Цена;
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	обновитьШК();
КонецПроцедуры

&НаКлиенте
Процедура Напечатать(Команда)
	
	ПредыдущаяНоменклатура = Объект.Номенклатура;
	ЗакрытьИПередать(ИСТИНА);
	
КонецПроцедуры

&НаКлиенте
Процедура НапечататьШтрихКодОрганизации(Команда)
	
	ПараметрыФормыПечати = Новый Структура;
	ПараметрыФормыПечати.Вставить("НаименованиеДокумента", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Этикетка для организации"));
	ПараметрыФормыПечати.Вставить("НеПечататьНичегоДополнительно", ИСТИНА);
	ФормаПечати = получитьформу("ОбщаяФорма.ФормаПечати", ПараметрыФормыПечати);			
	
	ЕстьЧтоПечататьВФорме = НапечататьЭтикеткиДляОрганизации(ФормаПечати.Результат);
	
	Если ЕстьЧтоПечататьВФорме Тогда
		ФормаПечати.Заголовок = ПараметрыФормыПечати.НаименованиеДокумента;
		ФормаПечати.Открыть();
	Иначе
		ФормаПечати = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НапечататьШтрихКодПозиций(Команда)
	
	КоличествоЭтикеток = Объект.ПозицииДляУслугЗаВремя.Итог("Количество");
	
	Если КоличествоЭтикеток > 0 Тогда
		Если КоличествоЭтикеток <= 30 Тогда
			НапечататьШтрихКодПозицийФрагмент();
		Иначе
			ПоказатьВопрос(Новый ОписаниеОповещения("НапечататьШтрихКодПозицийЗавершение", ЭтаФорма), ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Вы уверены, что хотите распечатать такое число") + " (" + КоличествоЭтикеток + ")?", режимдиалогавопрос.ДаНет);	
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НапечататьШтрихКодПозицийЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		НапечататьШтрихКодПозицийФрагмент();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НапечататьШтрихКодПозицийФрагмент()
	
	ПараметрыФормыПечати = Новый Структура;
	ПараметрыФормыПечати.Вставить("НаименованиеДокумента", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Этикетки для контрагентов"));
	ПараметрыФормыПечати.Вставить("НеПечататьНичегоДополнительно", ИСТИНА);
	ФормаПечати = получитьформу("ОбщаяФорма.ФормаПечати", ПараметрыФормыПечати);			
	
	ЕстьЧтоПечататьВФорме = НапечататьЭтикеткиДляВсехСтрокТаблицыНаСервере(ФормаПечати.Результат, ИСТИНА);
	
	Если ЕстьЧтоПечататьВФорме Тогда
		ФормаПечати.Заголовок = ПараметрыФормыПечати.НаименованиеДокумента;
		ФормаПечати.Открыть();
	Иначе
		ФормаПечати = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НапечататьШтрихКодыДляКонтрагентов(Команда)
	
	КоличествоЭтикеток = Объект.Контрагенты.Итог("Количество");
	
	Если КоличествоЭтикеток > 0 Тогда
		Если КоличествоЭтикеток <= 30 Тогда
			НапечататьШтрихКодыФрагмент();
		Иначе			
			ПоказатьВопрос(Новый ОписаниеОповещения("НапечататьШтрихКодыДляКонтрагентовЗавершение", ЭтаФорма), ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Вы уверены, что хотите распечатать такое число") + " (" + КоличествоЭтикеток + ")?", режимдиалогавопрос.ДаНет);	
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НапечататьШтрихКодыДляКонтрагентовЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		НапечататьШтрихКодыФрагмент();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НапечататьШтрихКодыФрагмент()
	
	ПараметрыФормыПечати = Новый Структура;
	ПараметрыФормыПечати.Вставить("НаименованиеДокумента", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Этикетки для контрагентов"));
	ПараметрыФормыПечати.Вставить("НеПечататьНичегоДополнительно", ИСТИНА);
	ФормаПечати = получитьформу("ОбщаяФорма.ФормаПечати", ПараметрыФормыПечати);			
	
	ЕстьЧтоПечататьВФорме = НапечататьЭтикеткиДляВсехСтрокТаблицыНаСервере(ФормаПечати.Результат);
	
	Если ЕстьЧтоПечататьВФорме Тогда
		ФормаПечати.Заголовок = ПараметрыФормыПечати.НаименованиеДокумента;
		ФормаПечати.Открыть();
	Иначе
		ФормаПечати = Неопределено;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция   НапечататьЭтикеткиДляВсехСтрокТаблицыНаСервере(табдокобщ, Знач ДляПозиций = ЛОЖЬ, Знач ДляСотрудников = ЛОЖЬ)
	
	ЕстьЧтоПечататьВФорме = ЛОЖЬ;
	
	Если ДляСотрудников Тогда
		Для Каждого СтрокаТаблицы из Объект.Сотрудники цикл
			
			Позиция = СтрокаТаблицы.Позиция;
			Если ЗначениеЗаполнено(Позиция) Тогда
				
				ШтрихКод 		  = Позиция.ОсновнойШтрихКод;
				ТекстСШтрихКодом  = ШтрихКод;		
				
				Табдок = ОбщийМодульСерверНапечататьЭтикеткуОбъектам(ШтрихКод, ТекстСШтрихКодом, СтрокаТаблицы.Количество, СокрЛП(Позиция));
				
				Если НЕ Табдок = Неопределено 
					И НЕ ЗначениеЗаполнено(ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("НаименованиеПринтераШтрихКодов")) Тогда
					
					ЕстьЧтоПечататьВФорме = ИСТИНА;
					ТабдокОбщ.Вывести(Табдок);									
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		ОбщийМодульСервер.ДобавитьСобытиеЖурналаНаСервере(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Напечатал этикетку для позиций (номеров)."), 2);
		
	ИначеЕсли ДляПозиций Тогда
		Для Каждого СтрокаТаблицы из Объект.ПозицииДляУслугЗаВремя цикл
			
			Позиция = СтрокаТаблицы.Позиция;
			Если ЗначениеЗаполнено(Позиция) Тогда
				
				ШтрихКод 		  = Позиция.ОсновнойШтрихКод;
				ТекстСШтрихКодом  = ШтрихКод;		
				
				Табдок = ОбщийМодульСерверНапечататьЭтикеткуОбъектам(ШтрихКод, ТекстСШтрихКодом, СтрокаТаблицы.Количество, СокрЛП(Позиция));
				
				Если НЕ Табдок = Неопределено 
					И НЕ ЗначениеЗаполнено(ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("НаименованиеПринтераШтрихКодов")) Тогда
					
					ЕстьЧтоПечататьВФорме = ИСТИНА;
					ТабдокОбщ.Вывести(Табдок);									
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		ОбщийМодульСервер.ДобавитьСобытиеЖурналаНаСервере(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Напечатал этикетку для позиций (номеров)."), 2);
		
	Иначе
		Для Каждого СтрокаТаблицы из Объект.Контрагенты цикл
			
			Контрагент = СтрокаТаблицы.Контрагент;
			Если ЗначениеЗаполнено(Контрагент) Тогда
				
				ШтрихКод 		  = Контрагент.ОсновнойШтрихКод;
				ТекстСШтрихКодом  = ШтрихКод;		
				
				Табдок = ОбщийМодульСерверНапечататьЭтикеткуОбъектам(ШтрихКод, ТекстСШтрихКодом, СтрокаТаблицы.Количество, СокрЛП(Контрагент));
				
				Если НЕ Табдок = Неопределено 
					И НЕ ЗначениеЗаполнено(ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("НаименованиеПринтераШтрихКодов")) Тогда
					
					ЕстьЧтоПечататьВФорме = ИСТИНА;
					ТабдокОбщ.Вывести(Табдок);									
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		ОбщийМодульСервер.ДобавитьСобытиеЖурналаНаСервере(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Напечатал этикетку для таблицы."), 2);
		
	КонецЕсли;
	Возврат ЕстьЧтоПечататьВФорме;
	
КонецФункции

&НаСервере
Функция   НапечататьЭтикеткиДляОрганизации(табдокобщ)
	
	ЕстьЧтоПечататьВФорме = ЛОЖЬ;
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		
		ШтрихКод 		  = Объект.Организация.ОсновнойШтрихКод;
		ТекстСШтрихКодом  = ШтрихКод;		
		
		Табдок = ОбщийМодульСерверНапечататьЭтикеткуОбъектам(ШтрихКод, ТекстСШтрихКодом, 1, СокрЛП(Объект.Организация));
		
		Если НЕ Табдок = Неопределено 
			И НЕ ЗначениеЗаполнено(ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("НаименованиеПринтераШтрихКодов")) Тогда
			
			ЕстьЧтоПечататьВФорме = ИСТИНА;
			ТабдокОбщ.Вывести(Табдок);									
		КонецЕсли;
	КонецЕсли;
	
	ОбщийМодульСервер.ДобавитьСобытиеЖурналаНаСервере(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Напечатал этикетку для организации."), 2);
	
	Возврат ЕстьЧтоПечататьВФорме;
	
КонецФункции

&НаКлиенте
Процедура НеПечатать(Команда)
	
	ПредыдущаяНоменклатура = Объект.Номенклатура;
	ЗакрытьИПередать(ЛОЖЬ);
	
КонецПроцедуры

&НаКлиенте
Процедура НоваяНоменклатура(Команда)
	НоваяНоменклатураНаСервере();
КонецПроцедуры

&НаСервере
Процедура НоваяНоменклатураНаСервере()
	
	Объект.Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
	обновитьШК();
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	ОбщийМодульКлиент.ПоискОшибкиКодировки("Номенклатура", ДанныеВыбора, Текст, Объект.Номенклатура);
	Если значениезаполнено(Объект.Номенклатура) Тогда
		
		Объект.Производитель 		= ПолучитьРеквизитыНаСервере(Объект.Номенклатура, "Производитель");
		Объект.НоменклатурнаяГруппа = ПолучитьРеквизитыНаСервере(Объект.Номенклатура, "НоменклатурнаяГруппа");
		Объект.Наименование 		= СокрЛП(Объект.Номенклатура);
		обновитьШК();
		этаформа.ТекущийЭлемент = Элементы.Количество;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	НоменклатураПриИзмененииКлиентИСервер(, ИСТИНА);
КонецПроцедуры

Процедура НоменклатураПриИзмененииКлиентИСервер(Знач НеобновлятьШтрихКОдИТексты = ЛОЖЬ, Знач НеОбновлятьНоменклатуру = ЛОЖЬ)
	
	Если ЗначениеЗаполнено(Объект.Номенклатура) Тогда
		
		Объект.Производитель = ПолучитьРеквизитыНаСервере(Объект.Номенклатура, "Производитель");
		Объект.НоменклатурнаяГруппа = ПолучитьРеквизитыНаСервере(Объект.Номенклатура, "НоменклатурнаяГруппа");
		
		ОпределитьПроизвольнуюПечатнуюФорму();
		
		Если ОбщийМодульПовтор.ВывестиНаименованияНаДругомЯзыке() Тогда
			
			ВозможноеПредставление = ОбщийМодульПовтор.получитьПредставлениеНаЯзыке(Объект.Номенклатура, , ИСТИНА);
			Если НЕ ВозможноеПредставление = Неопределено Тогда
				Объект.Наименование = ВозможноеПредставление;
			Иначе
				Объект.Наименование = СокрЛП(Объект.Номенклатура);
			КонецЕсли;
		Иначе
			Объект.Наименование 	= СокрЛП(Объект.Номенклатура);
		КонецЕсли;
		
		ОбновитьЦенуНоменклатуры();
		Если ЗначениеЗаполнено(Объект.Номенклатура) Тогда
			Объект.Количество = ОбщийМодульСервер.ПолучитьКоличествоПоУмолчанию(Объект.Номенклатура);
		КонецЕсли;		
		НаСумму = Объект.Количество * Объект.Цена;
		
	КонецЕсли;
	
	Если НЕ НеобновлятьШтрихКОдИТексты Тогда
		ОбновитьШК(НеобновлятьШтрихКОдИТексты, НеОбновлятьНоменклатуру);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатурнаяГруппаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	ОбщийМодульКлиент.ПоискОшибкиКодировки("НоменклатурныеГруппы", ДанныеВыбора, Текст, Объект.НоменклатурнаяГруппа);
	ДанныеНоменклатурыПриИзмененииНаСервере();
	обновитьШК();
	Если ЗначениеЗаполнено(Объект.Номенклатура) Тогда
		этаформа.ТекущийЭлемент = Элементы.Количество;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатурнаяГруппаПриИзменении(Элемент)
	
	ДанныеНоменклатурыПриИзмененииНаСервере();
	обновитьШК();
	Если ЗначениеЗаполнено(Объект.Номенклатура) Тогда
		этаформа.ТекущийЭлемент = Элементы.Количество;
	КонецЕсли;
	
КонецПроцедуры

&Насервере
Процедура ОбновитьТекстДополнительнойСтроки(Знач НеОбновлятьНоменклатуру = ЛОЖЬ)
	
	Если ИспользуютсяФормулы 
		И ЗначениеЗаполнено(ФормулаДополнительнойСтроки) Тогда
		
		ТекстЗаголовка = "";
		
		Попытка 
			Если значениезаполнено(Объект.Номенклатура) Тогда
				Номенклатура = Объект.Номенклатура;
			ИначеЕсли НЕ НеОбновлятьНоменклатуру
				И НЕ ПустаяСтрока(Объект.ШтрихКод) Тогда
				
				Номенклатура = ОбщийМодульТоварСервер.ПолучитьНоменклатуруПоШтрихКоду(Объект.ШтрихКод, , ИСТИНА);	
				Объект.Номенклатура = Номенклатура;
				НоменклатураПриИзмененииКлиентИСервер(ИСТИНА);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Номенклатура) Тогда				
				
				Объект.Валюта  = ПредопределенноеЗначение("Справочник.Валюты.ОсновнаяВалюта");
				Объект.Валюта2 = Объект.Валюта;
				
				Если ВестиУчетСерийНоменклатуры Тогда
					Серия = ?(ЗначениеЗаполнено(Объект.СерияСуществующейНоменклатуры), Объект.СерияСуществующейНоменклатуры.Наименование, Объект.СерияНоменклатуры);
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Объект.ВидЦен) Тогда
					Объект.Валюта = Объект.ВидЦен.ВалютаЦены;
				КонецЕсли;
				
				Цена = ОбщийМодульСервер.ПолучитьЦенуНаСервере(Объект.Номенклатура, Объект.ВидЦен, Объект.Дата, , , , , , , , Объект.ЕдиницаИзмерения);
				Если Цена = 0 Тогда
					Цена = Объект.Цена;
				Иначе
					Объект.Цена = Цена;
				КонецЕсли;
				
				Объект.Цена2   = 0;
				Объект.ВидЦен2 = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВторойВидЦенДляЭтикетки");
				Если ЗначениеЗаполнено(Объект.ВидЦен2) Тогда
					Объект.Цена2 = ОбщийМодульСервер.ПолучитьЦенуНаСервере(Объект.Номенклатура, Объект.ВидЦен2, Объект.Дата, , , , , , , , Объект.ЕдиницаИзмерения);
					Объект.Валюта2 = Объект.ВидЦен2.ВалютаЦены;
				КонецЕсли;	
				
				Объект.Цена3   = 0;
				Объект.ВидЦен3 = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ТретийВидЦенДляФормул");
				Если ЗначениеЗаполнено(Объект.ВидЦен3) Тогда
					Объект.Цена3 = ОбщийМодульСервер.ПолучитьЦенуНаСервере(Объект.Номенклатура, Объект.ВидЦен3, Объект.Дата, , , , , , , , Объект.ЕдиницаИзмерения);
					Объект.Валюта3 = Объект.ВидЦен3.ВалютаЦены;
				КонецЕсли;	
				Цена3 	= Объект.Цена3;
				Валюта3 = Объект.Валюта3;
				ВидЦен3 = Объект.ВидЦен3;
				
				Цена	= Объект.Цена;
				Цена2 	= Объект.Цена2;
				ВидЦен2 = Объект.ВидЦен2;
				Валюта2 = Объект.Валюта2;
				Валюта  = Объект.Валюта;
				ВидЦен 	= Объект.ВидЦен;
				Дата 	= Объект.Дата;
				Группа 	= Объект.Номенклатура.Родитель;
				Склад 	= Объект.Склад;
				ШтрихКод			 = Объект.ШтрихКод;			
				НоменклатурнаяГруппа = Объект.НоменклатурнаяГруппа;
				Производитель  		 = Объект.Производитель;
				СерияНоменклатуры	 = Объект.СерияНоменклатуры;
				ТекстСШтрихКодом	 = Объект.ТекстСШтрихКодом;
				Наименование		 = Объект.Наименование;
				Количество			 = Объект.Количество;
				ЕдиницаИзмерения	 = Объект.ЕдиницаИзмерения;
				ДополнительнаяСтрокаЭтикетки = Объект.ДополнительнаяСтрокаЭтикетки;
				
				Выполнить(" ТекстЗаголовка = """"+" + ФормулаДополнительнойСтроки.Формула + ";");
				
				Если НЕ Объект.ДополнительнаяСтрокаЭтикетки = ТекстЗаголовка Тогда
					Объект.ДополнительнаяСтрокаЭтикетки = ТекстЗаголовка;
				КонецЕсли;	
			КонецЕсли;
			
		Исключение 	
			ТекстОписаниеОшибки = ОписаниеОшибки();
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Произошла ошибка") + ": " + ТекстОписаниеОшибки;
			Сообщение.Поле 	= "ФормулаДополнительнойСтроки";
			Сообщение.УстановитьДанные(Объект);
			Сообщение.Сообщить();
			
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

&Насервере
Процедура ОбновитьТекстаЗаголовкаЭтикетки(Знач НеОбновлятьНоменклатуру = ЛОЖЬ) 	
	
	//выполняется безусловно для расчета допреквизитов типа цена3 даже не для формул, а проверка и выполнение формулы ниже внутри
	ТекстЗаголовка = "";
	
	Попытка 
		Если ЗначениеЗаполнено(Объект.Номенклатура) Тогда
			Номенклатура = Объект.Номенклатура;
		ИначеЕсли НЕ НеОбновлятьНоменклатуру
			И НЕ ПустаяСтрока(Объект.ШтрихКод) Тогда
			
			Номенклатура = ОбщийМодульТоварСервер.ПолучитьНоменклатуруПоШтрихКоду(Объект.ШтрихКод, , ИСТИНА);	
			
			Объект.Номенклатура = Номенклатура;
			НоменклатураПриИзмененииКлиентИСервер(ИСТИНА);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.Номенклатура) Тогда
			Объект.Валюта  = ПредопределенноеЗначение("Справочник.Валюты.ОсновнаяВалюта");
			Объект.Валюта2 = Объект.Валюта;
			Если ВестиУчетСерийНоменклатуры Тогда
				Серия = ?(ЗначениеЗаполнено(Объект.СерияСуществующейНоменклатуры), Объект.СерияСуществующейНоменклатуры.Наименование, Объект.СерияНоменклатуры);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Объект.ВидЦен) Тогда
				Объект.Валюта = Объект.ВидЦен.ВалютаЦены;
			КонецЕсли;
			
			Цена = ОбщийМодульСервер.ПолучитьЦенуНаСервере(Объект.Номенклатура, Объект.ВидЦен, Объект.Дата, , , , , , , , Объект.ЕдиницаИзмерения);
			Если цена = 0 Тогда
				Цена = Объект.Цена;
			Иначе
				Объект.Цена = Цена;
			КонецЕсли;
			
			Объект.Цена2   = 0;
			Объект.ВидЦен2 = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВторойВидЦенДляЭтикетки");
			Если ЗначениеЗаполнено(Объект.ВидЦен2) Тогда
				Объект.Цена2   = ОбщийМодульСервер.ПолучитьЦенуНаСервере(Объект.Номенклатура, Объект.ВидЦен2, Объект.Дата, , , , , , , , Объект.ЕдиницаИзмерения);
				Объект.Валюта2 = Объект.ВидЦен2.ВалютаЦены;
			КонецЕсли;			
			Объект.Цена3   = 0;
			Объект.ВидЦен3 = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ТретийВидЦенДляФормул");
			Если ЗначениеЗаполнено(Объект.ВидЦен3) Тогда
				Объект.Цена3 = ОбщийМодульСервер.ПолучитьЦенуНаСервере(Объект.Номенклатура, Объект.ВидЦен3, Объект.Дата, , , , , , , , Объект.ЕдиницаИзмерения);
				Объект.Валюта3 = Объект.ВидЦен3.ВалютаЦены;
			КонецЕсли;	
			Цена3 	= Объект.Цена3;
			Валюта3 = Объект.Валюта3;
			ВидЦен3 = Объект.ВидЦен3;
			
			Цена	= Объект.Цена;
			Цена2 	= Объект.Цена2;
			ВидЦен2 = Объект.ВидЦен2;
			Валюта2 = Объект.Валюта2;
			Валюта  = Объект.Валюта;
			ВидЦен 	= Объект.ВидЦен;
			Дата 	= Объект.Дата;
			Группа 	= Объект.Номенклатура.Родитель;
			Склад 	= Объект.Склад;
			ШтрихКод			 = Объект.ШтрихКод;			
			НоменклатурнаяГруппа = Объект.НоменклатурнаяГруппа;
			Производитель  		 = Объект.Производитель;
			СерияНоменклатуры	 = Объект.СерияНоменклатуры;
			ТекстСШтрихКодом	 = Объект.ТекстСШтрихКодом;
			Наименование		 = Объект.Наименование;
			Количество			 = Объект.Количество;
			ЕдиницаИзмерения	 = Объект.ЕдиницаИзмерения;
			ДополнительнаяСтрокаЭтикетки = Объект.ДополнительнаяСтрокаЭтикетки;
			
			Если ИспользуютсяФормулы 
				И ЗначениеЗаполнено(Объект.ФормулаТекстаЗаголовка) Тогда
				
				Выполнить(" ТекстЗаголовка = """"+" + Объект.ФормулаТекстаЗаголовка.Формула + ";");
				
			КонецЕсли;
			
			Если НЕ Объект.ТекстЗаголовка = ТекстЗаголовка Тогда
				Объект.ТекстЗаголовка = ТекстЗаголовка;
			КонецЕсли;	
		КонецЕсли;
		
	Исключение 	
		ТекстОписаниеОшибки = ОписаниеОшибки();
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Произошла ошибка") + ": " + ТекстОписаниеОшибки;
		Сообщение.Поле 	= "ФормулаТекстаЗаголовка";
		Сообщение.УстановитьДанные(Объект);
		Сообщение.Сообщить();
		
	КонецПопытки;
	
конецпроцедуры

Процедура ОбновитьТекстСШтрихКодом(Знач НеОбновлятьНоменклатуру = ЛОЖЬ);
	ОбновитьТекстСШтрихКодомНаСервере(НеОбновлятьНоменклатуру);
конецпроцедуры

&Насервере
Процедура ОбновитьТекстСШтрихКодомНаСервере(Знач НеОбновлятьНоменклатуру = ЛОЖЬ)
	
	ОбъектТекстСШтрихКодом = "";
	
	Если ИспользуютсяФормулы 
		И ЗначениеЗаполнено(Объект.ОсновнаяФормулаТекстаЭтикетки) Тогда
		
		Попытка 
			Если значениезаполнено(Объект.Номенклатура) Тогда
				Номенклатура = Объект.Номенклатура;
			ИначеЕсли НЕ НеОбновлятьНоменклатуру
				И НЕ ПустаяСтрока(Объект.ШтрихКод) Тогда
				
				Номенклатура = ОбщийМодульТоварСервер.ПолучитьНоменклатуруПоШтрихКоду(Объект.ШтрихКод, , ИСТИНА);	
				Объект.Номенклатура = Номенклатура;
				НоменклатураПриИзмененииКлиентИСервер(ИСТИНА);
			КонецЕсли;
			
			Если значениезаполнено(Объект.Номенклатура) Тогда
				
				Объект.Валюта  = ПредопределенноеЗначение("Справочник.Валюты.ОсновнаяВалюта");
				Объект.Валюта2 = Объект.Валюта;
				Если ВестиУчетСерийНоменклатуры Тогда
					Серия = ?(ЗначениеЗаполнено(Объект.СерияСуществующейНоменклатуры), Объект.СерияСуществующейНоменклатуры.Наименование, Объект.СерияНоменклатуры);
				КонецЕсли;
				
				Если ЗначениеЗаполнено(Объект.ВидЦен) Тогда
					Объект.Валюта = Объект.ВидЦен.ВалютаЦены;
				КонецЕсли;
				
				Цена = ОбщийМодульСервер.ПолучитьЦенуНаСервере(Объект.Номенклатура, Объект.ВидЦен, Объект.Дата, , , , , , , , Объект.ЕдиницаИзмерения);
				Если цена = 0 Тогда
					Цена = Объект.Цена;
				Иначе
					Объект.Цена = Цена;
				КонецЕсли;
				
				Объект.Цена2   = 0;
				Объект.ВидЦен2 = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВторойВидЦенДляЭтикетки");
				Если ЗначениеЗаполнено(Объект.ВидЦен2) Тогда
					Объект.Цена2   = ОбщийМодульСервер.ПолучитьЦенуНаСервере(Объект.Номенклатура, Объект.ВидЦен2, Объект.Дата, , , , , , , , Объект.ЕдиницаИзмерения);
					Объект.Валюта2 = Объект.ВидЦен2.ВалютаЦены;
				КонецЕсли;			
				Объект.Цена3   = 0;
				Объект.ВидЦен3 = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ТретийВидЦенДляФормул");
				Если ЗначениеЗаполнено(Объект.ВидЦен3) Тогда
					Объект.Цена3 = ОбщийМодульСервер.ПолучитьЦенуНаСервере(Объект.Номенклатура, Объект.ВидЦен3, Объект.Дата, , , , , , , , Объект.ЕдиницаИзмерения);
					Объект.Валюта3 = Объект.ВидЦен3.ВалютаЦены;
				КонецЕсли;	
				Цена3 	= Объект.Цена3;
				Валюта3 = Объект.Валюта3;
				ВидЦен3 = Объект.ВидЦен3;
				
				Цена	= Объект.Цена;
				Цена2 	= Объект.Цена2;
				ВидЦен2 = Объект.ВидЦен2;
				Валюта2 = Объект.Валюта2;
				Валюта  = Объект.Валюта;
				ВидЦен 	= Объект.ВидЦен;
				Дата 	= Объект.Дата;
				Группа 	= Объект.Номенклатура.Родитель;
				Склад 	= Объект.Склад;
				ШтрихКод			 = Объект.ШтрихКод;			
				НоменклатурнаяГруппа = Объект.НоменклатурнаяГруппа;
				Производитель  		 = Объект.Производитель;
				СерияНоменклатуры	 = Объект.СерияНоменклатуры;
				ТекстСШтрихКодом	 = Объект.ТекстСШтрихКодом;
				Наименование		 = Объект.Наименование;
				Количество			 = Объект.Количество;
				ЕдиницаИзмерения	 = Объект.ЕдиницаИзмерения;
				ДополнительнаяСтрокаЭтикетки = Объект.ДополнительнаяСтрокаЭтикетки;
				
				Выполнить(" ОбъектТекстСШтрихКодом = """"+" + Объект.ОсновнаяФормулаТекстаЭтикетки.Формула + ";");
				Объект.ТекстСШтрихКодом = ОбъектТекстСШтрихКодом;	
			КонецЕсли;		
			
		Исключение 	
			ТекстОписаниеОшибки = ОписаниеОшибки();
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Произошла ошибка") + ": " + ТекстОписаниеОшибки;
			Сообщение.Поле 	= "ОсновнаяФормулаТекстаЭтикетки";
			Сообщение.УстановитьДанные(Объект);
			Сообщение.Сообщить();
			
		КонецПопытки;
		
	Иначе
		Если НЕ ПустаяСтрока(Объект.ШтрихКод) тогда
			ОбъектТекстСШтрихКодом = Объект.ШтрихКод;
		Иначе
			Если ЗначениеЗаполнено(Объект.Номенклатура) Тогда
				Номенклатура = Объект.Номенклатура;
			Иначе
				Номенклатура = ОбщийМодульТоварСервер.ПолучитьНоменклатуруПоШтрихКоду(Объект.ШтрихКод, , ИСТИНА);	
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Объект.Номенклатура) Тогда
				Цена = ОбщийМодульСервер.ПолучитьЦенуНаСервере(Объект.Номенклатура, Объект.ВидЦен, Объект.Дата, , , , , , , , Объект.ЕдиницаИзмерения);
				ОбъектТекстСШтрихКодом = ОбщийМодульПовтор.получитьПредставлениеНаЯзыке(Номенклатура) + " " + формат(Цена, "ЧЦ=12; ЧДЦ=2");	
			КонецЕсли;
		КонецЕсли;
		
		Если ВестиУчетСерийНоменклатуры
			И ЗначениеЗаполнено(Объект.СерияСуществующейНоменклатуры) Тогда
			
			ОбъектТекстСШтрихКодом = ОбъектТекстСШтрихКодом + " " + Объект.СерияСуществующейНоменклатуры;
		КонецЕсли;
		
	КонецЕсли;
	Объект.ТекстСШтрихКодом = ОбъектТекстСШтрихКодом;
	
конецпроцедуры

&НаСервере
Процедура ОбновитьценуНоменклатуры()
	
	Если ЗначениеЗаполнено(Объект.Номенклатура) Тогда
		Если ИспользоватьСложныйМеханизмЦен Тогда
			Объект.Цена = ОбщийМодульСервер.ПолучитьЦенуНаСервере(Объект.Номенклатура, Объект.ВидЦен, Объект.Дата, ЛОЖЬ, , , , , , , Объект.ЕдиницаИзмерения);
		Иначе
			Объект.Цена = Объект.Номенклатура.Цена;
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьШК(Знач НеобновлятьШтрихКОдИТексты = ЛОЖЬ, Знач НеОбновлятьНоменклатуру = ЛОЖЬ)
	
	ПроверитьФормулы(НеобновлятьШтрихКОдИТексты);
	Если НЕ НеобновлятьШтрихКОдИТексты Тогда
		ОбновитьШтрихКод(НеОбновлятьНоменклатуру);
		ОбновитьТекстСШтрихКодом(НеОбновлятьНоменклатуру);
		ОбновитьТекстДополнительнойСтроки(НеОбновлятьНоменклатуру);
		ОпределитьПроизвольнуюПечатнуюФорму();	
	КонецЕсли;
	
	Элементы.НоваяНоменклатура.Видимость = ЗначениеЗаполнено(Объект.Номенклатура);
	
КонецПроцедуры // обновитьШК()

&Насервере
Процедура ОбновитьШтрихКод(Знач НеОбновлятьНоменклатуру = ЛОЖЬ)
	
	Если ЗначениеЗаполнено(Объект.Номенклатура) Тогда
		Объект.ШтрихКод = Объект.Номенклатура.ОсновнойШтрихКод;
		Объект.ТекстСШтрихКодом = Объект.ШтрихКод;
	КонецЕсли;
	
	ОбновитьТекстаЗаголовкаЭтикетки(НеОбновлятьНоменклатуру);
	
	ОбновитьШтрихКодНаСервере();
	НаСумму = Объект.Количество * Объект.Цена;
	
конецпроцедуры

&Насервере
Процедура ОбновитьШтрихКодНаСервере()
	
	Если НЕ ПустаяСтрока(Объект.ШтрихКод) Тогда
		Объект.ТипШтрихКода = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ТипШтрихКодов");
		Если НЕ ЗначениеЗаполнено(Объект.ТипШтрихКода) Тогда
			Объект.ТипШтрихКода = МенеджерОборудованияВызовСервера.ОпределитьТипШтрихкода(Объект.ШтрихКод);
		КонецЕсли;		
	Иначе
		Объект.ТипШтрихКода = ПредопределенноеЗначение("ПланВидовХарактеристик.ТипыШтрихКодов.CODE128");
	КонецЕсли;
	
	Если ИспользуютсяФормулы 
		И ЗначениеЗаполнено(Объект.ФормулаФормированияШтрихКода) Тогда
		
		Если ЗначениеЗаполнено(Объект.Номенклатура) Тогда
			
			Объект.НоменклатурнаяГруппа = Объект.Номенклатура.НоменклатурнаяГруппа;
			Объект.Производитель 		= Объект.Номенклатура.Производитель;
			Объект.Наименование 		= Объект.Номенклатура.Наименование;			
			Объект.Цена 				= ОбщийМодульСервер.ПолучитьЦенуНаСервере(Объект.Номенклатура, Объект.ВидЦен, Объект.Дата, , , , , , , , Объект.ЕдиницаИзмерения);
			
			Если ВестиУчетСерийНоменклатуры
				И ЗначениеЗаполнено(Объект.СерияСуществующейНоменклатуры) Тогда
				
				Объект.СерияНоменклатуры = Объект.СерияСуществующейНоменклатуры.Наименование;
				
			ИначеЕсли ВестиУчетСерийНоменклатуры
				И ЗначениеЗаполнено(Объект.СерияНоменклатуры) Тогда
				
				Объект.СерияСуществующейНоменклатуры = ОбщийМодульТоварСервер.ОбнаружитьСериюНоменклатуры(Объект.Номенклатура, Объект.СерияНоменклатуры);
				
			КонецЕсли;
		КонецЕсли;
		
		Объект.ШтрихКод = "";
		
		Попытка 
			Номенклатура = Объект.Номенклатура;
			Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
				Номенклатура = Объект; // для новой номенклатуры
			КонецЕсли;
			
			Объект.ШтрихКод = ОбщийМодульТоварСервер.УстановитьШтрихКодНоменклатурыПоФормуле(Номенклатура, Объект.ФормулаФормированияШтрихКода.Формула, Объект.ВидЦен, Объект.Дата, Объект.Цена, Объект.СерияСуществующейНоменклатуры, Объект.ЕдиницаИзмерения);
			
		Исключение			
			ТекстОписаниеОшибки = ОписаниеОшибки();
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Произошла ошибка") + ": " + ТекстОписаниеОшибки;
			Сообщение.Поле 	= "ФормулаФормированияШтрихКода";
			Сообщение.УстановитьДанные(Объект);
			Сообщение.Сообщить();
			
		КонецПопытки;
		
	ИначеЕсли ВестиУчетСерийНоменклатуры
		И ЗначениеЗаполнено(Объект.СерияСуществующейНоменклатуры) Тогда
		
		Объект.ШтрихКод = ОбщийМодульТоварСервер.ПолучитьШтрихКодСерии(Объект.СерияСуществующейНоменклатуры);
		
		Если ПустаяСтрока(Объект.ШтрихКод)
			И значениезаполнено(Объект.Номенклатура) Тогда
			
			Объект.ШтрихКод = Объект.номенклатура.ОсновнойШтрихКод;
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(Объект.Номенклатура) Тогда
		Объект.ШтрихКод = Объект.номенклатура.ОсновнойШтрихКод;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьПолученныйШКНаСервере(Знач ТекКод)
	
	Если НЕ ПустаяСтрока(ТекКод) тогда
		
		РезультатОбработки = ОбщийМодульТоварСервер.ПолучитьНоменклатуруПоШтрихКоду(ТекКод, ИСТИНА, ИСТИНА);
		Если ЗначениеЗаполнено(РезультатОбработки) Тогда
			
			Объект.Номенклатура 					= РезультатОбработки.Номенклатура;
			Объект.Количество						= ОбщийМодульСервер.ПолучитьКоличествоПоУмолчанию(РезультатОбработки.Номенклатура);
			Объект.СерияСуществующейНоменклатуры 	= РезультатОбработки.СерияНоменклатуры;
			Объект.Производитель 					= Объект.Номенклатура.Производитель;
			Объект.НоменклатурнаяГруппа 			= Объект.Номенклатура.НоменклатурнаяГруппа;
			Объект.Наименование 					= Объект.Номенклатура.Наименование;			
			ОбновитьШК();
			
		Иначе
			ОбщегоНазначения.СообщитьПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Товар по Штрих-Коду не найден") + "(" + ТекКод + ").");
		КонецЕсли;               	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник = "ПодключаемоеОборудование"
		И ВводДоступен() Тогда
		
		Если ИмяСобытия = "ScanData" Тогда
			Если Параметр[ 1 ] = Неопределено Тогда
				ШтрихКод = Параметр[ 0 ];
			Иначе
				ШтрихКод = Параметр[ 1 ][ 1 ];
			КонецЕсли;
			
			ОбработатьПолученныйШКНаСервере(ШтрихКод);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция	  ОбщийМодульСерверНапечататьЭтикетку()
	
	Если ПараметрыСеанса.ВестиУчетНоменклатурыВРазрезеНоменклатурныхГруппПС
		И НЕ ЗначениеЗаполнено(Объект.НоменклатурнаяГруппа)
		И ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("НоменклатурнаяГруппаОбязательныйРеквизитЛюбойНоменклатуры") Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Номенклатурная группа обязательный реквизит номенклатуры, но она не указана!");
		Сообщение.Сообщить();
		ОбщийМодульСервисСервер.ДобавитьСообщениеПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Номенклатурная группа обязательный реквизит номенклатуры, но она не указана!"));
		
		Таб = Неопределено;
		
	Иначе           		
		СтруктураПечати = Новый Структура;
		СтруктураПечати.Вставить("ШтрихКод", Объект.ШтрихКод);
		СтруктураПечати.Вставить("ТипШтрихКода", Объект.ТипШтрихКода);
		СтруктураПечати.Вставить("ТекстСШтрихКодом", Объект.ТекстСШтрихКодом);
		СтруктураПечати.Вставить("Количество", Объект.Количество);		
		СтруктураПечати.Вставить("Склад", Объект.Склад);
		СтруктураПечати.Вставить("Дата", Объект.Дата);
		СтруктураПечати.Вставить("ТекстЗаголовка", Объект.ТекстЗаголовка);
		СтруктураПечати.Вставить("ДополнительнаяСтрокаЭтикетки", Объект.ДополнительнаяСтрокаЭтикетки);
		СтруктураПечати.Вставить("ВсеПараметрыПечати", ОбщийМодульТекстСервер.ПолучитьВсеПараметрыПечатиОбъекта(Объект, "Обработки", "ПечатьЭтикетки"));
		СтруктураПечати.Вставить("ПроизвольнаяПечатнаяФорма", Объект.ПроизвольнаяПечатнаяФорма);
		
		//здесь
		Таб = ОбщийМодульТоварСервер.НапечататьЭтикетку(СтруктураПечати, , ИСТИНА);
		
	КонецЕсли;
	
	Возврат Таб;
	
КонецФункции

&НаСервере
Функция   ОбщийМодульСерверНапечататьЭтикеткуОбъектам(Знач ШтрихКод, Знач ТекстСШтрихКодом, Знач Количество = 1, Табдок = Неопределено, Знач ТекстЗаголовка = "")
	
	СтруктураПечати = Новый Структура;
	СтруктураПечати.Вставить("ШтрихКод", ШтрихКод);
	СтруктураПечати.Вставить("ТекстСШтрихКодом", ТекстСШтрихКодом);
	СтруктураПечати.Вставить("Количество", Количество);
	СтруктураПечати.Вставить("ТекстЗаголовка", ТекстЗаголовка);
	
	ОбщийМодульТоварСервер.НапечататьЭтикетку(СтруктураПечати, ТабДок);		
	
	Возврат ТабДок;
	
КонецФункции

&НаСервере
функция   ОбщийМодульСерверПолучитьНоменклатуруПоШтрихКоду(ШтрихКод)
	возврат ОбщийМодульТоварСервер.ПолучитьНоменклатуруПоШтрихКоду(ШтрихКод, ИСТИНА, ИСТИНА);
конецфункции

&НаСервере
функция   ОбщийМодульСерверСоздатьНоменклатуру(Знач ШтрихКод, Знач Производитель, Знач НоменклатурнаяГруппа, Знач Цена, Знач Наименование)
	
	Возврат ОбщийМодульТоварСервер.СоздатьНоменклатуру(ШтрихКод, Производитель, НоменклатурнаяГруппа, Цена, наименование, Объект.ВидЦен, Объект.ГруппаНоменклатуры, Объект.СерияНоменклатуры);
	
конецфункции

&НаКлиенте
Процедура ОсновнаяФормулаТекстаЭтикеткиПриИзменении(Элемент)
	ОбновитьТекстСШтрихКодом(ИСТИНА);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	ТекущаяСтраница = Элементы.ГруппаСтраниц.ТекущаяСтраница;
	СтраницыПанели  = Элементы.ГруппаСтраниц.ПодчиненныеЭлементы;
	СтраницаПанели  = СтраницыПанели.Индекс(ТекущаяСтраница);
	
КонецПроцедуры

&НаКлиенте
Процедура Плюс10(Команда)
	Объект.Количество = Объект.Количество + 10;
	НаСумму = Объект.Количество * Объект.Цена;
КонецПроцедуры

&НаСервереБезКонтекста
Функция   ПолучитьРеквизитыНаСервере(Знач Номенклатура, Знач Реквизит);
	Возврат Номенклатура[Реквизит];
КонецФункции

&НаКлиенте
Процедура ПриЗакрытии()                                              // ПРИ ЗАКРЫТИИ
	
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
	
	Если ИспользоватьПодключаемоеОборудование Тогда
		ПоддерживаемыеТипыВО = Новый Массив ();
		ПоддерживаемыеТипыВО.Добавить("СканерШтрихКода");
		МенеджерОборудованияКлиент.ОтключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)                                         // ПРИ ОТКРЫТИИ	
	
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
	
	Если Объект.Количество = 0 Тогда
		Объект.Количество = 1;
	КонецЕсли;
	ПроверитьФормулы();
	
	обновитьШК();
	Если НЕ Объект.ЭтоДобавлениеИзДокумента Тогда
		этаформа.Элементы.НеПечатать.Видимость = ЛОЖЬ
	КонецЕсли;
	
	Если ИспользоватьШтрихКоды тогда
		
		Если ИспользоватьПодключаемоеОборудование И 
			МенеджерОборудованияКлиент.ОбновитьРабочееМестоКлиента() Тогда
			
			ОписаниеОшибки = "" ;
			ПоддерживаемыеТипыВО = Новый Массив();
			ПоддерживаемыеТипыВО.Добавить("СканерШтрихКода");
			
			Если НЕ МенеджерОборудованияКлиент.ПодключитьОборудованиеПоТипу(УникальныйИдентификатор, ПоддерживаемыеТипыВО, ОписаниеОшибки) Тогда
				ТекстСообщения = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке( "При подключении оборудования произошла ошибка") + ": " + ОписаниеОшибки ;
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;         	
	
	Если ЗначениеЗаполнено(СтраницаПанели)Тогда
		
		попытка
			СтраницыПанели  = Элементы.ГруппаСтраниц.ПодчиненныеЭлементы;
			ТекущаяСтраница = СтраницыПанели.получить(СтраницаПанели);
			Элементы.ГруппаСтраниц.ТекущаяСтраница = ТекущаяСтраница;
		исключение
		конецпопытки;	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Номенклатура) Тогда
		Этаформа.ТекущийЭлемент = Элементы.производитель;
	Иначе
		Этаформа.ТекущийЭлемент = Элементы.номенклатура;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПредыдущаяНоменклатура) Тогда
		Элементы.ГруппаПредыдущаяНоменклатура.Видимость = ЗначениеЗаполнено(ПредыдущаяНоменклатура);
	КонецЕсли;
	
	ОпределитьПроизвольнуюПечатнуюФорму();
	
	ВидЦенПриИзмененииНаСервере();
	
	ПодключитьОбработчикОжидания("ПослеИзображенияОкнаФормы", 0.3, ИСТИНА);	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеИзображенияОкнаФормы() // Когда окно уже нарисовано пользователю
	ЭтаФорма.Элементы.ФормаЗакрыть.Видимость = НЕ ЭтаФорма.Окно = Неопределено;	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)          // ПРИ СОЗДАНИИ НА СЕРВЕРЕ
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("000200", ЭтаФорма, Отказ, );
	
	Если НЕ Отказ Тогда
		Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьСобственныйПереводЭлементовИнтерфейса") Тогда
			ОбщийМодульСервер.ПеревестиРеквизитыФормы(ЭтаФорма);	
		КонецЕсли;
		
		ИспользоватьШтрихКоды 				 = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьШтрихКоды");
		ИспользоватьПодключаемоеОборудование = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьПодключаемоеОборудование");
		ИспользуютсяФормулы 				 = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьФормулыАвтоНаименованияФормированияШтрихКодаИТекстаСШтрихКодом");	
		ИспользоватьСложныйМеханизмЦен 		 = ПараметрыСеанса.ИспользоватьСложныйМеханизмЦенПС ;
		ИспользоватьПроизвольныеПечатныеФормы= ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьПроизвольныеПечатныеФормы");
		
		ВестиУчетСерийНоменклатуры = ПараметрыСеанса.ВестиУчетПоСериямНоменклатуры
		ИЛИ ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетСерийНоменклатурыТолькоПриПоступлении");
		
		ВывестиДополнительнуюСтрокуЭтикетки	 = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВывестиДополнительнуюСтрокуЭтикетки");
		
		Элементы.ФормулаДополнительнойСтроки.Видимость = ИспользуютсяФормулы И ВывестиДополнительнуюСтрокуЭтикетки;
		ФормулаДополнительнойСтроки = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ФормулаДополнительнойСтрокиЭтикетки");
		Элементы.ФормулаДополнительнойСтроки.Видимость = ВывестиДополнительнуюСтрокуЭтикетки;
		Объект.ДополнительнаяСтрокаЭтикетки = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ДополнительнаяСтрокаЭтикетки");	
		
		Если ЗначениеЗаполнено(параметры.Дата) Тогда
			Объект.дата = параметры.Дата;
		Иначе
			Объект.дата = ОбщийМодульСервисСервер.ПользователяТекущаяДата();
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Параметры.Склад) Тогда
			Объект.Склад = Параметры.Склад;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(параметры.ВидЦен) Тогда
			Объект.ВидЦен = параметры.ВидЦен;
		КонецЕсли;	
		
		Если НЕ ЗначениеЗаполнено(Объект.ВидЦен)
			И ИспользоватьСложныйМеханизмЦен Тогда
			
			Объект.ВидЦен = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВидЦенПриходованияТовараПоУмолчанию");
			Если НЕ ЗначениеЗаполнено(Объект.ВидЦен) Тогда
				Объект.ВидЦен = ПредопределенноеЗначение("Справочник.ВидыЦен.ГлавныйВидЦен");
			КонецЕсли;		
		КонецЕсли;
		
		Если ЗначениеЗаполнено(параметры.НоменклатураДляпечати) Тогда
			
			Объект.Номенклатура 		= параметры.НоменклатураДляпечати;
			Объект.Производитель 		= Объект.Номенклатура.Производитель;
			Объект.НоменклатурнаяГруппа = Объект.Номенклатура.НоменклатурнаяГруппа;
			Объект.Наименование 		= СокрЛП(Объект.Номенклатура);
			Объект.СерияНоменклатуры 	= СокрЛП(Параметры.СерияНоменклатуры);
			Объект.СерияСуществующейНоменклатуры = Параметры.СерияНоменклатуры;
			Объект.ЕдиницаИзмерения 	= Параметры.ЕдиницаИзмерения;
			
			ОбновитьценуНоменклатуры();
			Элементы.СоздатьНоменклатуру.Видимость = ЛОЖЬ;
		КонецЕсли;
		
		Если параметрысеанса.НеМожетМенятьЦены  тогда
			Если ЗначениеЗаполнено(Объект.ВидЦен) Тогда			
				Элементы.ВидЦен.Доступность = ЛОЖЬ;			
			КонецЕсли;
			Элементы.Цена.Доступность = ЛОЖЬ;
		КонецЕсли;
		
		проверитьнаименованиевалюты();
		ВидЦенПриИзмененииНаСервере();
		
		Элементы.НоменклатурнаяГруппа.ОтметкаНезаполненного = ПараметрыСеанса.ВестиУчетНоменклатурыВРазрезеНоменклатурныхГруппПС И ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("НоменклатурнаяГруппаОбязательныйРеквизитЛюбойНоменклатуры");
		Элементы.Контрагенты.Видимость = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьШтрихКодыДляИдентификацииКонтрагентов");	
		
		ФормулаГенерацииСерий = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ФормулаГенерацииСерий");
		Элементы.СформироватьСерию.Видимость = ЗначениеЗаполнено(ФормулаГенерацииСерий);		
		
		Если Параметры.СозданиеНоменклатуры Тогда
			Элементы.СтраницаКонтрагента.Видимость 	  = ЛОЖЬ;
			Элементы.СтраницаДляОрганизации.Видимость = ЛОЖЬ;
			Элементы.ГруппаДляПозицииНомера.Видимость = ЛОЖЬ;
			Элементы.ДляСотрудников.Видимость 		  = ЛОЖЬ;
			Элементы.Ваучеры.Видимость 				  = ЛОЖЬ;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаименованиеВалюты()
	
	Если ЗначениеЗаполнено(Объект.ВидЦен) Тогда
		НаименованиеВалюты = Объект.ВидЦен.ВалютаЦены;
	Иначе
		НаименованиеВалюты = ПредопределенноеЗначение("Справочник.Валюты.ОсновнаяВалюта").Наименование ;
	КонецЕсли;                         	
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьФормулуТекстаЗаголовка(Команда)
	ПроверитьФормулуТекстаЗаголовкаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПроверитьФормулуТекстаЗаголовкаНаСервере()
	
	Если ИспользуютсяФормулы 
		И ЗначениеЗаполнено(Объект.ФормулаТекстаЗаголовка) Тогда
		
		ОбщийМодульСервер.ПроверитьФормулу(Объект.ФормулаТекстаЗаголовка.Формула);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьФормулуТекстаЭтикетки(Команда)
	ПроверитьФормулуТекстаЭтикеткиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПроверитьФормулуТекстаЭтикеткиНаСервере()
	
	Если ИспользуютсяФормулы 
		И ЗначениеЗаполнено(Объект.ОсновнаяФормулаТекстаЭтикетки) Тогда
		
		ОбщийМодульСервер.ПроверитьФормулу(Объект.ОсновнаяФормулаТекстаЭтикетки.Формула);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьФормулуШтрихКода(Команда)
	ПроверитьФормулуШтрихКодаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПроверитьФормулуШтрихКодаНаСервере()
	
	Если ИспользуютсяФормулы 
		И ЗначениеЗаполнено(Объект.ФормулаФормированияШтрихКода) Тогда
		
		ОбщийМодульСервер.ПроверитьФормулу(Объект.ФормулаФормированияШтрихКода.Формула);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьФормулы(Знач НеобновлятьШтрихКОдИТексты = ЛОЖЬ)
	
	Если НЕ НеобновлятьШтрихКОдИТексты Тогда
		Если ИспользуютсяФормулы
			И НЕ ЗначениеЗаполнено(Объект.ФормулаФормированияШтрихКода) Тогда
			
			Объект.ФормулаФормированияШтрихКода = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ОсновнаяФормулаШтрихКодаНоменклатуры");	
			Если ЗначениеЗаполнено(Объект.Производитель) 
				И ЗначениеЗаполнено(Объект.Производитель.СвояФормулаШтрихКодаНоменклатуры) Тогда
				
				Объект.ФормулаФормированияШтрихКода = Объект.Производитель.СвояФормулаШтрихКодаНоменклатуры;			
			КонецЕсли;
		КонецЕсли;
		
		Если ИспользуютсяФормулы
			И НЕ ЗначениеЗаполнено(Объект.ОсновнаяФормулаТекстаЭтикетки) Тогда
			
			Объект.ОсновнаяФормулаТекстаЭтикетки = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ОсновнаяФормулаТекстаЭтикетки");
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроизводительОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	ОбщийМодульКлиент.ПоискОшибкиКодировки("Производители", ДанныеВыбора, Текст, Объект.Производитель);
	Если значениезаполнено(Объект.Производитель) Тогда
		ДанныеНоменклатурыПриИзмененииНаСервере();
		обновитьШК();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроизводительПриИзменении(Элемент)
	
	ДанныеНоменклатурыПриИзмененииНаСервере();
	обновитьШК();
	Если ЗначениеЗаполнено(Объект.Номенклатура) Тогда
		этаформа.ТекущийЭлемент = Элементы.Количество;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФормулаТекстаЗаголовкаПриИзменении(Элемент)
	ОбновитьТекстаЗаголовкаЭтикетки(ИСТИНА);
КонецПроцедуры

&НаКлиенте
Процедура ФормулаФормированияШтрихКодаПриИзменении(Элемент)
	обновитьШК(ИСТИНА);
КонецПроцедуры

&НаКлиенте
Процедура ЦенаПриИзменении(Элемент)
	
	ДанныеНоменклатурыПриИзмененииНаСервере();
	обновитьШК();
	Если ЗначениеЗаполнено(Объект.Номенклатура) Тогда
		этаформа.ТекущийЭлемент = Элементы.Количество;
	КонецЕсли;
	НаСумму = Объект.Количество * Объект.Цена;
	
КонецПроцедуры

&НаКлиенте
Процедура ШтрихКодПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.Номенклатура) Тогда
		ОбработатьПолученныйШКНаСервере(Объект.ШтрихКод);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НапечататьШтрихКодыСотрудников(Команда)
	
	КоличествоЭтикеток = Объект.Сотрудники.Итог("Количество");
	
	Если КоличествоЭтикеток > 0 Тогда
		
		Если КоличествоЭтикеток <= 30 Тогда
			НапечататьШтрихКодыСотрудниковФрагмент();
		Иначе
			ПоказатьВопрос(Новый ОписаниеОповещения("НапечататьШтрихКодыСотрудниковЗавершение", ЭтаФорма), ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Вы уверены, что хотите распечатать такое число") + " (" + КоличествоЭтикеток + ")?", режимдиалогавопрос.ДаНет);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НапечататьШтрихКодыСотрудниковЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		НапечататьШтрихКодыСотрудниковФрагмент();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НапечататьШтрихКодыСотрудниковФрагмент()
	
	ПараметрыФормыПечати = Новый Структура;
	ПараметрыФормыПечати.Вставить("НаименованиеДокумента", ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Этикетки для сотрудников"));
	ПараметрыФормыПечати.Вставить("НеПечататьНичегоДополнительно", ИСТИНА);
	ФормаПечати = получитьформу("ОбщаяФорма.ФормаПечати", ПараметрыФормыПечати);			
	
	ЕстьЧтоПечататьВФорме = НапечататьЭтикеткиДляВсехСтрокТаблицыНаСервере(ФормаПечати.Результат, , ИСТИНА);
	
	Если ЕстьЧтоПечататьВФорме Тогда
		ФормаПечати.Заголовок = ПараметрыФормыПечати.НаименованиеДокумента;
		ФормаПечати.Открыть();
	Иначе
		ФормаПечати = Неопределено;
	КонецЕсли;		
	
КонецПроцедуры

&НаКлиенте
Процедура ФормулаДополнительнойСтрокиПриИзменении(Элемент)
	обновитьШК();
КонецПроцедуры

Процедура ОпределитьПроизвольнуюПечатнуюФорму(Знач НеЗаставлять = ЛОЖЬ)
	
	Если ИспользоватьПроизвольныеПечатныеФормы
		И ЗначениеЗаполнено(Объект.НоменклатурнаяГруппа) Тогда
		
		Объект.ПроизвольнаяПечатнаяФорма = ПолучитьРеквизитыНаСервере(Объект.НоменклатурнаяГруппа, "ПроизвольнаяПечатнаяФормаЭтикетки");
	КонецЕсли;
	
	Если ИспользоватьПроизвольныеПечатныеФормы
		И НЕ НеЗаставлять
		И НЕ ЗначениеЗаполнено(Объект.ПроизвольнаяПечатнаяФорма) Тогда
		
		Объект.ПроизвольнаяПечатнаяФорма = ОбщийМодульТекстСервер.ОпределитьПроизвольнуюПечатнуюФорму(ПредопределенноеЗначение("Перечисление.ВидыПечатныхФорм.Этикетка"), Объект.Дата);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СерияСуществующейНоменклатурыПриИзменении(Элемент)
	
	СерияНаСервере();
	НоменклатураПриИзмененииКлиентИСервер(, ИСТИНА);
	
КонецПроцедуры

&НаСервере
Процедура СерияНаСервере()
	
	Если ЗначениеЗаполнено(ОБъект.СерияСуществующейНоменклатуры) Тогда		
		Объект.Номенклатура = Объект.СерияСуществующейНоменклатуры.Владелец;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьСерию(Команда)
	
	Объект.СерияНоменклатуры = ОбщийМодульТоварСервер.СгенерироватьСерию(ФормулаГенерацииСерий, Объект.Номенклатура); //номенклатура может быть ещё пустой
	Объект.ШтрихКод = Объект.СерияНоменклатуры;
	
КонецПроцедуры

&НаКлиенте
Процедура РаботатьСПеречнемНоменклатурыТаблицейТоваров(Команда)
	
	ОткрытьФорму("Обработка.ПечатьЭтикетки.Форма.ФормаДляТаблицы");
	Закрыть(ЛОЖЬ);
	
КонецПроцедуры
