//sza140411-1656 : 
//sza131118-0056

Процедура ПередЗаписью(Отказ)	
	
	Если НЕ Отказ 
		И Не ПометкаУдаления Тогда
		
		Отказ = ОбщийМодульСервер.ПроверитьУникальностьНаименование(Отказ, "Производители", ЭтотОбъект.Наименование, ЭтотОбъект.Ссылка);
		ОбщийМодульСервер.ПроверитьСменуНаименованияНаТекущемЯзыке(Наименование, Ссылка, , Отказ);	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Комментарий = "";
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Поставщики") Тогда
		// Заполнение шапки
		Адрес = ДанныеЗаполнения.Адрес;
		Комментарий = ДанныеЗаполнения.Комментарий;
		Наименование = ДанныеЗаполнения.Наименование;
		Регион = ДанныеЗаполнения.Регион;
		Телефон = ДанныеЗаполнения.Телефон;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Сотрудники") Тогда
		// Заполнение шапки
		Адрес = ДанныеЗаполнения.Адрес;
		Комментарий = ДанныеЗаполнения.Комментарий;
		Наименование = ДанныеЗаполнения.Наименование;
		Телефон = ДанныеЗаполнения.Телефон;
	КонецЕсли;
	
КонецПроцедуры
