// sza131119-1242

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ПараметрыФормы = Новый Структура("ПараметрКоманды", ПараметрКоманды);

	Если ОбщийМодульСервисСервер.ПолучитьВерсиюПлатформы() < 803040000 Тогда
		ОткрытьФорму("Справочник.ЗаметкиИНапоминания.Форма.ФормаЗаписи", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	Иначе
			Выполнить(" ОткрытьФорму(""Справочник.ЗаметкиИНапоминания.Форма.ФормаЗаписи"", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка); ");
		КонецЕсли;

КонецПроцедуры
