// sza150403-1251 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("002455", ЭтаФорма, Отказ);
	
	Если НЕ Отказ Тогда
		Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьСобственныйПереводЭлементовИнтерфейса") Тогда
			ОбщийМодульСервер.ПеревестиРеквизитыФормы(ЭтаФорма);	
		КонецЕсли;
		
		ПоВидуПроизвольныхПечатныхФорм = Параметры.ПечатнаяФорма;
		Элементы.ПоВидуПроизвольныхПечатныхФорм.Видимость = ЗначениеЗаполнено(ПоВидуПроизвольныхПечатныхФорм);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПечатнуюФорму(Команда)
	
	ПараметрДляФормы = Новый Структура("ПечатнаяФорма", ПоВидуПроизвольныхПечатныхФорм);
	ОткрытьФорму("Справочник.ПроизвольныеПечатныеФормы.ФормаОбъекта", ПараметрДляФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры
