//sza140610-1650 Хозяин: 
//sza140604-1537 : 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаголовокВопроса 	= Параметры.ЗаголовокВопроса;
	Элементы.ЗаголовокВопроса.Видимость = НЕ ЗаголовокВопроса = "";
	
	ПодвалВопроса 		= Параметры.ПодвалВопроса;
	Элементы.ПодвалВопроса.Видимость 	= НЕ ПодвалВопроса = "";
	
	ТекстВопроса 		= Параметры.ТекстВопроса;
	Элементы.ТекстВопроса.Видимость 	= НЕ ТекстВопроса = "";
	
	ЭтаФорма.Заголовок  = Параметры.ЗаголовокФормы;
	
	Если не Параметры.СтруктураКнопокИПоведения = Неопределено Тогда
		
		группаКоманд = Элементы.ГруппаКоманд;
		Для Каждого ЭлементКоманда Из Параметры.СтруктураКнопокИПоведения Цикл
			
			НоваяКоманда = Команды.Добавить("КнопкаКоманды" + ЭлементКоманда[0]);
			НоваяКоманда.Действие  = "ОткрытьКнопкуКоманды";
			
			НоваяКоманда = элементы.Добавить("КнопкаКоманды" + ЭлементКоманда[0], тип("КнопкаФормы"), группаКоманд);
			НоваяКоманда.Заголовок  = ЭлементКоманда[1];
			СтрокаКоманда = ТаблицаКоманд.Добавить();
			СтрокаКоманда.Код = ЭлементКоманда[0];
			СтрокаКоманда.Программа = ЭлементКоманда[2];
			
			НоваяКоманда.ИмяКоманды = "КнопкаКоманды" + ЭлементКоманда[0];
			
		КонецЦикла;
		
	Иначе
		
		НоваяКоманда = Команды.Добавить("КнопкаЗакрыть");
		НоваяКоманда.Действие  = "ОткрытьКнопкуКоманды";
		
		НоваяКоманда = элементы.Добавить("КнопкаЗакрыть", тип("КнопкаФормы"), группаКоманд);
		НоваяКоманда.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Закрыть");
		НоваяКоманда.ИмяКоманды = "КнопкаЗакрыть";		
		
	КонецЕсли;
	
	Если Параметры.ЭтоВыборПериода Тогда
			ВыбранныйПериод.ДатаНачала = параметры.ДатаНачала;
			ВыбранныйПериод.ДатаОкончания = параметры.ДатаОкончания;
		КонецЕсли;
	Элементы.ГруппаВыбораПериода.Видимость = Параметры.ЭтоВыборПериода;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКнопкуКоманды(Команда)
	
	Если Команда.Имя = "КнопкаЗакрыть" Тогда
		Закрыть();
	Иначе		
		Закрыть(ВыполнитьЭтуКомандуНаСервере(Команда.Имя));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция   ВыполнитьЭтуКомандуНаСервере(Знач ИмяКоманды)
	
	Результат = Неопределено;
	
	КодКоманды = СтрЗаменить(ИмяКоманды, "КнопкаКоманды", "");
	ПараметрыОтбора = Новый Структура("Код", КодКоманды);
	СтрокиКоманда = ТаблицаКоманд.НайтиСтроки(ПараметрыОтбора);
	Если НЕ СтрокиКоманда.Количество() = 0 Тогда
		Попытка
			Выполнить("" + СтрокиКоманда[0].Программа + ";");
		Исключение
			сообщить(ОписаниеОшибки());
			Результат = Ложь;
		КонецПопытки;	                             	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
