// sza150619-0131
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("003000", ЭтаФорма, Отказ, );	
	
	Если НЕ Отказ Тогда
		Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьСобственныйПереводЭлементовИнтерфейса") Тогда
			ОбщийМодульСервер.ПеревестиРеквизитыФормы(ЭтаФорма);	
		КонецЕсли;
		
		Элементы.ПрограммноеУсловие.Видимость = Запись.ВидВерсионирования = ПредопределенноеЗначение("Перечисление.ВидыВерсионирования.ПриУсловии");
		
		Если НЕ ЗначениеЗаполнено(Запись.Период) Тогда
			Запись.Период = ОбщийМодульСервисСервер.ПользователяТекущаяДата(); 
		КонецЕсли;
		
		ОбщийМодульСервер.ЗадатьПереченьОбъектовБазыДанных(Элементы.ОбъектБазыДанных.СписокВыбора);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидВерсионированияПриИзменении(Элемент)
	Элементы.ПрограммноеУсловие.Видимость = Запись.ВидВерсионирования = ПредопределенноеЗначение("Перечисление.ВидыВерсионирования.ПриУсловии");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0, Запись.Ответственный, ИСТИНА);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1, Запись.Ответственный, ИСТИНА);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьПовторноИспользуемыеЗначения();
	глЧислоОбъектов = глЧислоОбъектов + 1; глПроверятьСообщения = ИСТИНА;
	
КонецПроцедуры
