//sza140420-0458 SZA: 
//sza140126-0208 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("000690", ЭтаФорма, Отказ, );
	
	Если НЕ Отказ Тогда
		Если ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ОтключитьПланированиеВДокументеВыполненияРабот") Тогда
			элементы.РезультатПлан.Видимость = Ложь;
			элементы.БезПлана.Видимость = Ложь;
			элементы.Актуален.Видимость = Ложь;
		КонецЕсли;
		
		ЕстьУчетДвижений = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ДобавитьФункцииПриемаИВыдачиОбъектаРаботДокументуВыполненияРабот");
		
		элементы.ДатаПоступленияОбъектаРаботНаНашСклад.Видимость = ЕстьУчетДвижений;
		элементы.ДатаВыдачиОбъектаРаботКлиентуОбратно.Видимость  = ЕстьУчетДвижений;
		ОбщийМодульСервер.ОбеспечитьСписокОтборов(Список);
	КонецЕсли;
	
КонецПроцедуры
