//sza131211-1459 SZA: 
//sza131121-1822 SZA: 

процедура ДобавитьНапоминанияПриСтартеСистемы() Экспорт	
	//develop                  
	ПроверитьВключитьВыключитьНапоминания();	
КонецПроцедуры

процедура ПроверитьВключитьВыключитьНапоминания() Экспорт
	
	Если ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ИспользоватьМеханизмЗаметокИНапоминаний") Тогда
		ПодключитьОбработчикОжидания("НапоминанияПользователю", 60);	
	Иначе
		ОтключитьОбработчикОжидания("НапоминанияПользователю");
	КонецЕсли; 	
	
Конецпроцедуры

Процедура НапоминанияПользователю() Экспорт
	
	Если ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ИспользоватьМеханизмЗаметокИНапоминаний") Тогда   		
		
		СтруктураНапоминаний 	= ОбщийМодульСерверПривилегия.ПроверитьНаличиеПропущенныхНапоминаний();
		
		Если СтруктураНапоминаний.Есть Тогда			
			
			МассивНапоминаний 		= Новый Массив;
			Для каждого напоминание из СтруктураНапоминаний.МассивНапоминаний Цикл
				
				напоминание = ОбщийМодульСерверПривилегия.ЗаписатьВыполнениеНапоминания(напоминание);
				
				МассивНапоминаний.Добавить(напоминание);
				
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = ОбщийМодульСервисСервер.ПолучитьЗначениеРеквизита(напоминание, "Наименование");
				Сообщение.Сообщить();						
				
			КонецЦикла;		
			
			Если НЕ МассивНапоминаний.Количество() = 0 Тогда
				
				ФормаНапоминаний = ПолучитьФорму("ОбщаяФорма.ФормаНапоминаний", , , "ФН");
				
				Для Каждого Напоминание Из МассивНапоминаний Цикл
					ФормаНапоминаний.МассивНапоминаний.Добавить(Напоминание);   	
				КонецЦикла;
				
				Если ФормаНапоминаний.Открыта() Тогда
					Оповестить("ОбновитьФормуНапоминаний");
				Иначе
					ФормаНапоминаний.Открыть();					
				КонецЕсли;				
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
