// sza131211-1459
// sza131121-1822
Процедура ДобавитьНапоминанияПриСтартеСистемы() Экспорт

	// 16031301
	ПроверитьВключитьВыключитьНапоминания();

КонецПроцедуры

Процедура НапоминанияПользователю() Экспорт

	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьМеханизмЗаметокИНапоминаний") Тогда
		СтруктураНапоминаний = ОбщийМодульСерверПривилегия.ПроверитьНаличиеПропущенныхНапоминаний();
		Если СтруктураНапоминаний.Есть Тогда
			МассивНапоминаний = Новый Массив;

			Для Каждого напоминание Из СтруктураНапоминаний.МассивНапоминаний Цикл
				Напоминание = ОбщийМодульСерверПривилегия.ЗаписатьВыполнениеНапоминания(напоминание);
				МассивНапоминаний.Добавить(Напоминание);
				ОбщегоНазначения.СообщитьПользователю(ОбщийМодульСервисСервер.ПолучитьЗначениеРеквизита(напоминание, "Наименование"));

			КонецЦикла;

			Если НЕ МассивНапоминаний.Количество() = 0 Тогда
				ФормаНапоминаний = ПолучитьФорму("ОбщаяФорма.ФормаНапоминаний", , , "ФН");
				Для Каждого Напоминание Из МассивНапоминаний Цикл
					ФормаНапоминаний.МассивНапоминаний.Добавить(Напоминание);
				КонецЦикла;

				Если ФормаНапоминаний.Открыта() Тогда
					Оповестить("ОбновитьФормуНапоминаний");
				Иначе
					ФормаНапоминаний.Открыть();
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

Процедура ПроверитьВключитьВыключитьНапоминания() Экспорт

	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьМеханизмЗаметокИНапоминаний") Тогда
		ПодключитьОбработчикОжидания("НапоминанияПользователю", 60);
	Иначе
		ОтключитьОбработчикОжидания("НапоминанияПользователю");
	КонецЕсли;

КонецПроцедуры
