//sza131227-0155 : 
Процедура Печать(ТабДок, Ссылка) Экспорт
	
	Макет = Справочники.ПодсистемаИЭИмпортЭкспортФСДополнительноеПоведение.ПолучитьМакет("Печать");
	Макет.КодЯзыкаМакета = ОбщийМодульПовтор.ПолучитьТекущийЯзыкДокументов();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПодсистемаИЭИмпортЭкспортФСДополнительноеПоведение.ВыполнитьПрограммныйКод,
	|	ПодсистемаИЭИмпортЭкспортФСДополнительноеПоведение.ДатаРедакции,
	|	ПодсистемаИЭИмпортЭкспортФСДополнительноеПоведение.ДатаСоздания,
	|	ПодсистемаИЭИмпортЭкспортФСДополнительноеПоведение.ЗначениеРеквизита,
	|	ПодсистемаИЭИмпортЭкспортФСДополнительноеПоведение.ИмяРеквизита,
	|	ПодсистемаИЭИмпортЭкспортФСДополнительноеПоведение.Код,
	|	ПодсистемаИЭИмпортЭкспортФСДополнительноеПоведение.Наименование,
	|	ПодсистемаИЭИмпортЭкспортФСДополнительноеПоведение.Описание,
	|	ПодсистемаИЭИмпортЭкспортФСДополнительноеПоведение.Ответственный,
	|	ПодсистемаИЭИмпортЭкспортФСДополнительноеПоведение.ПрограммныйКод,
	|	ПодсистемаИЭИмпортЭкспортФСДополнительноеПоведение.УсловиеДополнительногоПоведенияПриИмпорте,
	|	ПодсистемаИЭИмпортЭкспортФСДополнительноеПоведение.ТаблицаПоведения.(
	|		НомерСтроки,
	|		ИмяТаблицы,
	|		ИмяРеквизита,
	|		УсловиеДополнительногоПоведенияПриЭкспорте,
	|		ЗначениеРеквизита )
	|ИЗ Справочник.ПодсистемаИЭИмпортЭкспортФСДополнительноеПоведение КАК ПодсистемаИЭИмпортЭкспортФСДополнительноеПоведение
	|ГДЕ ПодсистемаИЭИмпортЭкспортФСДополнительноеПоведение.Ссылка В (&Ссылка)";
	
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТаблицаПоведенияШапка = Макет.ПолучитьОбласть("ТаблицаПоведенияШапка");
	ОбластьТаблицаПоведения = Макет.ПолучитьОбласть("ТаблицаПоведения");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = ЛОЖЬ;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьТаблицаПоведенияШапка);
		ВыборкаТаблицаПоведения = Выборка.ТаблицаПоведения.Выбрать();
		Пока ВыборкаТаблицаПоведения.Следующий() Цикл
			ОбластьТаблицаПоведения.Параметры.Заполнить(ВыборкаТаблицаПоведения);
			ТабДок.Вывести(ОбластьТаблицаПоведения, ВыборкаТаблицаПоведения.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = ИСТИНА;
	КонецЦикла;
	//}}
КонецПроцедуры



