// sza140324-1246
// sza140324-0214  

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура("Контрагент", ПараметрКоманды);
	ПараметрыФормы.Вставить("НеПечататьНичегоДополнительно", ИСТИНА);
	ФормаПечати = ПолучитьФорму("ОбщаяФорма.ФормаПечати", ПараметрыФормы);
	
	Печать(ФормаПечати.Результат, ПараметрКоманды);
	
	ФормаПечати.Результат.ОтображатьСетку 		= ЛОЖЬ;
	ФормаПечати.Результат.Защита 				= ИСТИНА;
	ФормаПечати.Результат.ТолькоПросмотр 		= ИСТИНА;
	ФормаПечати.Результат.ОтображатьЗаголовки 	= ЛОЖЬ;
	ФормаПечати.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("печать: почтовый бланк контрагента");
	ФормаПечати.Открыть();
	
КонецПроцедуры

&НаСервере
Процедура Печать(ДокументДляПечати, Знач ПараметрКоманды)
	
	ОбщийМодульСервер.ДобавитьСобытиеЖурналаНаСервере(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Напечатал почтовый бланк контрагента."), 2);
	
	ДокументДляПечати.ИмяПараметровПечати  = "ПочтовыйБланк" + СокрЛП(ИмяКомпьютера());
	ДокументДляПечати.КлючПараметровПечати = ДокументДляПечати.ИмяПараметровПечати;
	
	ДокументДляПечати.Очистить();
	
	ДокументДляПечати.НачатьАвтогруппировкуСтрок();
	
	Макет = ПолучитьОбщийМакет("ПочтовыйБланк");
	Макет.КодЯзыкаМакета = ОбщийМодульПовтор.ПолучитьТекущийЯзыкДокументов(ПараметрКоманды);
	
	Шапка = Макет.ПолучитьОбласть("Ш");
	Шапка.параметры.ТекстОценка 	= ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ПочтовыйБланкТекстОценка");
	Шапка.параметры.ИмяПолучателя 	= ?(ЗначениеЗаполнено(ПараметрКоманды.ИмяПолучателя), ПараметрКоманды.ИмяПолучателя, ОбщийМодульПовтор.получитьПредставлениеНаЯзыке(ПараметрКоманды));
	Шапка.параметры.Контрагент 		= ПараметрКоманды;
	Шапка.параметры.Регион 			= ПараметрКоманды.Регион;
	Шапка.параметры.Адрес 			= ПараметрКоманды.Адрес;
	Шапка.параметры.Индекс 			= превратитьВИндекс(ПараметрКоманды.ПочтовыйИндекс);
	Шапка.параметры.ТекстОтправитель 	= ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ПочтовыйБланкТекстОтправитель");
	Шапка.параметры.АдресОтправитель 	= ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ПочтовыйБланкАдресОтправитель");
	Шапка.параметры.ИндексОтправитель 	= превратитьВИндекс(ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ПочтовыйБланкИндексОтправитель"));
	
	ОбщийМодульСервисСервер.ЗаменитьСвоиЗначенияПараметровПечати(Шапка);
	ДокументДляПечати.Вывести(Шапка);
	ДокументДляПечати.ЗакончитьАвтогруппировкуСтрок();
	
	ДокументДляПечати.ОтображатьСетку = ЛОЖЬ;
	ДокументДляПечати.Защита = ИСТИНА;
	ДокументДляПечати.ТолькоПросмотр = ИСТИНА;
	ДокументДляПечати.ОтображатьЗаголовки = ЛОЖЬ;  	
	
КонецПроцедуры

&НаСервере
Функция ПревратитьВИндекс(Знач ТекстДляИндекса)
	
	Результат = "";
	ЧислоСимволов = СтрДлина(ТекстДляИндекса);
	Счетчик = 1;
	Пока Счетчик <= ЧислоСимволов Цикл
		Результат = Результат + Сред(ТекстДляИндекса, Счетчик, 1) + " ";
		счетчик = счетчик + 1;
	КонецЦикла;
	
	Возврат СокрЛП(Результат);
	
КонецФункции
