//sza140324-1246  
//sza140324-0214  
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура("Контрагент", ПараметрКоманды);
	ПараметрыФормы.Вставить("НеПечататьНичегоДополнительно", ИСТИНА);
	ФормаПечати = получитьформу("ОбщаяФорма.ФормаПечати", ПараметрыФормы);
	
	Печать(ФормаПечати.Результат, ПараметрКоманды);
	
	ФормаПечати.Результат.ОтображатьСетку 		= ЛОЖЬ;
	ФормаПечати.Результат.Защита 				= ИСТИНА;
	ФормаПечати.Результат.ТолькоПросмотр 		= ИСТИНА;
	ФормаПечати.Результат.ОтображатьЗаголовки 	= ЛОЖЬ;
	ФормаПечати.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("печать: почтовый бланк Контрагента");
	ФормаПечати.открыть();
	
КонецПроцедуры

&НаСервере
Процедура Печать(ТабДок, Знач ПараметрКоманды)
	
	ОбщийМодульСервер.ДобавитьСобытиеЖурналаНаСервере(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Напечатал почтовый бланк контрагента. "), 2);
	
	ТабДок.Очистить();
	
	ТабДок.Начатьавтогруппировкустрок();
	
	Макет = ПолучитьОбщийМакет("ПочтовыйБланк");
	Макет.КодЯзыкаМакета = ОбщийМодульПовтор.ПолучитьТекущийЯзыкДокументов(ПараметрКоманды);
	
	Шапка = Макет.ПолучитьОбласть("Ш");
	Шапка.параметры.ТекстОценка 	= ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ПочтовыйБланкТекстОценка");
	Шапка.параметры.ИмяПолучателя 	= ?(ЗначениеЗаполнено(ПараметрКоманды.ИмяПолучателя), ПараметрКоманды.ИмяПолучателя, ОбщийМодульПовтор.получитьПредставлениеНаЯзыке(ПараметрКоманды));
	Шапка.параметры.Контрагент 		= ПараметрКоманды;
	Шапка.параметры.Регион 			= ПараметрКоманды.Регион;
	Шапка.параметры.Адрес 			= ПараметрКоманды.Адрес;
	Шапка.параметры.Индекс 			= превратитьВИндекс(ПараметрКоманды.ПочтовыйИндекс);
	Шапка.параметры.ТекстОтправитель 	= ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ПочтовыйБланкТекстОтправитель");
	Шапка.параметры.АдресОтправитель 	= ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ПочтовыйБланкАдресОтправитель");
	Шапка.параметры.ИндексОтправитель 	= превратитьВИндекс(ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ПочтовыйБланкИндексОтправитель"));
	
	ТабДок.Вывести(Шапка);
	ТабДок.Закончитьавтогруппировкустрок();
	
	ТабДок.ОтображатьСетку = ЛОЖЬ;
	ТабДок.Защита = ИСТИНА;
	ТабДок.ТолькоПросмотр = ИСТИНА;
	ТабДок.ОтображатьЗаголовки = ЛОЖЬ;  	
	
КонецПроцедуры

&НаСервере
Функция превратитьВИндекс(Знач ТекстДляИндекса)
	
	Результат = "";
	ЧислоСимволов = СтрДлина(ТекстДляИндекса);
	Счетчик = 1;
	Пока Счетчик <= ЧислоСимволов Цикл
		Результат = Результат + Сред(ТекстДляИндекса, Счетчик, 1) + " ";
		счетчик = счетчик + 1;
	КонецЦикла;
	
	Возврат СокрЛП(Результат);
	
КонецФункции
