//sza140324-1246 SZA: 
//sza140324-0214 SZA: 

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура("Контрагент", ПараметрКоманды);
	ПараметрыФормы.Вставить("НеПечататьНичегоДополнительно", Истина);
	ФормаПечати = получитьформу("ОбщаяФорма.ФормаПечати", ПараметрыФормы);
	
	Печать(ФормаПечати.Результат, ПараметрКоманды);
	
	ФормаПечати.Результат.ОтображатьСетку 		= Ложь;
	ФормаПечати.Результат.Защита 				= Истина;
	ФормаПечати.Результат.ТолькоПросмотр 		= Истина;
	ФормаПечати.Результат.ОтображатьЗаголовки 	= Ложь;
	ФормаПечати.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("печать: почтовый бланк Контрагента");
	ФормаПечати.открыть();
	
КонецПроцедуры

&НаСервере
Процедура Печать(ТабДок, Знач ПараметрКоманды)
	
	ОбщийМодульСервер.ДобавитьСобытиеЖурналаНаСервере(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Напечатал почтовый бланк контрагента. "), 2);
	
	ТабДок.Очистить();
	
	ТабДок.Начатьавтогруппировкустрок();
	
	Макет = ПолучитьОбщийМакет("ПочтовыйБланк");
	Шапка = Макет.ПолучитьОбласть("Ш");
	Шапка.параметры.ТекстОценка = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ПочтовыйБланкТекстОценка");
	Шапка.параметры.ИмяПолучателя = ?(ЗначениеЗаполнено(ПараметрКоманды.ИмяПолучателя), ПараметрКоманды.ИмяПолучателя, ОбщийМодульПовтор.получитьПредставлениеНаЯзыке(ПараметрКоманды));
	Шапка.параметры.Контрагент 	= ПараметрКоманды;
	Шапка.параметры.Регион 		= ПараметрКоманды.Регион;
	Шапка.параметры.Адрес 		= ПараметрКоманды.Адрес;
	Шапка.параметры.Индекс 		= превратитьВИндекс(ПараметрКоманды.ПочтовыйИндекс);
	Шапка.параметры.ТекстОтправитель = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ПочтовыйБланкТекстОтправитель");
	Шапка.параметры.АдресОтправитель = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ПочтовыйБланкАдресОтправитель");
	Шапка.параметры.ИндексОтправитель = превратитьВИндекс(ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("ПочтовыйБланкИндексОтправитель"));
	
	ТабДок.Вывести(Шапка);
	ТабДок.Закончитьавтогруппировкустрок();
	
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Истина;
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Ложь;  	
	
КонецПроцедуры

&НаСервере
Функция превратитьВИндекс(Знач ТекстДляИндекса)
	
	Результат = "";
	ЧислоСимволов = СтрДлина(ТекстДляИндекса);
	Счетчик = 1;
	Пока Счетчик <= ЧислоСимволов Цикл
		Результат = Результат + Сред(ТекстДляИндекса, Счетчик, 1) + " ";
		счетчик = счетчик + 1;
	КонецЦикла;
	
	Возврат СокрЛП(Результат);
	
КонецФункции
