//sza140710-2315  
&НаКлиенте
Процедура ПриЗакрытии()                                                  // ПРИ ЗАКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)                                             // ПРИ ОТКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщийМодульСервер.ОбеспечитьСписокОтборов(Список);
	
	Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьРегионыДляУчетаСтранАЛокацииГородов") Тогда
		Элементы.Наименование.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Наименование Областей");
		Элементы.ФормаВыбрать.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Выбрать Область");
		Элементы.ФормаСоздатьГруппу.Заголовок = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Добавить Область");
	КонецЕсли;
	
КонецПроцедуры
