//sza131104
//sza131003-1245 : 
&НаСервере
Процедура ПодготовитьМакетСТекстамиНаСервере(Знач Язык, ТабДок)
	
	Макет = РегистрыСведений.ТекстыНаДругихЯзыках.ПолучитьМакет("МакетЯзыка");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ТекстыНаДругихЯзыках.ТекстНаРусском,
		|	ТекстыНаДругихЯзыках.Язык,
		|	ТекстыНаДругихЯзыках.ТекстНаЯзыке
		|ИЗ РегистрСведений.ТекстыНаДругихЯзыках КАК ТекстыНаДругихЯзыках
		|ГДЕ ТекстыНаДругихЯзыках.Язык = &Язык";

	Запрос.УстановитьПараметр("Язык", Язык);

	РезультатЗапроса = Запрос.Выполнить();

	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");

	ТабДок.Очистить();
	ТабДок.НачатьАвтогруппировкуСтрок();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
		ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетальныеЗаписи.Уровень());
	КонецЦикла;

	ТабДок.ЗакончитьАвтогруппировкуСтрок();

КонецПроцедуры

&НаКлиенте
Процедура ПодготоитьМакетСТекстами(Команда)
	
	язык = Неопределено;
	
	Если ВвестиЗначение(язык, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите язык макета") + ": ", тип("СправочникСсылка.Языки")) Тогда
		ТабДок = Новый ТабличныйДокумент;
		ТабДок.ИмяПараметровПечати = "МЕКЕТНАЯЗЫКАХ";
		ТабДок.КлючПараметровПечати = ТабДок.ИмяПараметровПечати;
		
		ПодготовитьМакетСТекстамиНаСервере(язык, ТабДок);
		ТабДок.Показать();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()                                                  // ПРИ ЗАКРЫТИИ   		
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)                                             // ПРИ ОТКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Отказ Тогда
		ОбщийМодульСервер.ОбеспечитьСписокОтборов(Список);	
	КонецЕсли;
	
КонецПроцедуры
