//sza140118-2032 SZA: 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если код = 0 Тогда
		код = число(формат(ТекущаяДата(), "ДФ=ччммсс"));
	КонецЕсли;
	
	ЗаполнитьСообщениями();
	
КонецПроцедуры

Процедура ЗаполнитьСообщениями()
	
	СтруктураСообщений = параметры.СтруктураСообщений;
	Если НЕ СтруктураСообщений = Неопределено Тогда
		СЧ = 0;
		Для Каждого Сообщение Из СтруктураСообщений.МассивСообщений Цикл
			СтрокаСообщений = Сообщения.Добавить();
			СтрокаСообщений.Сообщение = Сообщение;
			МассивСсылокТ = СтруктураСообщений.МассивСсылокТ;
			СтрокаСообщений.Ссылка = МассивСсылокТ[СЧ];
			СЧ = СЧ + 1;
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СообщенияСообщениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Ссылка = Элементы.Сообщения.ТекущиеДанные.Ссылка;
	Если ЗначениеЗаполнено(Ссылка) Тогда 		
		ОткрытьЗначение(Элементы.Сообщения.ТекущиеДанные.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СообщенияСообщениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Ссылка = Элементы.Сообщения.ТекущиеДанные.Ссылка;
	Если ЗначениеЗаполнено(Ссылка) Тогда 		
		ОткрытьЗначение(Элементы.Сообщения.ТекущиеДанные.Ссылка);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура СообщенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Ссылка = Элементы.Сообщения.ТекущиеДанные.Ссылка;
	Если ЗначениеЗаполнено(Ссылка) Тогда 		
		ОткрытьЗначение(Элементы.Сообщения.ТекущиеДанные.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	ЗаполнитьСообщениями();
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	ЗаполнитьСообщениями();
КонецПроцедуры
