//sza140210-0154 
//sza140118-2032  
Процедура ЗаполнитьСообщениями()
	
	СтруктураСообщений = параметры.СтруктураСообщений;
	Если НЕ СтруктураСообщений = Неопределено Тогда
		СЧ = 0;
		Для Каждого Сообщение Из СтруктураСообщений.МассивСообщений Цикл
			
			МассивСсылокТ = СтруктураСообщений.МассивСсылокТ;
			Если Сообщение = "ПредложениеВосстановленияВаловойПрибыли" ТОгда
				ПредложениеВосстановленияВаловойПрибыли = ИСТИНА;
				СсылкаДата = МассивСсылокТ[СЧ].Дата;
				Ссылка     = МассивСсылокТ[СЧ];	
				
			Иначе				
				СтрокаСообщений = Сообщения.Добавить();
				СтрокаСообщений.Сообщение = Сообщение;
				СтрокаСообщений.Ссылка = МассивСсылокТ[СЧ];
				
			КонецЕсли;
			СЧ = СЧ + 1;
			ЧислоСообщений = ЧислоСообщений + 1;
			
		КонецЦикла;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура КонстантыДатаАктуальностиПоказателейВаловойПрибылиУстановить(Знач дата)
	Константы.ДатаАктуальностиПоказателейВаловойПрибыли.Установить(дата);			
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	ЗаполнитьСообщениями();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ПредложениеВосстановленияВаловойПрибыли Тогда
		Если Вопрос(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Восстановить актуальность показателей Валовой прибыли для номенклатуры этого документа?"), РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда			
			
			Состояние(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Восстановление показателей Валовой прибыли.."), , ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ждите.."));
			
			Если НЕ ОбщийМодульСервер.ВосстановитьАктуальностьПоказателейВаловойПрибылиДокумента(Ссылка, СсылкаДата) Тогда
				КонстантыДатаАктуальностиПоказателейВаловойПрибылиУстановить(СсылкаДата);	
			КонецЕсли;
			
		Иначе		
			КонстантыДатаАктуальностиПоказателейВаловойПрибылиУстановить(СсылкаДата);		
		КонецЕсли;
		
		Если ЧислоСообщений = 1 Тогда
			Закрыть();
		КонецЕсли;
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура ПриПовторномОткрытии()
	ЗаполнитьСообщениями();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если код = 0 Тогда
		код = число(формат(ТекущаяДата(), "ДФ=ччммсс"));
	КонецЕсли;
	
	ЗаполнитьСообщениями();
	
КонецПроцедуры

&НаКлиенте
Процедура СообщенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Ссылка = Элементы.Сообщения.ТекущиеДанные.Ссылка;
	Если ЗначениеЗаполнено(Ссылка) Тогда 		
		ОткрытьЗначение(Элементы.Сообщения.ТекущиеДанные.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СообщенияСообщениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Ссылка = Элементы.Сообщения.ТекущиеДанные.Ссылка;
	Если ЗначениеЗаполнено(Ссылка) Тогда 		
		ОткрытьЗначение(Элементы.Сообщения.ТекущиеДанные.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СообщенияСообщениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Ссылка = Элементы.Сообщения.ТекущиеДанные.Ссылка;
	Если ЗначениеЗаполнено(Ссылка) Тогда 		
		ОткрытьЗначение(Элементы.Сообщения.ТекущиеДанные.Ссылка);
	КонецЕсли;
	
КонецПроцедуры
