#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// sza160210-1706
Процедура НаПечать(ДокументДляПечати, Ссылка) Экспорт
	
	Макет = Справочники.ТекстыПрограмм.ПолучитьМакет("НаПечать");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТекстыПрограмм.ВерсияКонфигурацииПриСохранении,
	|	ТекстыПрограмм.ВерсияПлатформыПриСохранении,
	|	ТекстыПрограмм.ВыполняетсяНа,
	|	ТекстыПрограмм.ВыполняетсяНа2,
	|	ТекстыПрограмм.ВыполняетсяНа3,
	|	ТекстыПрограмм.ДатаНачала,
	|	ТекстыПрограмм.ДатаОкончания,
	|	ТекстыПрограмм.ДатаРазработки,
	|	ТекстыПрограмм.ДатаРедакции,
	|	ТекстыПрограмм.ДатаСоздания,
	|	ТекстыПрограмм.ИмяФайла,
	|	ТекстыПрограмм.Код,
	|	ВЫРАЗИТЬ(ТекстыПрограмм.Комментарий КАК СТРОКА(1000)) КАК Комментарий,
	|	ТекстыПрограмм.МаксимальнаяВерсияКонфигурации,
	|	ТекстыПрограмм.МаксимальнаяВерсияПлатформы,
	|	ТекстыПрограмм.МинимальнаяВерсияКонфигурации,
	|	ТекстыПрограмм.МинимальнаяВерсияПлатформы,
	|	ТекстыПрограмм.Наименование,
	|	ТекстыПрограмм.НеобходимаКонфигурацияВРаботе,
	|	ТекстыПрограмм.Ответственный,
	|	ТекстыПрограмм.ПолноеОписание,
	|	ТекстыПрограмм.Программист,
	|	ТекстыПрограмм.ТекстПрограммы,
	|	ТекстыПрограмм.ТекстПрограммы2,
	|	ТекстыПрограмм.ТекстПрограммы3,
	|	ТекстыПрограмм.УсловияВыполнения,
	|	ТекстыПрограмм.ЭтоУсловие,
	|	ТекстыПрограмм.ЗначенияДляПрограммы.(
	|		НомерСтроки,
	|		ИмяПеременнойПрограммы,
	|		ЗначениеПеременнойПрограммы,
	|		ОСтроке
	|	)
	|ИЗ Справочник.ТекстыПрограмм КАК ТекстыПрограмм
	|ГДЕ ТекстыПрограмм.Ссылка В (&Ссылка)";
	
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьЗначенияДляПрограммыШапка = Макет.ПолучитьОбласть("ЗначенияДляПрограммыШапка");
	ОбластьЗначенияДляПрограммы = Макет.ПолучитьОбласть("ЗначенияДляПрограммы");
	ДокументДляПечати.Очистить();
	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ДокументДляПечати.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ДокументДляПечати.Вывести(ОбластьЗаголовок);
		Шапка.Параметры.Заполнить(Выборка);
		ДокументДляПечати.Вывести(Шапка, Выборка.Уровень());
		ДокументДляПечати.Вывести(ОбластьЗначенияДляПрограммыШапка);
		ВыборкаЗначенияДляПрограммы = Выборка.ЗначенияДляПрограммы.Выбрать();
		Пока ВыборкаЗначенияДляПрограммы.Следующий() Цикл
			ОбластьЗначенияДляПрограммы.Параметры.Заполнить(ВыборкаЗначенияДляПрограммы);
			ДокументДляПечати.Вывести(ОбластьЗначенияДляПрограммы, ВыборкаЗначенияДляПрограммы.Уровень());
		КонецЦикла;
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли