// sza140411-1606 :
// sza101109-1806
// sza101109-0025
// sza101020

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("002700", , , );

	Если НЕ Отказ Тогда
		ОбщийМодульКлиент.ДобавитьСобытиеЖурнала(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Загрузил таблицу документа из файла"), 2, ПараметрКоманды);
		ПодсистемаИЭКлиент.ИмпортЭкспортОбработкаОбмена(
		ПодсистемаИЭКлиент.СоздатьСтруктуруВызоваИмпЭкспОперации(ПараметрКоманды, , ЛОЖЬ, , "К")
		); // Экспорт  (ИСТИНА) /Импорт (ЛОЖЬ), К/С/З - карточка, список, Товары
	КонецЕсли;

КонецПроцедуры
