// sza141028-2254 :

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	Процедура ПередЗаписью(Отказ)

		Если НЕ ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("МассоваяЗагрузка", ИСТИНА) Тогда
			Если ОбменДанными.Загрузка Тогда
				Возврат;
			КонецЕсли;

			Если ПометкаУдаления Тогда
				Если МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента() = Ссылка Тогда
					МенеджерОборудованияВызовСервера.УстановитьРабочееМестоКлиента(ПредопределенноеЗначение("Справочник.РабочиеМеста.ПустаяСсылка"));
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;

	КонецПроцедуры

	Процедура ПриЗаписи(Отказ)

		Если ОбменДанными.Загрузка Тогда
			Возврат;
		КонецЕсли;

	КонецПроцедуры

#КонецЕсли
Процедура ПриКопировании(ОбъектКопирования)

	ТекущийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	Наименование = ?(ПустаяСтрока(Строка(Код)), "Рабочее место", Строка(Код))
	+ ?(ПустаяСтрока(Строка(Код)), ": ", "/")
	+ ?(ПустаяСтрока(Строка(ТекущийПользователь)), "Пользователь", Строка(ТекущийПользователь));

	Запрос = Новый Запрос("ВЫБРАТЬ
	|    КОЛИЧЕСТВО(*) КАК Количество
	|ИЗ Справочник.РабочиеМеста КАК РабочиеМеста
	|ГДЕ РабочиеМеста.Наименование ПОДОБНО &Наименование
	|    И РабочиеМеста.Ссылка <> &Ссылка
	|");
	Запрос.УстановитьПараметр("Наименование", "%" + Наименование + "%");
	Запрос.УстановитьПараметр("Ссылка"      , Ссылка);

	Количество = Запрос.Выполнить().Выгрузить()[0].Количество;

	Если Количество > 0 Тогда
		Наименование = Наименование + " (" + Строка(Количество + 1) + ")";
	КонецЕсли;

КонецПроцедуры
