//sza131117-0253
//sza131003-2249 : 

Процедура Печать(ТабДок, Ссылка) Экспорт
	
	Макет = Документы.ПланыПродаж.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПланыПродаж.Дата,
	|	ПланыПродаж.ДатаНачала,
	|	ПланыПродаж.ДатаОкончания,
	|	ПланыПродаж.ДатаРедакции,
	|	ПланыПродаж.Комментарий,
	|	ПланыПродаж.Номер,
	|	ПланыПродаж.Ответственный,
	|	ПланыПродаж.ПланНеАктуален,
	|	ПланыПродаж.ТовараВКоличестве,
	|	ПланыПродаж.ТовараНаСумму,
	|	ПланыПродаж.Товары.(
	|		НомерСтроки,
	|		НоменклатураИлиГруппа,
	|		Количество,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.ПланыПродаж КАК ПланыПродаж
	|ГДЕ
	|	ПланыПродаж.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка 			 = Макет.ПолучитьОбласть("Шапка");
	ОбластьТоварыШапка = Макет.ПолучитьОбласть("ТоварыШапка");
	ОбластьТовары 	 = Макет.ПолучитьОбласть("Товары");
	Подвал 			 = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьТоварыШапка);
		ВыборкаТовары = Выборка.Товары.Выбрать();
		Пока ВыборкаТовары.Следующий() Цикл
			ОбластьТовары.Параметры.Заполнить(ВыборкаТовары);
			ТабДок.Вывести(ОбластьТовары, ВыборкаТовары.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		Подвал.Параметры.валюта = ОбщийМодульПовтор.ЗначениеПредопределенного("Справочники.Валюты.ОсновнаяВалюта");
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	
КонецПроцедуры
