//sza140119-0200
//sza131003-0226 : 
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступленияТовара") Тогда
			Комментарий = ДанныеЗаполнения.Комментарий;
			Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
				НоваяСтрока = Товары.Добавить();
				НоваяСтрока.Количество 				= ТекСтрокаТовары.Количество;
				НоваяСтрока.НоменклатураИлиГруппа 	= ТекСтрокаТовары.Номенклатура;
			КонецЦикла;
			
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.УстановкиЦен") Тогда
			Комментарий = ДанныеЗаполнения.Комментарий;
			Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
				НоваяСтрока = Товары.Добавить();
				НоваяСтрока.НоменклатураИлиГруппа = ТекСтрокаТовары.Номенклатура;
			КонецЦикла;
			
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Инвентаризации") Тогда
			Комментарий = ДанныеЗаполнения.Комментарий;
			Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
				НоваяСтрока = Товары.Добавить();
				НоваяСтрока.Количество 				= ТекСтрокаТовары.КоличествоПоФакту;
				НоваяСтрока.НоменклатураИлиГруппа 	= ТекСтрокаТовары.Номенклатура;
			КонецЦикла;
			
		ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПланыПродаж") Тогда
			ДатаНачала 		= НачалоДня(ДанныеЗаполнения.ДатаОкончания + 3600*24 + 1);
			ДатаОкончания 	= ДатаНачала + (ДанныеЗаполнения.ДатаОкончания - ДанныеЗаполнения.ДатаНачала);
			Комментарий 	= ДанныеЗаполнения.Комментарий;
			ПланНеАктуален 	= ДанныеЗаполнения.ПланНеАктуален;
			
			Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
				НоваяСтрока = Товары.Добавить();
				НоваяСтрока.Количество 				= ТекСтрокаТовары.Количество;
				НоваяСтрока.НоменклатураИлиГруппа 	= ТекСтрокаТовары.НоменклатураИлиГруппа;
				НоваяСтрока.Сумма 					= ТекСтрокаТовары.Сумма;
			КонецЦикла;
			
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	МассивПустыхСтрок  = Новый массив;
	массивноменклатуры = Новый массив;
	
	Для Каждого СтрокаТовары из товары цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТовары.НоменклатураИлиГруппа) Тогда
			МассивПустыхСтрок.Добавить(СтрокаТовары);
			
		Иначеесли не массивноменклатуры.Найти(СтрокаТовары.НоменклатураИлиГруппа) = Неопределено тогда
			Если ОбщийМодульПовторВТеченииСервера.ВыводитьСообщенияМожно() Тогда
				//Сообщение = Новый СообщениеПользователю;
				//Сообщение.Текст = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("На строке №") + " " + СтрокаТовары.НомерСтроки + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке(" повторяется номенклатура:" + СтрокаТовары.НоменклатураИлиГруппа);
				//Сообщение.Сообщить();
				ОбщийМодульСервисСервер.ДобавитьСообщениеПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("На строке №") + " " + СтрокаТовары.НомерСтроки + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке(" повторяется номенклатура:" + СтрокаТовары.НоменклатураИлиГруппа), , Ссылка);
			КонецЕсли;
		Иначе
			массивноменклатуры.Добавить(СтрокаТовары.НоменклатураИлиГруппа);
			
		КонецЕсли;                                    	
	КонецЦикла;
	
	Для Каждого СтрокаТовары из МассивПустыхСтрок цикл
		товары.Удалить(СтрокаТовары);	
	КонецЦикла;	
	
	Попытка //ЭтотОбъект
		ОбщийМодульТоварСервер.ПроверитьИСортироватьТаблицуТовары(ЭтотОбъект, ИСТИНА);
	Исключение 
	КонецПопытки;
	
	ТовараВКоличестве = товары.итог("Количество");
	ТовараНаСумму 	  = товары.Итог("Сумма");
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Комментарий = "";
КонецПроцедуры
