//sza131029-1659  

&НаКлиенте
Процедура ПриОткрытии(Отказ)                                                                    // ПРИ ОТКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0, Запись.Ответственный, истина);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()                                                  // ПРИ ЗАКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОбновитьПовторноИспользуемыеЗначения();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)          // ПРИ СОЗДАНИИ НА СЕРВЕРЕ
	
	Если Запись.Позиция = 0 Тогда
		Запись.Позиция = ПолучитьСледующуюПозицию();		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция   ПолучитьСледующуюПозицию()
	
	результат = 0;
	
	Для позиция = 1 по 99 цикл 
		если нетпозиции(позиция) тогда
			результат = позиция;
			прервать;	
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции //ПолучитьСледующуюПозици()

Функция   нетпозиции(позиция)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НоменклатураЧастогоСпроса.Номенклатура
	|ИЗ
	|	РегистрСведений.НоменклатураЧастогоСпроса КАК НоменклатураЧастогоСпроса
	|ГДЕ
	|	НоменклатураЧастогоСпроса.Позиция = &Позиция";
	
	Запрос.УстановитьПараметр("Позиция", Позиция);
	
	Если  Запрос.Выполнить().Пустой() тогда
		возврат истина;
	иначе
		возврат ложь;
	КонецЕсли;
	
КонецФункции //нетпозиции

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	глЧислоОбъектов = глЧислоОбъектов + 1; глПроверятьСообщения = Истина;
КонецПроцедуры
