// sza140420-2100
// sza131003-1913 

&НаКлиенте
Процедура ПриЗакрытии()
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)          // ПРИ СОЗДАНИИ НА СЕРВЕРЕ
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("002700", ЭтаФорма, Отказ, );	
	
	Если НЕ Отказ Тогда
		Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьСобственныйПереводЭлементовИнтерфейса") Тогда
			ОбщийМодульСервер.ПеревестиРеквизитыФормы(ЭтаФорма);	
		КонецЕсли;
		
	// // создаем реквизиты
	ДобавляемыеРеквизиты = Новый Массив;
	// 	
	// // 	Элементы.Вставить("ТаблицаОбмена", Тип("ТаблицаФормы"));
	
	Если ЗначениеЗаполнено(Параметры.таблицаОбмена) Тогда
		Для Каждого Колонка Из Параметры.таблицаОбмена.Колонки Цикл
			КолонкаИмя = СокрЛП(Колонка.Имя);
			
			Если НЕ КолонкаИмя = "Обрабатывать" Тогда
				НовыйРеквизитФормы = Новый РеквизитФормы("" + КолонкаИмя, Новый ОписаниеТипов("Строка"), "ТаблицаОбмена", КолонкаИмя);
				ДобавляемыеРеквизиты.Добавить(НовыйРеквизитФормы);	
			КонецЕсли;
			
		КонецЦикла;
		
		ИзменитьРеквизиты(ДобавляемыеРеквизиты);
		
		Для Каждого Колонка Из Параметры.таблицаОбмена.Колонки Цикл
			КолонкаИмя = СокрЛП(Колонка.Имя);
			
			Если НЕ КолонкаИмя = "Обрабатывать" Тогда
				Элемент = Элементы.Добавить(КолонкаИмя, Тип("ПолеФормы"), Элементы.ТаблицаОбменаЭл); 
				Элемент.Вид = ВидПоляФормы.ПолеВвода;
				
				Элемент.ПутьКДанным = "ТаблицаОбмена." + КолонкаИмя;	
				Если НЕ Найти(Колонка.заголовок, "SPTSZN") = 0 Тогда
					Элемент.Видимость = ЛОЖЬ;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
		ЗначениеВРеквизитФормы(Параметры.ТаблицаОбмена, "ТаблицаОбмена");
		
	КонецЕсли;	
			  КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьИВыгрузить(Команда)
	
	ЭтаФорма.Закрыть(ТаблицаОбмена);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОбрабатыватьВсе(Команда)
	
	Для Каждого СтрокаТаблицыОбмена Из ТаблицаОбмена Цикл
		СтрокаТаблицыОбмена.Обрабатывать = ИСТИНА;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОбрабатыватьНичего(Команда)
	
	Для Каждого СтрокаТаблицыОбмена Из ТаблицаОбмена Цикл
		СтрокаТаблицыОбмена.Обрабатывать = ЛОЖЬ;
	КонецЦикла;
	
КонецПроцедуры
