// sza131227-1532  
&НаКлиенте
Процедура ПриЗакрытии()
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)          // ПРИ СОЗДАНИИ НА СЕРВЕРЕ

	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест"
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;

		Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьСобственныйПереводЭлементовИнтерфейса") Тогда
			ОбщийМодульСервер.ПеревестиРеквизитыФормы(ЭтаФорма);	
		КонецЕсли;
		
	Если Запись.РабочееМесто = Справочники.РабочиеМеста.ПустаяСсылка() Тогда
		Запись.РабочееМесто = ПараметрыСеанса.РабочееМестоКлиента;
	КонецЕсли;

КонецПроцедуры

// // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // /
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
&НаСервере
Функция РабочееМестоУстройства(Устройство)

	Возврат Устройство.РабочееМесто;

КонецФункции

// // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // // /
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ
&НаКлиенте
Процедура УстройствоОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	Если РабочееМестоУстройства(ВыбранноеЗначение) = Запись.РабочееМесто Тогда
		СтандартнаяОбработка = ЛОЖЬ;
		ТекстСообщения = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Выбранное устройство уже привязано к данному рабочему месту") + "!
		                            |" + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите удаленное устройство для использования по сети");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , );
	КонецЕсли;

КонецПроцедуры
