// sza140420-1548
// sza131018-0133 :

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("000310", , , );

	Если НЕ Отказ Тогда
		ПараметрыФормы = Новый Структура("", );
		ОткрытьФорму("Документ.Инвентаризации.ФормаСписка", ПараметрыФормы);// , ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);// , ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	КонецЕсли;

КонецПроцедуры
