//sza140606-0044 SZA: 
//sza130909-0324 : 

&НаКлиенте
Процедура ОтборПоКлиентуПриИзменении(Элемент)
	ОтборПоКлиентуПриИзмененииНаСервере();
КонецПроцедуры

Процедура ОтборПоКлиентуПриИзмененииНаСервере()
	
	список.Параметры.УстановитьЗначениеПараметра("Клиент", ОтборПоКлиенту);
	список.Параметры.УстановитьЗначениеПараметра("Организация", ОтборПоОрганизации);
	список.Параметры.УстановитьЗначениеПараметра("НеИспользоватьОтборПоОрганизации", НЕ ОбщийМодульПовтор.ПолучитьПараметрСеанса("ВестиУчетСобственныхЮридическихЛицПС") ИЛИ НЕ ЗначениеЗаполнено(ОтборПоОрганизации));
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)                                            // ПРИ ОТКРЫТИИ	
	
	Если ЗначениеЗаполнено(Параметры.Клиент) Тогда
		ОтборПоКлиенту = Параметры.Клиент;
	КонецЕсли;
	
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
	
	Если НЕ ЗначениеЗаполнено(ОтборПоКлиенту) Тогда
		ОтборПоКлиенту = ПолучитьКлиентапоУмолчанию();
	КонецЕсли;
	ОтборПоКлиентуПриИзмененииНаСервере();
	
КонецПроцедуры

&НаСервере
Функция   ПолучитьКлиентаПоУмолчанию()
	
	РезультатПолучитьКлиентаПоУмолчанию = ОбщийМодульПовтор.получитьЗначениеНастройкиИлиКонстанты("КлиентПоУмолчанию");
	
	Возврат РезультатПолучитьКлиентаПоУмолчанию;
	
КонецФункции //ПолучитьКлиентаПоУмолчанию

&НаКлиенте
Процедура ПриЗакрытии()                                                 // ПРИ ЗАКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоКлиентуОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	ОбщийМодульКлиент.ПоискОшибкиКодировки("Клиенты", ДанныеВыбора, Текст, ОтборПоКлиенту);
	ОтборПоКлиентуПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоОрганизацииПриИзменении(Элемент)
	ОтборПоКлиентуПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("000607", ЭтаФорма, Отказ, );	
	
	Если НЕ Отказ Тогда
		ОбщийМодульСервисСервер.ОформитьФорматКоличества(Элементы.Количество, , Истина);	
		ОбщийМодульСервер.ОбеспечитьСписокОтборов(Список);
	КонецЕсли;

КонецПроцедуры
