// sza150208-1722 фикс
// sza131117-0209
&НаСервере
Процедура ВыгрузитьНаСервере(АдресФайла, ПараметрКоманды)
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ВЫГР" + СокрЛП(ИмяКомпьютера());
	ТабДок.КлючПараметровПечати = ТабДок.ИмяПараметровПечати;
	
	ТипЗнчДокументссылка= ТипЗнч(ПараметрКоманды.ссылка);
	ПеремещенияТовара 	= ТипЗнчДокументссылка = Тип("ДокументСсылка.ПеремещенияТовара");
	Инвентаризации		= ТипЗнчДокументссылка = Тип("ДокументСсылка.Инвентаризации");
	ПоступленияТовара 	= ТипЗнчДокументссылка = Тип("ДокументСсылка.ПоступленияТовара");
	РасходыТовара 		= ТипЗнчДокументссылка = Тип("ДокументСсылка.РасходыТовара");
	УстановкиЦен 		= ТипЗнчДокументссылка = Тип("ДокументСсылка.УстановкиЦен");
	ПланыПродаж 		= ТипЗнчДокументссылка = Тип("ДокументСсылка.ПланыПродаж");
	Договора 			= ТипЗнчДокументссылка = Тип("СправочникСсылка.Договора");
	УстановкиЦен 		= ТипЗнчДокументссылка = Тип("ДокументСсылка.УстановкиЦен");
	ОтчетыКомиссионеров	= ТипЗнчДокументссылка = Тип("ДокументСсылка.ОтчетыКомиссионеров");
	КорректировкиИРегистрацияОстатков = ТипЗнчДокументссылка = Тип("ДокументСсылка.КорректировкиИРегистрацияОстатков");
	
	ИспользоватьЕдиницыИзмеренияНоменклатуры = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьЕдиницыИзмеренияНоменклатуры");
	ВестиУчетСерийНоменклатуры = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетСерийНоменклатуры");
	
	СчетчикСтрок = 1;
	Для Каждого СтрокаТовары Из ПараметрКоманды.Товары Цикл
		
		Если ПланыПродаж Тогда
			Номенклатура = СтрокаТовары.НоменклатураИлиГруппа;
		Иначе
			Номенклатура = ?(ЗначениеЗаполнено(СтрокаТовары.Номенклатура.НаименованиеДляПечати), СтрокаТовары.Номенклатура.НаименованиеДляПечати, СтрокаТовары.Номенклатура.Наименование);	
		КонецЕсли;
		
		СчетчикСтрокиТекст = формат(СчетчикСтрок, "ЧЦ=15; ЧДЦ=; ЧРГ=' '; ЧН=Ноль; ЧГ=0");
		
		Если Договора Тогда
			Табдок.Область("R" + СчетчикСтрокиТекст + "C1").Текст = Номенклатура;
			Табдок.Область("R" + СчетчикСтрокиТекст + "C2").Текст = СтрокаТовары.Цена ;
			Табдок.Область("R" + СчетчикСтрокиТекст + "C3").Текст = СтрокаТовары.Коментарий;
			Если ИспользоватьЕдиницыИзмеренияНоменклатуры Тогда
				Табдок.Область("R" + СчетчикСтрокиТекст + "C4").Текст = СтрокаТовары.ЕдиницаИзмерения;
			КонецЕсли;
			
		Иначеесли Инвентаризации Тогда
			Табдок.Область("R" + СчетчикСтрокиТекст + "C1").Текст = Номенклатура;
			Табдок.Область("R" + СчетчикСтрокиТекст + "C2").Текст = СтрокаТовары.КоличествоУчет ;
			Табдок.Область("R" + СчетчикСтрокиТекст + "C3").Текст = СтрокаТовары.КоличествоПоФакту;
			Табдок.Область("R" + СчетчикСтрокиТекст + "C4").Текст = СтрокаТовары.КоличествоРазница ;
			Табдок.Область("R" + СчетчикСтрокиТекст + "C5").Текст = СтрокаТовары.Цена;
			Табдок.Область("R" + СчетчикСтрокиТекст + "C6").Текст = СтрокаТовары.СуммаУчет;
			Табдок.Область("R" + СчетчикСтрокиТекст + "C7").Текст = СтрокаТовары.СуммаПоФакту;
			Табдок.Область("R" + СчетчикСтрокиТекст + "C8").Текст = СтрокаТовары.СуммаРазница;
			Табдок.Область("R" + СчетчикСтрокиТекст + "C9").Текст = СтрокаТовары.Коментарий;
			Если ВестиУчетСерийНоменклатуры Тогда
				Табдок.Область("R" + СчетчикСтрокиТекст + "C10").Текст = СтрокаТовары.СерияНоменклатуры;
			КонецЕсли;
			
		Иначеесли КорректировкиИРегистрацияОстатков Тогда
			Табдок.Область("R" + СчетчикСтрокиТекст + "C1").Текст = Номенклатура;
			Табдок.Область("R" + СчетчикСтрокиТекст + "C2").Текст = СтрокаТовары.Склад;
			Табдок.Область("R" + СчетчикСтрокиТекст + "C3").Текст = СтрокаТовары.Номенклатура;
			Табдок.Область("R" + СчетчикСтрокиТекст + "C4").Текст = СтрокаТовары.Количество ;
			Табдок.Область("R" + СчетчикСтрокиТекст + "C5").Текст = СтрокаТовары.Цена;
			Табдок.Область("R" + СчетчикСтрокиТекст + "C6").Текст = СтрокаТовары.Сумма;
			Табдок.Область("R" + СчетчикСтрокиТекст + "C7").Текст = СтрокаТовары.ОСтроке;
			Если ИспользоватьЕдиницыИзмеренияНоменклатуры Тогда
				Табдок.Область("R" + СчетчикСтрокиТекст + "C8").Текст = СтрокаТовары.ЕдиницаИзмерения;
			КонецЕсли;
			Если ВестиУчетСерийНоменклатуры Тогда
				Табдок.Область("R" + СчетчикСтрокиТекст + "C9").Текст = СтрокаТовары.СерияНоменклатуры;
			КонецЕсли;
			
		Иначеесли ПеремещенияТовара Тогда	
			Табдок.Область("R" + СчетчикСтрокиТекст + "C1").Текст = Номенклатура;
			Табдок.Область("R" + СчетчикСтрокиТекст + "C2").Текст = СтрокаТовары.Количество;
			Табдок.Область("R" + СчетчикСтрокиТекст + "C3").Текст = СтрокаТовары.Цена;
			Табдок.Область("R" + СчетчикСтрокиТекст + "C4").Текст = СтрокаТовары.Сумма;
			Табдок.Область("R" + СчетчикСтрокиТекст + "C5").Текст = СтрокаТовары.ОСтроке;
			Если ИспользоватьЕдиницыИзмеренияНоменклатуры Тогда
				Табдок.Область("R" + СчетчикСтрокиТекст + "C6").Текст = СтрокаТовары.ЕдиницаИзмерения;
			КонецЕсли;
			Если ВестиУчетСерийНоменклатуры Тогда
				Табдок.Область("R" + СчетчикСтрокиТекст + "C7").Текст = СтрокаТовары.СерияНоменклатуры;
			КонецЕсли;
			
		Иначеесли ПланыПродаж тогда	          
			Табдок.Область("R" + СчетчикСтрокиТекст + "C1").Текст = Номенклатура;
			Табдок.Область("R" + СчетчикСтрокиТекст + "C2").Текст = СтрокаТовары.Количество;
			Табдок.Область("R" + СчетчикСтрокиТекст + "C3").Текст = СтрокаТовары.Сумма;
			Табдок.Область("R" + СчетчикСтрокиТекст + "C4").Текст = СтрокаТовары.ОСтроке;
			
		Иначеесли ПоступленияТовара тогда	          
			Табдок.Область("R" + СчетчикСтрокиТекст + "C1").Текст = Номенклатура    ;
			Табдок.Область("R" + СчетчикСтрокиТекст + "C2").Текст = СтрокаТовары.Количество;
			Табдок.Область("R" + СчетчикСтрокиТекст + "C3").Текст = СтрокаТовары.Цена;
			Табдок.Область("R" + СчетчикСтрокиТекст + "C4").Текст = СтрокаТовары.Сумма;
			Табдок.Область("R" + СчетчикСтрокиТекст + "C5").Текст = СтрокаТовары.ОСтроке;
			Если ИспользоватьЕдиницыИзмеренияНоменклатуры Тогда
				Табдок.Область("R" + СчетчикСтрокиТекст + "C6").Текст = СтрокаТовары.ЕдиницаИзмерения;
			КонецЕсли;
			Если ВестиУчетСерийНоменклатуры Тогда
				Табдок.Область("R" + СчетчикСтрокиТекст + "C7").Текст = СтрокаТовары.СерияНоменклатуры;
			КонецЕсли;
			
		Иначеесли РасходыТовара Тогда	          
			Табдок.Область("R" + СчетчикСтрокиТекст + "C1").Текст = Номенклатура     ;
			Табдок.Область("R" + СчетчикСтрокиТекст + "C2").Текст = СтрокаТовары.Количество;
			Табдок.Область("R" + СчетчикСтрокиТекст + "C3").Текст = СтрокаТовары.Цена;
			Табдок.Область("R" + СчетчикСтрокиТекст + "C4").Текст = СтрокаТовары.Сумма;
			Табдок.Область("R" + СчетчикСтрокиТекст + "C5").Текст = СтрокаТовары.ПроцентСкидки;
			Табдок.Область("R" + СчетчикСтрокиТекст + "C6").Текст = СтрокаТовары.СуммаБезСкидки;
			Табдок.Область("R" + СчетчикСтрокиТекст + "C7").Текст = СтрокаТовары.ОСтроке;
			Если ИспользоватьЕдиницыИзмеренияНоменклатуры Тогда
				Табдок.Область("R" + СчетчикСтрокиТекст + "C8").Текст = СтрокаТовары.ЕдиницаИзмерения;
			КонецЕсли;
			Если ВестиУчетСерийНоменклатуры Тогда
				Табдок.Область("R" + СчетчикСтрокиТекст + "C9").Текст = СтрокаТовары.СерияНоменклатуры;
			КонецЕсли;
			
		Иначеесли УстановкиЦен Тогда	          
			Табдок.Область("R" + СчетчикСтрокиТекст + "C1").Текст = Номенклатура  ;
			Табдок.Область("R" + СчетчикСтрокиТекст + "C2").Текст = СтрокаТовары.СтараяЦена;
			Табдок.Область("R" + СчетчикСтрокиТекст + "C3").Текст = СтрокаТовары.Цена;
			Табдок.Область("R" + СчетчикСтрокиТекст + "C4").Текст = СтрокаТовары.РазницаЦены;
			Табдок.Область("R" + СчетчикСтрокиТекст + "C5").Текст = СтрокаТовары.Коментарий;
			Если ИспользоватьЕдиницыИзмеренияНоменклатуры Тогда
				Табдок.Область("R" + СчетчикСтрокиТекст + "C6").Текст = СтрокаТовары.ЕдиницаИзмерения;
			КонецЕсли;
			
		ИначеЕсли ОтчетыКомиссионеров Тогда
			Табдок.Область("R" + СчетчикСтрокиТекст + "C1").Текст = Номенклатура  ;
			Табдок.Область("R" + СчетчикСтрокиТекст + "C2").Текст = СтрокаТовары.Количество;
			Табдок.Область("R" + СчетчикСтрокиТекст + "C3").Текст = СтрокаТовары.Цена;
			Табдок.Область("R" + СчетчикСтрокиТекст + "C4").Текст = СтрокаТовары.Сумма;
			Табдок.Область("R" + СчетчикСтрокиТекст + "C5").Текст = СтрокаТовары.ЧастныйПроцентКомиссионногоВознаграждения;
			Табдок.Область("R" + СчетчикСтрокиТекст + "C6").Текст = СтрокаТовары.СуммаКомиссионногоВознаграждения;
			Табдок.Область("R" + СчетчикСтрокиТекст + "C7").Текст = СтрокаТовары.ОСтроке;
			Если ИспользоватьЕдиницыИзмеренияНоменклатуры Тогда
				Табдок.Область("R" + СчетчикСтрокиТекст + "C8").Текст = СтрокаТовары.ЕдиницаИзмерения;
			КонецЕсли;
			Если ВестиУчетСерийНоменклатуры Тогда
				Табдок.Область("R" + СчетчикСтрокиТекст + "C9").Текст = СтрокаТовары.СерияНоменклатуры;
			КонецЕсли;
			
		КонецЕсли;
		СчетчикСтрок = СчетчикСтрок + 1;
	КонецЦикла;	
	
	Табдок.Записать(АдресФайла, ТипФайлаТабличногоДокумента.XLS97);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("002700", , , );	
	
	Если НЕ Отказ Тогда
		АдресФайла = ПолучитьОтносительныйАдресНаСервере();
		
		ДиалогФильтр	 = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Файл Excel") + " (*.xls)|*.xls";
		ДиалогРасширение = "xls";
		ДиалогВыбФайла 	 = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
		ДиалогВыбФайла.Заголовок				=	ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите имя файла Excel");
		ДиалогВыбФайла.ПолноеИмяФайла			=	"";
		ДиалогВыбФайла.Фильтр					=	ДиалогФильтр;
		ДиалогВыбФайла.Расширение				=	ДиалогРасширение;
		ДиалогВыбФайла.МножественныйВыбор		=	ЛОЖЬ;
		ДиалогВыбФайла.ПредварительныйПросмотр	=	ЛОЖЬ;
		ДиалогВыбФайла.ИндексФильтра			=	0;
		
		ДиалогВыбФайла.Показать(Новый ОписаниеОповещения("ОбработкаКомандыЗавершение", ЭтотОбъект, Новый Структура("ДиалогВыбФайла, ПараметрКоманды", ДиалогВыбФайла, ПараметрКоманды))); 	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКомандыЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	ДиалогВыбФайла  = ДополнительныеПараметры.ДиалогВыбФайла;
	ПараметрКоманды = ДополнительныеПараметры.ПараметрКоманды;	
	
	Если (ВыбранныеФайлы <> Неопределено) Тогда
		АдресФайла = ДиалогВыбФайла.ПолноеИмяФайла;
		Состояние(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Идет Выгрузка данных.."), , ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ждите.."));
		
		ВыгрузитьНаСервере(АдресФайла, ПараметрКоманды);
		
		ОбщийМодульСервер.ДобавитьСобытиеЖурналаНаСервере(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Выгрузил данные в файл") + ": " + АдресФайла, 2);
	КонецЕсли;

КонецПроцедуры

&насервере
функция   ПолучитьОтносительныйАдресНаСервере();
	Возврат Константы.ПодсистемаИЭИмпортЭкспортОтносительныйАдресФайлов.Получить();
КонецФункции
