// sza150208-1722 фикс
// sza131117-0209

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("002700", , , );	
	
	Если НЕ Отказ Тогда
		АдресФайла = ПолучитьОтносительныйАдресНаСервере();
		
		ДиалогФильтр	 = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Файл Excel") + " (*.xls)|*.xls";
		ДиалогРасширение = "xls";
		ДиалогДляВыбораФайла 	 = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
		ДиалогДляВыбораФайла.Заголовок				=	ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите имя файла Excel");
		ДиалогДляВыбораФайла.ПолноеИмяФайла			=	"";
		ДиалогДляВыбораФайла.Фильтр					=	ДиалогФильтр;
		ДиалогДляВыбораФайла.Расширение				=	ДиалогРасширение;
		ДиалогДляВыбораФайла.МножественныйВыбор		=	ЛОЖЬ;
		ДиалогДляВыбораФайла.ПредварительныйПросмотр	=	ЛОЖЬ;
		ДиалогДляВыбораФайла.ИндексФильтра			=	0;
		
		ДиалогДляВыбораФайла.Показать(Новый ОписаниеОповещения("ОбработкаКомандыЗавершение", ЭтотОбъект, Новый Структура("ДиалогДляВыбораФайла, ПараметрКоманды", ДиалогДляВыбораФайла, ПараметрКоманды))); 	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКомандыЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	ДиалогДляВыбораФайла  = ДополнительныеПараметры.ДиалогДляВыбораФайла;
	ПараметрКоманды = ДополнительныеПараметры.ПараметрКоманды;	
	
	Если (ВыбранныеФайлы <> Неопределено) Тогда
		АдресФайла = ДиалогДляВыбораФайла.ПолноеИмяФайла;
		Состояние(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Идет Выгрузка данных.."), , ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ждите.."));
		
		ВыгрузитьНаСервере(АдресФайла, ПараметрКоманды);
		
		ОбщийМодульСервер.ДобавитьСобытиеЖурналаНаСервере(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Выгрузил данные в файл") + ": " + АдресФайла, 2);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьНаСервере(АдресФайла, ПараметрКоманды)
	
	ДокументДляПечати = Новый ТабличныйДокумент;
	ДокументДляПечати.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ВЫГР" + СокрЛП(ИмяКомпьютера());
	ДокументДляПечати.КлючПараметровПечати = ДокументДляПечати.ИмяПараметровПечати;
	
	ТипЗнчДокументСсылка= ТипЗнч(ПараметрКоманды.ссылка);

	ПеремещенияТовара 	= ТипЗнчДокументСсылка = Тип("ДокументСсылка.ПеремещенияТовара");
	Инвентаризации		= ТипЗнчДокументСсылка = Тип("ДокументСсылка.Инвентаризации");
	ПоступленияТовара 	= ТипЗнчДокументСсылка = Тип("ДокументСсылка.ПоступленияТовара");
	РасходыТовара 		= ТипЗнчДокументСсылка = Тип("ДокументСсылка.РасходыТовара");
	УстановкиЦен 		= ТипЗнчДокументСсылка = Тип("ДокументСсылка.УстановкиЦен");
	ПланыПродаж 		= ТипЗнчДокументСсылка = Тип("ДокументСсылка.ПланыПродаж");
	Договора 			= ТипЗнчДокументСсылка = Тип("СправочникСсылка.Договора");
	УстановкиЦен 		= ТипЗнчДокументСсылка = Тип("ДокументСсылка.УстановкиЦен");
	ОтчетыКомиссионеров	= ТипЗнчДокументСсылка = Тип("ДокументСсылка.ОтчетыКомиссионеров");
	КорректировкиИРегистрацияОстатков = ТипЗнчДокументСсылка = Тип("ДокументСсылка.КорректировкиИРегистрацияОстатков");
	
	ИспользоватьЕдиницыИзмеренияНоменклатуры = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьЕдиницыИзмеренияНоменклатуры");
	ВестиУчетСерийНоменклатуры = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ВестиУчетСерийНоменклатуры");
	
	СчетчикСтрок = 1;
	Для Каждого СтрокаТовары Из ПараметрКоманды.Товары Цикл
		
		Если ПланыПродаж Тогда
			Номенклатура = СтрокаТовары.НоменклатураИлиГруппа;
		Иначе
			Номенклатура = ?(ЗначениеЗаполнено(СтрокаТовары.Номенклатура.НаименованиеДляПечати), СтрокаТовары.Номенклатура.НаименованиеДляПечати, СтрокаТовары.Номенклатура.Наименование);	
		КонецЕсли;
		
		СчетчикСтрокиТекст = формат(СчетчикСтрок, "ЧЦ=15; ЧДЦ=; ЧРГ=' '; ЧН=Ноль; ЧГ=0");
		
		Если Договора Тогда
			ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C1").Текст = Номенклатура;
			ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C2").Текст = СтрокаТовары.Цена ;
			ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C3").Текст = СтрокаТовары.Комментарий;
			Если ИспользоватьЕдиницыИзмеренияНоменклатуры Тогда
				ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C4").Текст = СтрокаТовары.ЕдиницаИзмерения;
			КонецЕсли;
			
		ИначеЕсли Инвентаризации Тогда
			ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C1").Текст = Номенклатура;
			ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C2").Текст = СтрокаТовары.КоличествоУчет ;
			ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C3").Текст = СтрокаТовары.КоличествоПоФакту;
			ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C4").Текст = СтрокаТовары.КоличествоРазница ;
			ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C5").Текст = СтрокаТовары.Цена;
			ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C6").Текст = СтрокаТовары.СуммаУчет;
			ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C7").Текст = СтрокаТовары.СуммаПоФакту;
			ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C8").Текст = СтрокаТовары.СуммаРазница;
			ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C9").Текст = СтрокаТовары.Комментарий;
			Если ВестиУчетСерийНоменклатуры Тогда
				ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C10").Текст = СтрокаТовары.СерияНоменклатуры;
			КонецЕсли;
			
		ИначеЕсли КорректировкиИРегистрацияОстатков Тогда
			ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C1").Текст = Номенклатура;
			ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C2").Текст = СтрокаТовары.Склад;
			ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C3").Текст = СтрокаТовары.Номенклатура;
			ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C4").Текст = СтрокаТовары.Количество ;
			ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C5").Текст = СтрокаТовары.Цена;
			ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C6").Текст = СтрокаТовары.Сумма;
			ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C7").Текст = СтрокаТовары.ОСтроке;
			Если ИспользоватьЕдиницыИзмеренияНоменклатуры Тогда
				ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C8").Текст = СтрокаТовары.ЕдиницаИзмерения;
			КонецЕсли;
			Если ВестиУчетСерийНоменклатуры Тогда
				ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C9").Текст = СтрокаТовары.СерияНоменклатуры;
			КонецЕсли;
			
		ИначеЕсли ПеремещенияТовара Тогда	
			ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C1").Текст = Номенклатура;
			ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C2").Текст = СтрокаТовары.Количество;
			ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C3").Текст = СтрокаТовары.Цена;
			ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C4").Текст = СтрокаТовары.Сумма;
			ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C5").Текст = СтрокаТовары.ОСтроке;
			Если ИспользоватьЕдиницыИзмеренияНоменклатуры Тогда
				ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C6").Текст = СтрокаТовары.ЕдиницаИзмерения;
			КонецЕсли;
			Если ВестиУчетСерийНоменклатуры Тогда
				ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C7").Текст = СтрокаТовары.СерияНоменклатуры;
			КонецЕсли;
			
		ИначеЕсли ПланыПродаж Тогда	          
			ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C1").Текст = Номенклатура;
			ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C2").Текст = СтрокаТовары.Количество;
			ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C3").Текст = СтрокаТовары.Сумма;
			ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C4").Текст = СтрокаТовары.ОСтроке;
			
		ИначеЕсли ПоступленияТовара Тогда	          
			ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C1").Текст = Номенклатура    ;
			ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C2").Текст = СтрокаТовары.Количество;
			ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C3").Текст = СтрокаТовары.Цена;
			ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C4").Текст = СтрокаТовары.Сумма;
			ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C5").Текст = СтрокаТовары.ОСтроке;
			Если ИспользоватьЕдиницыИзмеренияНоменклатуры Тогда
				ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C6").Текст = СтрокаТовары.ЕдиницаИзмерения;
			КонецЕсли;
			Если ВестиУчетСерийНоменклатуры Тогда
				ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C7").Текст = СтрокаТовары.СерияНоменклатуры;
			КонецЕсли;
			
		ИначеЕсли РасходыТовара Тогда	          
			ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C1").Текст = Номенклатура     ;
			ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C2").Текст = СтрокаТовары.Количество;
			ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C3").Текст = СтрокаТовары.Цена;
			ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C4").Текст = СтрокаТовары.Сумма;
			ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C5").Текст = СтрокаТовары.ПроцентСкидки;
			ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C6").Текст = СтрокаТовары.СуммаБезСкидки;
			ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C7").Текст = СтрокаТовары.ОСтроке;
			Если ИспользоватьЕдиницыИзмеренияНоменклатуры Тогда
				ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C8").Текст = СтрокаТовары.ЕдиницаИзмерения;
			КонецЕсли;
			Если ВестиУчетСерийНоменклатуры Тогда
				ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C9").Текст = СтрокаТовары.СерияНоменклатуры;
			КонецЕсли;
			
		ИначеЕсли УстановкиЦен Тогда	          
			ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C1").Текст = Номенклатура  ;
			ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C2").Текст = СтрокаТовары.СтараяЦена;
			ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C3").Текст = СтрокаТовары.Цена;
			ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C4").Текст = СтрокаТовары.РазницаЦены;
			ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C5").Текст = СтрокаТовары.Комментарий;
			Если ИспользоватьЕдиницыИзмеренияНоменклатуры Тогда
				ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C6").Текст = СтрокаТовары.ЕдиницаИзмерения;
			КонецЕсли;
			
		ИначеЕсли ОтчетыКомиссионеров Тогда
			ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C1").Текст = Номенклатура  ;
			ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C2").Текст = СтрокаТовары.Количество;
			ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C3").Текст = СтрокаТовары.Цена;
			ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C4").Текст = СтрокаТовары.Сумма;
			ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C5").Текст = СтрокаТовары.ЧастныйПроцентКомиссионногоВознаграждения;
			ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C6").Текст = СтрокаТовары.СуммаКомиссионногоВознаграждения;
			ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C7").Текст = СтрокаТовары.ОСтроке;
			Если ИспользоватьЕдиницыИзмеренияНоменклатуры Тогда
				ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C8").Текст = СтрокаТовары.ЕдиницаИзмерения;
			КонецЕсли;
			Если ВестиУчетСерийНоменклатуры Тогда
				ДокументДляПечати.Область("R" + СчетчикСтрокиТекст + "C9").Текст = СтрокаТовары.СерияНоменклатуры;
			КонецЕсли;
			
		КонецЕсли;
		СчетчикСтрок = СчетчикСтрок + 1;
	КонецЦикла;	
	
	ДокументДляПечати.Записать(АдресФайла, ТипФайлаТабличногоДокумента.XLS97);
	
КонецПроцедуры
&НаСервере
функция   ПолучитьОтносительныйАдресНаСервере();
	Возврат Константы.ПодсистемаИЭИмпортЭкспортОтносительныйАдресФайлов.Получить();
КонецФункции
