//sza131117-0209
&НаСервере
Процедура ВыгрузитьНаСервере(АдресФайла, ПараметрКоманды)
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ВЫГР" + СокрЛП(ИмяКомпьютера());
	ТабДок.КлючПараметровПечати = ТабДок.ИмяПараметровПечати;
	
	ТипЗнчДокументссылка	= ТипЗнч(ПараметрКоманды.ссылка);
	ПеремещенияТовара 		= ТипЗнчДокументссылка = Тип("ДокументСсылка.ПеремещенияТовара");
	Инвентаризации			= ТипЗнчДокументссылка = Тип("ДокументСсылка.Инвентаризации");
	ПоступленияТовара 		= ТипЗнчДокументссылка = Тип("ДокументСсылка.ПоступленияТовара");
	РасходыТовара 			= ТипЗнчДокументссылка = Тип("ДокументСсылка.РасходыТовара");
	УстановкиЦен 			= ТипЗнчДокументссылка = Тип("ДокументСсылка.УстановкиЦен");
	ПланыПродаж 			= ТипЗнчДокументссылка = Тип("ДокументСсылка.ПланыПродаж");
	Договора 				= ТипЗнчДокументссылка = Тип("СправочникСсылка.Договора");
	УстановкиЦен 			= ТипЗнчДокументссылка = Тип("ДокументСсылка.УстановкиЦен");
	КорректировкиИРегистрацияОстатков = ТипЗнчДокументссылка = Тип("ДокументСсылка.КорректировкиИРегистрацияОстатков");
	
	сч = 1;
	Для Каждого СтрокаТовары Из ПараметрКоманды.Товары Цикл
		
		Если ПланыПродаж тогда
			Номенклатура = СтрокаТовары.НоменклатураИлиГруппа;
		Иначе
			Номенклатура = ?(ЗначениеЗаполнено(СтрокаТовары.Номенклатура.НаименованиеДляПечати), СтрокаТовары.Номенклатура.НаименованиеДляПечати, СтрокаТовары.Номенклатура.Наименование);	
		КонецЕсли;
		
		
		Если Договора Тогда
			Табдок.Область("R" + сч + "C1").Текст = Номенклатура;
			Табдок.Область("R" + сч + "C2").Текст = СтрокаТовары.Цена ;
			Табдок.Область("R" + сч + "C3").Текст = СтрокаТовары.Коментарий;
			
		Иначеесли Инвентаризации тогда
			Табдок.Область("R" + сч + "C1").Текст = Номенклатура;
			Табдок.Область("R" + сч + "C2").Текст = СтрокаТовары.КоличествоУчет ;
			Табдок.Область("R" + сч + "C3").Текст = СтрокаТовары.КоличествоПоФакту;
			Табдок.Область("R" + сч + "C4").Текст = СтрокаТовары.КоличествоРазница ;
			Табдок.Область("R" + сч + "C5").Текст = СтрокаТовары.Цена;
			Табдок.Область("R" + сч + "C6").Текст = СтрокаТовары.СуммаУчет;
			Табдок.Область("R" + сч + "C7").Текст = СтрокаТовары.СуммаПоФакту;
			Табдок.Область("R" + сч + "C8").Текст = СтрокаТовары.СуммаРазница;
			Табдок.Область("R" + сч + "C9").Текст = СтрокаТовары.Коментарий;
			
		Иначеесли КорректировкиИРегистрацияОстатков тогда
			Табдок.Область("R" + сч + "C1").Текст = Номенклатура;
			Табдок.Область("R" + сч + "C2").Текст = СтрокаТовары.Склад;
			Табдок.Область("R" + сч + "C3").Текст = СтрокаТовары.Номенклатура;
			Табдок.Область("R" + сч + "C4").Текст = СтрокаТовары.Количество ;
			Табдок.Область("R" + сч + "C5").Текст = СтрокаТовары.Цена;
			Табдок.Область("R" + сч + "C6").Текст = СтрокаТовары.Сумма;
			Табдок.Область("R" + сч + "C7").Текст = СтрокаТовары.ОСтроке;
			
		Иначеесли ПеремещенияТовара тогда	
			Табдок.Область("R" + сч + "C1").Текст = Номенклатура;
			Табдок.Область("R" + сч + "C2").Текст = СтрокаТовары.Количество;
			Табдок.Область("R" + сч + "C3").Текст = СтрокаТовары.Цена;
			Табдок.Область("R" + сч + "C4").Текст = СтрокаТовары.Сумма;
			Табдок.Область("R" + сч + "C5").Текст = СтрокаТовары.ОСтроке;
			
		Иначеесли ПланыПродаж тогда	          
			Табдок.Область("R" + сч + "C1").Текст = Номенклатура;
			Табдок.Область("R" + сч + "C2").Текст = СтрокаТовары.Количество;
			Табдок.Область("R" + сч + "C3").Текст = СтрокаТовары.Сумма;
			Табдок.Область("R" + сч + "C4").Текст = СтрокаТовары.ОСтроке;
			
		Иначеесли ПоступленияТовара тогда	          
			Табдок.Область("R" + сч + "C1").Текст = Номенклатура    ;
			Табдок.Область("R" + сч + "C2").Текст = СтрокаТовары.Количество;
			Табдок.Область("R" + сч + "C3").Текст = СтрокаТовары.Цена;
			Табдок.Область("R" + сч + "C4").Текст = СтрокаТовары.Сумма;
			Табдок.Область("R" + сч + "C5").Текст = СтрокаТовары.ОСтроке;
			
		Иначеесли РасходыТовара тогда	          
			Табдок.Область("R" + сч + "C1").Текст = Номенклатура     ;
			Табдок.Область("R" + сч + "C2").Текст = СтрокаТовары.Количество;
			Табдок.Область("R" + сч + "C3").Текст = СтрокаТовары.Цена;
			Табдок.Область("R" + сч + "C4").Текст = СтрокаТовары.Сумма;
			Табдок.Область("R" + сч + "C5").Текст = СтрокаТовары.ПроцентСкидки;
			Табдок.Область("R" + сч + "C6").Текст = СтрокаТовары.СуммаБезСкидки;
			Табдок.Область("R" + сч + "C7").Текст = СтрокаТовары.ОСтроке;
			
		Иначеесли УстановкиЦен тогда	          
			Табдок.Область("R" + сч + "C1").Текст = Номенклатура  ;
			Табдок.Область("R" + сч + "C2").Текст = СтрокаТовары.СтараяЦена;
			Табдок.Область("R" + сч + "C3").Текст = СтрокаТовары.Цена;
			Табдок.Область("R" + сч + "C4").Текст = СтрокаТовары.РазницаЦены;
			Табдок.Область("R" + сч + "C9").Текст = СтрокаТовары.Коментарий;
			
		КонецЕсли;
		сч = сч + 1;
	КонецЦикла;	
	
	Табдок.Записать(АдресФайла, ТипФайлаТабличногоДокумента.XLS97);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("002700", , , );	
	
	Если НЕ Отказ Тогда
	АдресФайла = ПолучитьОтносительныйАдресНаСервере();
	
	ДиалогФильтр	 = ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Файл Excel") + " (*.xls)|*.xls";
	ДиалогРасширение = "xls";
	ДиалогВыбФайла 	 = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогВыбФайла.Заголовок				=	ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите имя файла Excel");
	ДиалогВыбФайла.ПолноеИмяФайла			=	"";
	ДиалогВыбФайла.Фильтр					=	ДиалогФильтр;
	ДиалогВыбФайла.Расширение				=	ДиалогРасширение;
	ДиалогВыбФайла.МножественныйВыбор		=	ЛОЖЬ;
	ДиалогВыбФайла.ПредварительныйПросмотр	=	ЛОЖЬ;
	ДиалогВыбФайла.ИндексФильтра			=	0;
	
	Если ДиалогВыбФайла.Выбрать() Тогда
		АдресФайла = ДиалогВыбФайла.ПолноеИмяФайла;
		Состояние(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Идет Выгрузка данных.."), , ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Ждите.."));
		
		ВыгрузитьНаСервере(АдресФайла, ПараметрКоманды);
		
		ОбщийМодульСервер.ДобавитьСобытиеЖурналаНаСервере(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Выгрузил данные в файл") + ": " + АдресФайла, 2);
	КонецЕсли; 	
			   КонецЕсли;
	
КонецПроцедуры

&насервере
функция   ПолучитьОтносительныйАдресНаСервере();
	Возврат Константы.ПодсистемаИЭИмпортЭкспортОтносительныйАдресФайлов.Получить();
КонецФункции



