//sza140521-0127 SZA: 
//sza140107-0258 : 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Отказ Тогда
		ОбщийМодульСервер.ОбеспечитьСписокОтборов(Список);
		
		ТипВладельца = Параметры.ТипВладельца;
		Если ЗначениеЗаполнено(ТипВладельца) Тогда
			ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("ЭтоРеквизитДляОбъекта");
			ЭлементОтбора.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.Использование    = Истина;
			ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
			ЭлементОтбора.ПравоеЗначение   = ТипВладельца;
		КонецЕсли;         	
		
	Иначе
		Элементы.ТипВладельца.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры
