// sza150131-0324

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	Получатель = Неопределено;
	ПоказатьВводЗначения(Новый ОписаниеОповещения("ОбработкаКомандыЗавершение", ЭтотОбъект, Новый Структура("ПараметрКоманды, Получатель", ПараметрКоманды, Получатель)), Получатель, ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Укажите получателя") + ": ", тип("СправочникСсылка.Пользователи"));

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКомандыЗавершение(Значение, ДополнительныеПараметры) Экспорт

	ПараметрКоманды = ДополнительныеПараметры.ПараметрКоманды;
	Получатель = ?(Значение = Неопределено, ДополнительныеПараметры.Получатель, Значение);
	Если ЗначениеЗаполнено(Получатель) Тогда
		ПараметрыФормы = Новый Структура("Ссылка", ПараметрКоманды);
		ПараметрыФормы.Вставить("Получатель", Получатель);
		ОткрытьФорму("РегистрСведений.СообщенияПользователюОтСистемы.Форма.ФормаЗаписи", ПараметрыФормы);// , ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	КонецЕсли;

КонецПроцедуры
